////////////////////////////////////////////////////////////////////////////////
//
// ЗатратыСервер: Распределение производственных затрат и затрат незавершенного производства.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Процедура выполняет запись движений производственных затрат.
//
// Параметры:
//	ДополнительныеСвойства - Структура - структура с данными для записи
//	Движения - Движения - Движения регистра "Производственные затраты"
//	Отказ - Булево - Признак отказа от записи движений
//
Процедура ОтразитьМатериалыИРаботыВПроизводстве(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаМатериалыИРаботыВПроизводстве;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Набор = Движения.МатериалыИРаботыВПроизводстве;
	Набор.Записывать = Истина;
	Набор.Загрузить(Таблица);
	
КонецПроцедуры

// Процедура выполняет запись движений партий производственных затрат.
//
// Параметры:
//	ДополнительныеСвойства - Структура - структура с данными для записи
//	Движения - Движения - Движения регистра "Партии производственных затрат"
//	Отказ - Булево - Признак отказа от записи движений
//
Процедура ОтразитьПартииПроизводственныхЗатрат(ДополнительныеСвойства, Движения, Отказ) Экспорт

	Таблица = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПартииПроизводственныхЗатрат;
	
	Если Отказ ИЛИ Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Набор = Движения.ПартииПроизводственныхЗатрат;
	Набор.Записывать = Истина;
	Набор.Загрузить(Таблица);
	
КонецПроцедуры

// Процедура проверяет дату документа на соответствие дате перехода на партионный учет версии 2.2.
// Проверка выполняется для документов нового производства.
//
// Параметры:
//	Объект - ДокументОбъект.ЭтапПроизводства2_2, ДокументОбъект.ДвижениеПродукцииИМатериалов - проверяемый документ,
//	Дата - Дата - дата, на которую выполняется проверка,
//	Отказ - Булево - устанавливается в ИСТИНА, если дата перехода на новый партионный учет больше переданной даты.
//
Процедура ПроверитьИспользованиеПартионногоУчета22(Объект, Дата, Отказ) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Возврат;
	КонецЕсли;
	
	ДатаПереходаНаПартионныйУчетВерсии22 = УниверсальныеМеханизмыПартийИСебестоимостиПовтИсп.ДатаПереходаНаПартионныйУчетВерсии22();
	
	ТекстОшибки = Неопределено;
	
	Если НЕ УниверсальныеМеханизмыПартийИСебестоимостиПовтИсп.ПартионныйУчетВерсии22() Тогда
		
		ТекстОшибки = НСтр("ru='Для операций, доступных с версии 2.2, требуется установить соответствующий режим партионного учета.'");
		
	ИначеЕсли ДатаПереходаНаПартионныйУчетВерсии22 > НачалоМесяца(Дата) Тогда
		
		ТекстОшибки = НСтр("ru='Регистрация операций, доступных с версии 2.2, раньше даты перехода на партионный учет версии 2.2 недоступна.
								|Требуется изменить дату операции (%1) или дату перехода на партионный учет 2.2 (%2).'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстОшибки,
			Формат(Дата, "ДЛФ=D"),
			Формат(ДатаПереходаНаПартионныйУчетВерсии22, "ДЛФ=D"));
			
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Объект,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры



Функция ТекстЗапросаПроизводственныеЗатратыТМЦ() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Склад КАК Склад,
	|	ДД.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ СкладыПодразделения
	|ИЗ
	|	(ВЫБРАТЬ
	|		Т.Ссылка КАК Склад,
	|		Т.Подразделение КАК Подразделение
	|	ИЗ
	|		Справочник.Склады КАК Т
	|	ГДЕ
	|		Т.ЦеховаяКладовая
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Ссылка,
	|		Т.Ссылка
	|	ИЗ
	|		Справочник.СтруктураПредприятия КАК Т
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДД.АналитикаУчетаНоменклатуры.Склад,
	|		НЕОПРЕДЕЛЕНО
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров.ОстаткиИОбороты(&НачалоПериода, &ОкончаниеПериода, , , АналитикаУчетаНоменклатуры.Склад ССЫЛКА Справочник.Партнеры) КАК ДД
	|	ГДЕ
	|		(ДД.КоличествоНачальныйОстаток <> 0
	|			ИЛИ ДД.КоличествоКонечныйОстаток <> 0
	|			ИЛИ ДД.КоличествоПриход <> 0
	|			ИЛИ ДД.КоличествоРасход <> 0)) КАК ДД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	СкладыПодразделения.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ Выпуски
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК СкладыПодразделения
	|		ПО (Аналитика.Склад = СкладыПодразделения.Склад)
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|								ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДД.Таблица                                             КАК Таблица,
	|	ДД.Содержание                                          КАК Содержание,
	|	ДД.Организация                                         КАК Организация,
	|	ДД.Подразделение                                       КАК Подразделение,
	|	ДД.Отправитель                                         КАК Отправитель,
	|	ДД.Получатель                                          КАК Получатель,
	|	ДД.СкладПодразделение                                  КАК СкладПодразделение,
	|	ДД.Регистратор                                         КАК Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры                          КАК АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов                                          КАК ВидЗапасов,
	|	ДД.АналитикаФинансовогоУчета                           КАК АналитикаФинансовогоУчета,
	|	ДД.АналитикаУчетаПартий                                КАК АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС                                  КАК ВидДеятельностиНДС,
	|	ДД.Номенклатура                                        КАК Номенклатура,
	|	ДД.Характеристика                                      КАК Характеристика,
	|	ДД.Серия                                               КАК Серия,
	|	ДД.Назначение                                          КАК Назначение,
	|	ДД.НаправлениеДеятельности                             КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции                                   КАК СтатьяКалькуляции,
	|	ДД.Партия                                              КАК Партия,
	|	ДД.ПартияПроизводства                                  КАК ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство                                 КАК ЗаказНаПроизводство,
	
	|	СУММА(ДД.аНачальныйОстатокКоличество)                  КАК аНачальныйОстатокКоличество,
	|	СУММА(ДД.аНачальныйОстатокСтоимость)                   КАК аНачальныйОстатокСтоимость,
	|	СУММА(ДД.аНачальныйОстатокПР)                          КАК аНачальныйОстатокПР,
	|	СУММА(ДД.аНачальныйОстатокВР)                          КАК аНачальныйОстатокВР,
	|	СУММА(ДД.аНачальныйОстатокЗабалансовая)                КАК аНачальныйОстатокЗабалансовая,
	
	|	СУММА(ДД.бПоступилоКоличество) КАК бПоступилоКоличество,
	|	СУММА(ДД.бПоступилоСтоимость) КАК бПоступилоСтоимость,
	|	СУММА(ДД.бПоступилоПР) КАК бПоступилоПР,
	|	СУММА(ДД.бПоступилоВР) КАК бПоступилоВР,
	|	СУММА(ДД.бПоступилоЗабалансовая) КАК бПоступилоЗабалансовая,
	
	|	СУММА(ДД.вПеремещенияКоличество) КАК вПеремещенияКоличество,
	|	СУММА(ДД.вПеремещенияСтоимость) КАК вПеремещенияСтоимость,
	|	СУММА(ДД.вПеремещенияПР) КАК вПеремещенияПР,
	|	СУММА(ДД.вПеремещенияВР) КАК вПеремещенияВР,
	|	СУММА(ДД.вПеремещенияЗабалансовая) КАК вПеремещенияЗабалансовая,
	
	|	СУММА(ДД.гРасходНаПроизводствоКоличество) КАК гРасходНаПроизводствоКоличество,
	|	СУММА(ДД.гРасходНаПроизводствоСтоимость) КАК гРасходНаПроизводствоСтоимость,
	|	СУММА(ДД.гРасходНаПроизводствоПР) КАК гРасходНаПроизводствоПР,
	|	СУММА(ДД.гРасходНаПроизводствоВР) КАК гРасходНаПроизводствоВР,
	|	СУММА(ДД.гРасходНаПроизводствоЗабалансовая) КАК гРасходНаПроизводствоЗабалансовая,
	
	|	СУММА(ДД.дСписаноКоличество) КАК дСписаноКоличество,
	|	СУММА(ДД.дСписаноСтоимость) КАК дСписаноСтоимость,
	|	СУММА(ДД.дСписаноПР) КАК дСписаноПР,
	|	СУММА(ДД.дСписаноВР) КАК дСписаноВР,
	|	СУММА(ДД.дСписаноЗабалансовая) КАК дСписаноЗабалансовая,
	
	|	СУММА(ДД.еКонечныйОстатокКоличество) КАК еКонечныйОстатокКоличество,
	|	СУММА(ДД.еКонечныйОстатокСтоимость) КАК еКонечныйОстатокСтоимость,
	|	СУММА(ДД.еКонечныйОстатокПР) КАК еКонечныйОстатокПР,
	|	СУММА(ДД.еКонечныйОстатокВР) КАК еКонечныйОстатокВР,
	|	СУММА(ДД.еКонечныйОстатокЗабалансовая) КАК еКонечныйОстатокЗабалансовая,
	
	|	СУММА(ДД.жПереданоКоличество) КАК жПереданоКоличество,
	|	СУММА(ДД.жПереданоСтоимость) КАК жПереданоСтоимость,
	|	СУММА(ДД.жПереданоПР) КАК жПереданоПР,
	|	СУММА(ДД.жПереданоВР) КАК жПереданоВР,
	|	СУММА(ДД.жПереданоЗабалансовая) КАК жПереданоЗабалансовая
	|{ВЫБРАТЬ
	|Таблица,
	|Содержание,
	|Организация.*,
	|Подразделение.*,
	|Отправитель.*,
	|Получатель.*,
	|СкладПодразделение.*,
	|Регистратор.*,
	|АналитикаУчетаНоменклатуры.*,
	|ВидЗапасов.*,
	|АналитикаФинансовогоУчета.*,
	|АналитикаУчетаПартий.*,
	|ВидДеятельностиНДС.*,
	|Номенклатура.*,
	|Характеристика.*,
	|Серия.*,
	|Назначение.*,
	|НаправлениеДеятельности.*,
	|СтатьяКалькуляции.*,
	|Партия.*,
	|ПартияПроизводства.*,
	|ЗаказНаПроизводство.*,
	|аНачальныйОстатокКоличество,
	|аНачальныйОстатокСтоимость,
	|аНачальныйОстатокПР,
	|аНачальныйОстатокВР,
	|аНачальныйОстатокЗабалансовая,
	|бПоступилоКоличество,
	|бПоступилоСтоимость,
	|бПоступилоПР,
	|бПоступилоВР,
	|бПоступилоЗабалансовая,
	|вПеремещенияКоличество,
	|вПеремещенияСтоимость,
	|вПеремещенияПР,
	|вПеремещенияВР,
	|вПеремещенияЗабалансовая,
	|гРасходНаПроизводствоКоличество,
	|гРасходНаПроизводствоСтоимость,
	|гРасходНаПроизводствоПР,
	|гРасходНаПроизводствоВР,
	|гРасходНаПроизводствоЗабалансовая,
	|дСписаноКоличество,
	|дСписаноСтоимость,
	|дСписаноПР,
	|дСписаноВР,
	|дСписаноЗабалансовая,
	|еКонечныйОстатокКоличество,
	|еКонечныйОстатокСтоимость,
	|еКонечныйОстатокПР,
	|еКонечныйОстатокВР,
	|еКонечныйОстатокЗабалансовая,
	|жПереданоКоличество,
	|жПереданоСтоимость,
	|жПереданоПР,
	|жПереданоВР,
	|жПереданоЗабалансовая}
	|ИЗ
	|
	|(ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Выпуски.Подразделение ЕСТЬ NULL
	|			ТОГДА ""Материалы""
	|		ИНАЧЕ ""Продукция""
	|	КОНЕЦ                                                  КАК Таблица,
	|	""Начальный остаток""                                  КАК Содержание,
	|	ДД.Организация                                         КАК Организация,
	|	СкладыПодразделения.Подразделение                      КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО                                           КАК Отправитель,
	|	НЕОПРЕДЕЛЕНО                                           КАК Получатель,
	|	Аналитика.Склад                                        КАК СкладПодразделение,
	|	НЕОПРЕДЕЛЕНО                                           КАК Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры                          КАК АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов                                          КАК ВидЗапасов,
	|	ДД.АналитикаФинансовогоУчета                           КАК АналитикаФинансовогоУчета,
	|	ДД.АналитикаУчетаПартий                                КАК АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС                                  КАК ВидДеятельностиНДС,
	|	Аналитика.Номенклатура                                 КАК Номенклатура,
	|	Аналитика.Характеристика                               КАК Характеристика,
	|	Аналитика.Серия                                        КАК Серия,
	|	Аналитика.Назначение                                   КАК Назначение,
	|	Аналитика.Назначение.НаправлениеДеятельности           КАК НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции                            КАК СтатьяКалькуляции,
	|	ДД.Партия                                              КАК Партия,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ                                                  КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ                                                  КАК ЗаказНаПроизводство,
	|	ДД.КоличествоОстаток                                   КАК аНачальныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток + ДД.ДопРасходыОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеСНДСОстаток + ДД.ПостатейныеПеременныеСНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьРеглОстаток + ДД.ДопРасходыРеглОстаток + ДД.ТрудозатратыРеглОстаток + ДД.ПостатейныеПостоянныеРеглОстаток + ДД.ПостатейныеПеременныеРеглОстаток
	|	КОНЕЦ                                                  КАК аНачальныйОстатокСтоимость,
	|	ДД.ПостояннаяРазницаОстаток                            КАК аНачальныйОстатокПР,
	|	ДД.ВременнаяРазницаОстаток                             КАК аНачальныйОстатокВР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьЗабалансоваяОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансоваяРеглОстаток
	|	КОНЕЦ                                                  КАК аНачальныйОстатокЗабалансовая,
	
	|	0 КАК бПоступилоКоличество,
	|	0 КАК бПоступилоСтоимость,
	|	0 КАК бПоступилоПР,
	|	0 КАК бПоступилоВР,
	|	0 КАК бПоступилоЗабалансовая,
	
	|	0 КАК вПеремещенияКоличество,
	|	0 КАК вПеремещенияСтоимость,
	|	0 КАК вПеремещенияПР,
	|	0 КАК вПеремещенияВР,
	|	0 КАК вПеремещенияЗабалансовая,
	
	|	0 КАК гРасходНаПроизводствоКоличество,
	|	0 КАК гРасходНаПроизводствоСтоимость,
	|	0 КАК гРасходНаПроизводствоПР,
	|	0 КАК гРасходНаПроизводствоВР,
	|	0 КАК гРасходНаПроизводствоЗабалансовая,
	
	|	0 КАК дСписаноКоличество,
	|	0 КАК дСписаноСтоимость,
	|	0 КАК дСписаноПР,
	|	0 КАК дСписаноВР,
	|	0 КАК дСписаноЗабалансовая,
	
	|	0 КАК еКонечныйОстатокКоличество,
	|	0 КАК еКонечныйОстатокСтоимость,
	|	0 КАК еКонечныйОстатокПР,
	|	0 КАК еКонечныйОстатокВР,
	|	0 КАК еКонечныйОстатокЗабалансовая,
	
	|	0 КАК жПереданоКоличество,
	|	0 КАК жПереданоСтоимость,
	|	0 КАК жПереданоПР,
	|	0 КАК жПереданоВР,
	|	0 КАК жПереданоЗабалансовая
	
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			{(&НачалоПериода)},
	|			НЕ &БезОтбораПоПериоду
	|				И (АналитикаУчетаНоменклатуры.Склад.ЦеховаяКладовая
	|					ИЛИ АналитикаУчетаНоменклатуры.Склад ССЫЛКА Справочник.СтруктураПредприятия)) КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК СкладыПодразделения
	|		ПО (Аналитика.Склад = СкладыПодразделения.Склад)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Выпуски КАК Выпуски
	|		ПО ДД.АналитикаУчетаНоменклатуры = Выпуски.АналитикаУчетаНоменклатуры
	|			И (СкладыПодразделения.Подразделение = Выпуски.Подразделение)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Выпуски.Подразделение ЕСТЬ NULL
	|			ТОГДА ""Материалы""
	|		ИНАЧЕ ""Продукция""
	|	КОНЕЦ,
	|	""Поступило со склада или кладовых других цехов и приходы по перемещениям"",
	|	ДД.Организация,
	|	КорСкладыПодразделения.Подразделение,
	|	Аналитика.Склад,
	|	КорАналитика.Склад,
	|	КорАналитика.Склад,
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	ДД.КорВидЗапасов,
	|	ДД.КорАналитикаФинансовогоУчета,
	|	ДД.КорАналитикаУчетаПартий,
	|	ДД.КорВидДеятельностиНДС,
	|	КорАналитика.Номенклатура,
	|	КорАналитика.Характеристика,
	|	КорАналитика.Серия,
	|	КорАналитика.Назначение,
	|	КорАналитика.Назначение.НаправлениеДеятельности,
	|	КорАналитика.СтатьяКалькуляции,
	|	ДД.Партия,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение <> КорСкладыПодразделения.Подразделение
	|				ИЛИ СкладыПодразделения.Подразделение ЕСТЬ NULL
	|			ТОГДА ДД.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение <> КорСкладыПодразделения.Подразделение
	|				ИЛИ СкладыПодразделения.Подразделение ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|					КОГДА &ДанныеПоСебестоимости = 2
	|						ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|					КОГДА &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение <> КорСкладыПодразделения.Подразделение
	|				ИЛИ СкладыПодразделения.Подразделение ЕСТЬ NULL
	|			ТОГДА ДД.ПостояннаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение <> КорСкладыПодразделения.Подразделение
	|				ИЛИ СкладыПодразделения.Подразделение ЕСТЬ NULL
	|			ТОГДА ДД.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение <> КорСкладыПодразделения.Подразделение
	|				ИЛИ СкладыПодразделения.Подразделение ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА 0
	|					КОГДА &ДанныеПоСебестоимости = 2
	|						ТОГДА СтоимостьЗабалансовая
	|					КОГДА &ДанныеПоСебестоимости = 3
	|						ТОГДА СтоимостьЗабалансоваяРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,

	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение = КорСкладыПодразделения.Подразделение
	|			ТОГДА ДД.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение = КорСкладыПодразделения.Подразделение
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|					КОГДА &ДанныеПоСебестоимости = 2
	|						ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|					КОГДА &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение = КорСкладыПодразделения.Подразделение
	|			ТОГДА ДД.ПостояннаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение = КорСкладыПодразделения.Подразделение
	|			ТОГДА ДД.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение = КорСкладыПодразделения.Подразделение
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА 0
	|					КОГДА &ДанныеПоСебестоимости = 2
	|						ТОГДА ДД.СтоимостьЗабалансовая
	|					КОГДА &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитика
	|		ПО ДД.КорАналитикаУчетаНоменклатуры = КорАналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК КорСкладыПодразделения
	|		ПО (КорАналитика.Склад = КорСкладыПодразделения.Склад)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК СкладыПодразделения
	|		ПО (Аналитика.Склад = СкладыПодразделения.Склад)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Выпуски КАК Выпуски
	|		ПО ДД.КорАналитикаУчетаНоменклатуры = Выпуски.АналитикаУчетаНоменклатуры
	|			И (КорСкладыПодразделения.Подразделение = Выпуски.Подразделение)
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И КорАналитика.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	И Аналитика.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	И (КорАналитика.Склад.ЦеховаяКладовая
	|			ИЛИ КорАналитика.Склад ССЫЛКА Справочник.СтруктураПредприятия
	|			ИЛИ КорАналитика.Склад ССЫЛКА Справочник.Партнеры
	|			ИЛИ Аналитика.Склад ССЫЛКА Справочник.СтруктураПредприятия
	|			ИЛИ Аналитика.Склад ССЫЛКА Справочник.Партнеры)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Выпуски.Подразделение ЕСТЬ NULL
	|			ТОГДА ""Материалы""
	|		ИНАЧЕ ""Продукция""
	|	КОНЕЦ,
	|	""Расходы по перемещениям, передачи на склад, в другие кладовые, в производство"",
	|	ДД.Организация,
	|	СкладыПодразделения.Подразделение,
	|	Аналитика.Склад,
	|	КорАналитика.Склад,
	|	Аналитика.Склад,
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	Аналитика.Назначение.НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции,
	|	ДД.Партия,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
	|			ТОГДА ДД.КорПартия
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
	|			ТОГДА ДД.КорПартия.Распоряжение
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	
	// начальный остаток
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// поступило
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// перемещения
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение = КорСкладыПодразделения.Подразделение
	|				И НЕ ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию))
	|			ТОГДА -1 * ДД.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение = КорСкладыПодразделения.Подразделение
	|				И НЕ ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию))
	|			ТОГДА -1 * ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|					КОГДА &ДанныеПоСебестоимости = 2
	|						ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|					КОГДА &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение = КорСкладыПодразделения.Подразделение
	|				И НЕ ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию))
	|			ТОГДА -1 * ДД.ПостояннаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение = КорСкладыПодразделения.Подразделение
	|				И НЕ ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию))
	|			ТОГДА -1 * ДД.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.Подразделение = КорСкладыПодразделения.Подразделение
	|				И НЕ ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию))
	|			ТОГДА -1 * ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА 0
	|					КОГДА &ДанныеПоСебестоимости = 2
	|						ТОГДА ДД.СтоимостьЗабалансовая
	|					КОГДА &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	
	// на производство
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
	|			ТОГДА ДД.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|					КОГДА &ДанныеПоСебестоимости = 2
	|						ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|					КОГДА &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
	|			ТОГДА ДД.ПостояннаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
	|			ТОГДА ДД.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА 0
	|					КОГДА &ДанныеПоСебестоимости = 2
	|						ТОГДА ДД.СтоимостьЗабалансовая
	|					КОГДА &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	
	// списание
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// конечный остаток
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// передача на склад
	|	ВЫБОР
	|		КОГДА (СкладыПодразделения.Подразделение <> КорСкладыПодразделения.Подразделение
	|				ИЛИ КорСкладыПодразделения.Подразделение ЕСТЬ NULL)
	|					И ДД.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
	|			ТОГДА ДД.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (СкладыПодразделения.Подразделение <> КорСкладыПодразделения.Подразделение
	|				ИЛИ КорСкладыПодразделения.Подразделение ЕСТЬ NULL)
	|					И ДД.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|					КОГДА &ДанныеПоСебестоимости = 2
	|						ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|					КОГДА &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (СкладыПодразделения.Подразделение <> КорСкладыПодразделения.Подразделение
	|				ИЛИ КорСкладыПодразделения.Подразделение ЕСТЬ NULL)
	|					И ДД.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
	|			ТОГДА ДД.ПостояннаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (СкладыПодразделения.Подразделение <> КорСкладыПодразделения.Подразделение
	|				ИЛИ КорСкладыПодразделения.Подразделение ЕСТЬ NULL)
	|					И ДД.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
	|			ТОГДА ДД.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (СкладыПодразделения.Подразделение <> КорСкладыПодразделения.Подразделение
	|				ИЛИ КорСкладыПодразделения.Подразделение ЕСТЬ NULL)
	|					И ДД.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА 0
	|					КОГДА &ДанныеПоСебестоимости = 2
	|						ТОГДА ДД.СтоимостьЗабалансовая
	|					КОГДА &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ
	
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитика
	|		ПО ДД.КорАналитикаУчетаНоменклатуры = КорАналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК КорСкладыПодразделения
	|		ПО (КорАналитика.Склад = КорСкладыПодразделения.Склад)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК СкладыПодразделения
	|		ПО (Аналитика.Склад = СкладыПодразделения.Склад)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Выпуски КАК Выпуски
	|		ПО ДД.АналитикаУчетаНоменклатуры = Выпуски.АналитикаУчетаНоменклатуры
	|			И (СкладыПодразделения.Подразделение = Выпуски.Подразделение)
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И Аналитика.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	И (Аналитика.Склад.ЦеховаяКладовая
	|			ИЛИ Аналитика.Склад ССЫЛКА Справочник.СтруктураПредприятия
	|			ИЛИ Аналитика.Склад ССЫЛКА Справочник.Партнеры
	|			ИЛИ КорАналитика.Склад ССЫЛКА Справочник.СтруктураПредприятия
	|			ИЛИ КорАналитика.Склад ССЫЛКА Справочник.Партнеры)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ДД.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Выпуски.Подразделение ЕСТЬ NULL
	|			ТОГДА ""Материалы""
	|		ИНАЧЕ ""Продукция""
	|	КОНЕЦ,
	|	""Списания на расходы"",
	|	ДД.Организация,
	|	СкладыПодразделения.Подразделение,
	|	Аналитика.Склад,
	|	ДД.СтатьяРасходовСписания,
	|	Аналитика.Склад,
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	Аналитика.Назначение.НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции,
	|	ДД.Партия,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	
	// начальный остаток
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// поступило
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// перемещения
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// на производство
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// списание
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ,
	
	// конечный остаток
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	// передача на склад
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитика
	|		ПО ДД.КорАналитикаУчетаНоменклатуры = КорАналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК КорСкладыПодразделения
	|		ПО (КорАналитика.Склад = КорСкладыПодразделения.Склад)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК СкладыПодразделения
	|		ПО (Аналитика.Склад = СкладыПодразделения.Склад)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Выпуски КАК Выпуски
	|		ПО ДД.АналитикаУчетаНоменклатуры = Выпуски.АналитикаУчетаНоменклатуры
	|			И (СкладыПодразделения.Подразделение = Выпуски.Подразделение)
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И Аналитика.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	И (Аналитика.Склад.ЦеховаяКладовая
	|			ИЛИ Аналитика.Склад ССЫЛКА Справочник.СтруктураПредприятия)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Выпуски.Подразделение ЕСТЬ NULL
	|			ТОГДА ""Материалы""
	|		ИНАЧЕ ""Продукция""
	|	КОНЕЦ,
	|	""Приходы от поставщика и выпуски продукции"",
	|	ДД.Организация,
	|	СкладыПодразделения.Подразделение,
	|	ЕСТЬNULL(РеквизитыПроизводстваБезЗаказа.Подразделение, ЕСТЬNULL(РеквизитыОтчетов.Подразделение, СкладыПодразделения.Подразделение)),
	|	Аналитика.Склад,
	|	Аналитика.Склад,
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	Аналитика.Назначение.НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции,
	|	ДД.Партия,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|			ТОГДА ДД.Партия
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|			ТОГДА ЕСТЬNULL(ПродукцияОтчета.ЭтапПроизводства.Распоряжение, ЕСТЬNULL(ОтходыОтчета.ЭтапПроизводства.Распоряжение, ДД.Партия.Распоряжение))
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,

	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК СкладыПодразделения
	|		ПО (Аналитика.Склад = СкладыПодразделения.Склад)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Выпуски КАК Выпуски
	|		ПО ДД.АналитикаУчетаНоменклатуры = Выпуски.АналитикаУчетаНоменклатуры
	|			И (СкладыПодразделения.Подразделение = Выпуски.Подразделение)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа КАК РеквизитыПроизводстваБезЗаказа
	|		ПО ДД.Регистратор = РеквизитыПроизводстваБезЗаказа.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика КАК РеквизитыОтчетов
	|		ПО ДД.Регистратор = РеквизитыОтчетов.Ссылка
	
	//заказ на производство по отчетам переработчика по этапам выбираем из этапов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика.Продукция КАК ПродукцияОтчета
	|		ПО ДД.Регистратор = ПродукцияОтчета.Ссылка
	|			И ДД.АналитикаУчетаПартий.КодСтроки = ПродукцияОтчета.КодСтроки
	|			И ПродукцияОтчета.Ссылка.ГруппировкаЗатрат = ЗНАЧЕНИЕ(Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика.Продукция КАК ОтходыОтчета
	|		ПО ДД.Регистратор = ОтходыОтчета.Ссылка
	|			И ДД.АналитикаУчетаПартий.КодСтроки = ОтходыОтчета.КодСтроки
	|			И ОтходыОтчета.Ссылка.ГруппировкаЗатрат = ЗНАЧЕНИЕ(Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства)
	
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И (Аналитика.Склад.ЦеховаяКладовая
	|			ИЛИ Аналитика.Склад ССЫЛКА Справочник.СтруктураПредприятия
	|			ИЛИ Аналитика.Склад ССЫЛКА Справочник.Партнеры)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Аналитика.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	И ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|								ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость),
	|								ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Выпуски.Подразделение ЕСТЬ NULL
	|			ТОГДА ""Материалы""
	|		ИНАЧЕ ""Продукция""
	|	КОНЕЦ,
	|	""Конечный остаток"",
	|	ДД.Организация,
	|	СкладыПодразделения.Подразделение,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	Аналитика.Склад,
	|	НЕОПРЕДЕЛЕНО,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	Аналитика.Назначение.НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции,
	|	ДД.Партия,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,

	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	ДД.КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток + ДД.ДопРасходыОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеСНДСОстаток + ДД.ПостатейныеПеременныеСНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьРеглОстаток + ДД.ДопРасходыРеглОстаток + ДД.ТрудозатратыРеглОстаток + ДД.ПостатейныеПостоянныеРеглОстаток + ДД.ПостатейныеПеременныеРеглОстаток
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазницаОстаток,
	|	ДД.ВременнаяРазницаОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьЗабалансоваяОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансоваяРеглОстаток
	|	КОНЕЦ,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			{(&ОкончаниеПериодаГраница)},
	|			АналитикаУчетаНоменклатуры.Склад.ЦеховаяКладовая
	|				ИЛИ АналитикаУчетаНоменклатуры.Склад ССЫЛКА Справочник.СтруктураПредприятия) КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК СкладыПодразделения
	|		ПО (Аналитика.Склад = СкладыПодразделения.Склад)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Выпуски КАК Выпуски
	|		ПО ДД.АналитикаУчетаНоменклатуры = Выпуски.АналитикаУчетаНоменклатуры
	|			И (СкладыПодразделения.Подразделение = Выпуски.Подразделение)
	|) КАК ДД
	|
	|СГРУППИРОВАТЬ ПО
	|
	|	ДД.Таблица,
	|	ДД.Содержание,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Отправитель,
	|	ДД.Получатель,
	|	ДД.СкладПодразделение,
	|	ДД.Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.Номенклатура,
	|	ДД.Характеристика,
	|	ДД.Серия,
	|	ДД.Назначение,
	|	ДД.НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	ДД.Партия,
	|	ДД.ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство
	|";
	
	Ресурсы = Новый Массив;
	
	Ресурсы.Добавить("аНачальныйОстатокКоличество");
	Ресурсы.Добавить("аНачальныйОстатокСтоимость");
	Ресурсы.Добавить("аНачальныйОстатокПР");
	Ресурсы.Добавить("аНачальныйОстатокВР");
	Ресурсы.Добавить("аНачальныйОстатокЗабалансовая");
	
	Ресурсы.Добавить("бПоступилоКоличество");
	Ресурсы.Добавить("бПоступилоСтоимость");
	Ресурсы.Добавить("бПоступилоПР");
	Ресурсы.Добавить("бПоступилоВР");
	Ресурсы.Добавить("бПоступилоЗабалансовая");
	
	Ресурсы.Добавить("вПеремещенияКоличество");
	Ресурсы.Добавить("вПеремещенияСтоимость");
	Ресурсы.Добавить("вПеремещенияПР");
	Ресурсы.Добавить("вПеремещенияВР");
	Ресурсы.Добавить("вПеремещенияЗабалансовая");
	
	Ресурсы.Добавить("гРасходНаПроизводствоКоличество");
	Ресурсы.Добавить("гРасходНаПроизводствоСтоимость");
	Ресурсы.Добавить("гРасходНаПроизводствоПР");
	Ресурсы.Добавить("гРасходНаПроизводствоВР");
	Ресурсы.Добавить("гРасходНаПроизводствоЗабалансовая");
	
	Ресурсы.Добавить("дСписаноКоличество");
	Ресурсы.Добавить("дСписаноСтоимость");
	Ресурсы.Добавить("дСписаноПР");
	Ресурсы.Добавить("дСписаноВР");
	Ресурсы.Добавить("дСписаноЗабалансовая");
	
	Ресурсы.Добавить("еКонечныйОстатокКоличество");
	Ресурсы.Добавить("еКонечныйОстатокСтоимость");
	Ресурсы.Добавить("еКонечныйОстатокПР");
	Ресурсы.Добавить("еКонечныйОстатокВР");
	Ресурсы.Добавить("еКонечныйОстатокЗабалансовая");
	
	Ресурсы.Добавить("жПереданоКоличество");
	Ресурсы.Добавить("жПереданоСтоимость");
	Ресурсы.Добавить("жПереданоПР");
	Ресурсы.Добавить("жПереданоВР");
	Ресурсы.Добавить("жПереданоЗабалансовая");
	
	Возврат Новый Структура("ТекстЗапроса, Ресурсы", ТекстЗапроса, Ресурсы);
	
КонецФункции

Функция ТекстЗапросаПроизводственныеЗатратыПостатейные() Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДД.Таблица                                             КАК Таблица,
	|	ДД.Содержание                                          КАК Содержание,
	|	ДД.Организация                                         КАК Организация,
	|	ДД.Подразделение                                       КАК Подразделение,
	|	ДД.Отправитель                                         КАК Отправитель,
	|	ДД.Получатель                                          КАК Получатель,
	|	ДД.Регистратор                                         КАК Регистратор,
	|	ДД.СтатьяРасходов                                      КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов                                   КАК АналитикаРасходов,
	|	ДД.НаправлениеДеятельности                             КАК НаправлениеДеятельности,
	|	ДД.ПартияПроизводства                                  КАК ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство                                 КАК ЗаказНаПроизводство,
	
	|	СУММА(ДД.аНачальныйОстатокСтоимость)                   КАК аНачальныйОстатокСтоимость,
	|	СУММА(ДД.аНачальныйОстатокПР)                          КАК аНачальныйОстатокПР,
	|	СУММА(ДД.аНачальныйОстатокВР)                          КАК аНачальныйОстатокВР,
	
	|	СУММА(ДД.бПоступилоСтоимость)                          КАК бПоступилоСтоимость,
	|	СУММА(ДД.бПоступилоПР)                                 КАК бПоступилоПР,
	|	СУММА(ДД.бПоступилоВР)                                 КАК бПоступилоВР,
	
	|	СУММА(ДД.гРасходНаПроизводствоСтоимость)               КАК гРасходНаПроизводствоСтоимость,
	|	СУММА(ДД.гРасходНаПроизводствоПР)                      КАК гРасходНаПроизводствоПР,
	|	СУММА(ДД.гРасходНаПроизводствоВР)                      КАК гРасходНаПроизводствоВР,
	
	|	СУММА(ДД.еКонечныйОстатокСтоимость)                    КАК еКонечныйОстатокСтоимость,
	|	СУММА(ДД.еКонечныйОстатокПР)                           КАК еКонечныйОстатокПР,
	|	СУММА(ДД.еКонечныйОстатокВР)                           КАК еКонечныйОстатокВР
	|{ВЫБРАТЬ
	|Таблица,
	|Содержание,
	|Организация.*,
	|Подразделение.*,
	|Отправитель.*,
	|Получатель.*,
	|Регистратор.*,
	|СтатьяРасходов.*,
	|АналитикаРасходов.*,
	|НаправлениеДеятельности.*,
	|ПартияПроизводства.*,
	|ЗаказНаПроизводство.*,
	|аНачальныйОстатокСтоимость,
	|аНачальныйОстатокПР,
	|аНачальныйОстатокВР,
	|бПоступилоСтоимость,
	|бПоступилоПР,
	|бПоступилоВР,
	|гРасходНаПроизводствоСтоимость,
	|гРасходНаПроизводствоПР,
	|гРасходНаПроизводствоВР,
	|еКонечныйОстатокСтоимость,
	|еКонечныйОстатокПР,
	|еКонечныйОстатокВР}
	|	
	|ИЗ
	|
	|(ВЫБРАТЬ
	|	""Постатейные""                                        КАК Таблица,
	|	""Начальный остаток""                                  КАК Содержание,
	|	ДД.Организация                                         КАК Организация,
	|	ДД.Подразделение                                       КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК Отправитель,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК Получатель,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ                                                  КАК Регистратор,
	|	ДД.СтатьяРасходов                                      КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов                                   КАК АналитикаРасходов,
	|	ДД.НаправлениеДеятельности                             КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО                                           КАК ПартияПроизводства,
	|	НЕОПРЕДЕЛЕНО                                           КАК ЗаказНаПроизводство,
	
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СуммаОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СуммаБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СуммаРеглОстаток
	|	КОНЕЦ                                                  КАК аНачальныйОстатокСтоимость,
	|	ДД.ПостояннаяРазницаОстаток                            КАК аНачальныйОстатокПР,
	|	ДД.ВременнаяРазницаОстаток                             КАК аНачальныйОстатокВР,
	
	|	0                                                      КАК бПоступилоСтоимость,
	|	0                                                      КАК бПоступилоПР,
	|	0                                                      КАК бПоступилоВР,
	
	|	0                                                      КАК гРасходНаПроизводствоСтоимость,
	|	0                                                      КАК гРасходНаПроизводствоПР,
	|	0                                                      КАК гРасходНаПроизводствоВР,
	
	|	0                                                      КАК еКонечныйОстатокСтоимость,
	|	0                                                      КАК еКонечныйОстатокПР,
	|	0                                                      КАК еКонечныйОстатокВР
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы.Остатки(
	|			{(&НачалоПериода)},
	|			НЕ &БезОтбораПоПериоду
	|				И (СтатьяРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|					ИЛИ СтатьяРасходов.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты))) КАК ДД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Постатейные"",
	|	""Закупка услуг, регистрация, отражение зарплаты"",
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	ДД.Подразделение,
	|	ДД.Регистратор,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	
	|	0,
	|	0,
	|	0,
	
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Сумма
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СуммаБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СуммаРегл
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК ДД
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И (ДД.СтатьяРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|					ИЛИ ДД.СтатьяРасходов.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты))
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Постатейные"",
	|	""Распределение на производство"",
	|	ДД.Организация,
	|	Реквизиты.Подразделение,
	|	Реквизиты.Подразделение,
	|	ДД.Подразделение,
	|	ДД.Регистратор,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	Реквизиты.НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ДД.ПартияПроизводства
	|		ИНАЧЕ ДД.ЗаказНаПроизводство
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ДД.ПартияПроизводства.Распоряжение
	|		ИНАЧЕ ДД.ЗаказНаПроизводство
	|	КОНЕЦ,
	
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьРегл
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Реквизиты
	|		ПО ДД.Регистратор = Реквизиты.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Постатейные"",
	|	""Списание на другие статьи, выбытие"",
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ДД.КорСтатьяРасходов,
	|	ДД.Регистратор,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	
	|	0,
	|	0,
	|	0,
	
	|	-1 * ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Сумма
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СуммаБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СуммаРегл
	|	КОНЕЦ,
	|	-1 * ДД.ПостояннаяРазница,
	|	-1 * ДД.ВременнаяРазница,
	
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК ДД
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И (ДД.СтатьяРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|					ИЛИ ДД.СтатьяРасходов.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты))
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ДД.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Постатейные"",
	|	""Конечный остаток"",
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СуммаОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СуммаБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СуммаРеглОстаток
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазницаОстаток,
	|	ДД.ВременнаяРазницаОстаток
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы.Остатки(
	|			{(&ОкончаниеПериодаГраница)},
	|			(СтатьяРасходов.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты)
	|					ИЛИ СтатьяРасходов.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты))) КАК ДД) КАК ДД
	|
	|СГРУППИРОВАТЬ ПО
	|
	|	ДД.Таблица,
	|	ДД.Содержание,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Отправитель,
	|	ДД.Получатель,
	|	ДД.Регистратор,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности,
	|	ДД.ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство";
	
	Ресурсы = Новый Массив;
	Ресурсы.Добавить("аНачальныйОстатокСтоимость");
	Ресурсы.Добавить("аНачальныйОстатокПР");
	Ресурсы.Добавить("аНачальныйОстатокВР");
	
	Ресурсы.Добавить("бПоступилоСтоимость");
	Ресурсы.Добавить("бПоступилоПР");
	Ресурсы.Добавить("бПоступилоВР");
	
	Ресурсы.Добавить("гРасходНаПроизводствоСтоимость");
	Ресурсы.Добавить("гРасходНаПроизводствоПР");
	Ресурсы.Добавить("гРасходНаПроизводствоВР");
	
	Ресурсы.Добавить("еКонечныйОстатокСтоимость");
	Ресурсы.Добавить("еКонечныйОстатокПР");
	Ресурсы.Добавить("еКонечныйОстатокВР");
	
	Возврат Новый Структура("ТекстЗапроса, Ресурсы", ТекстЗапроса, Ресурсы);
	
КонецФункции

Функция ТекстЗапросаПроизводственныеЗатратыПоПартиямПроизводства() Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДД.Таблица                                КАК Таблица,
	|	ДД.Содержание                             КАК Содержание,
	|	ДД.ТипЗатрат                              КАК ТипЗатрат,
	|	ДД.Организация                            КАК Организация,
	|	ДД.Подразделение                          КАК Подразделение,
	|	ДД.ПодразделениеОтправитель               КАК ПодразделениеОтправитель,
	|	ДД.ПодразделениеВыпуска                   КАК ПодразделениеВыпуска,
	|	ДД.Регистратор                            КАК Регистратор,
	|	ДД.НаправлениеДеятельности                КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции                      КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры             КАК АналитикаУчетаНоменклатуры,
	|	ДД.Номенклатура                           КАК Номенклатура,
	|	ДД.Характеристика                         КАК Характеристика,
	|	ДД.Серия                                  КАК Серия,
	|	ДД.Назначение                             КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот                               КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов                         КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов                      КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.АналитикаУчетаПродукции                КАК АналитикаУчетаПродукции,
	|	ДД.Продукция                              КАК Продукция,
	|	ДД.ХарактеристикаПродукции                КАК ХарактеристикаПродукции,
	|	ДД.СерияПродукции                         КАК СерияПродукции,
	|	ДД.НазначениеПродукции                    КАК НазначениеПродукции,
	|	
	|	ДД.ПартияПроизводства                     КАК ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство                    КАК ЗаказНаПроизводство,
	
	|	СУММА(ДД.аНачальныйОстатокКоличество)     КАК аНачальныйОстатокКоличество,
	|	СУММА(ДД.аНачальныйОстатокСтоимость)      КАК аНачальныйОстатокСтоимость,
	|	СУММА(ДД.аНачальныйОстатокПР)             КАК аНачальныйОстатокПР,
	|	СУММА(ДД.аНачальныйОстатокВР)             КАК аНачальныйОстатокВР,
	|	СУММА(ДД.аНачальныйОстатокЗабалансовая)   КАК аНачальныйОстатокЗабалансовая,
	|	
	|	СУММА(ДД.бПоступилоКоличество)            КАК бПоступилоКоличество,
	|	СУММА(ДД.бПоступилоСтоимость)             КАК бПоступилоСтоимость,
	|	СУММА(ДД.бПоступилоПР)                    КАК бПоступилоПР,
	|	СУММА(ДД.бПоступилоВР)                    КАК бПоступилоВР,
	|	СУММА(ДД.бПоступилоЗабалансовая)          КАК бПоступилоЗабалансовая,
	|	
	|	СУММА(ДД.гРасходНаПроизводствоКоличество) КАК гРасходНаПроизводствоКоличество,
	|	СУММА(ДД.гРасходНаПроизводствоСтоимость)  КАК гРасходНаПроизводствоСтоимость,
	|	СУММА(ДД.гРасходНаПроизводствоПР)         КАК гРасходНаПроизводствоПР,
	|	СУММА(ДД.гРасходНаПроизводствоВР)         КАК гРасходНаПроизводствоВР,
	|	СУММА(ДД.гРасходНаПроизводствоЗабалансовая)КАК гРасходНаПроизводствоЗабалансовая,
	|	
	|	СУММА(ДД.еКонечныйОстатокКоличество)      КАК еКонечныйОстатокКоличество,
	|	СУММА(ДД.еКонечныйОстатокСтоимость)       КАК еКонечныйОстатокСтоимость,
	|	СУММА(ДД.еКонечныйОстатокПР)              КАК еКонечныйОстатокПР,
	|	СУММА(ДД.еКонечныйОстатокВР)              КАК еКонечныйОстатокВР,
	|	СУММА(ДД.еКонечныйОстатокЗабалансовая)    КАК еКонечныйОстатокЗабалансовая
	|{ВЫБРАТЬ
	|Таблица,
	|Содержание,
	|ТипЗатрат.*,
	|Организация.*,
	|Подразделение.*,
	|ПодразделениеОтправитель.*,
	|ПодразделениеВыпуска.*,
	|Регистратор.*,
	|НаправлениеДеятельности.*,
	|СтатьяКалькуляции.*,
	|АналитикаУчетаНоменклатуры.*,
	|Номенклатура.*,
	|Характеристика.*,
	|Серия.*,
	|Назначение.*,
	|ВидРабот.*,
	|СтатьяРасходов.*,
	|АналитикаРасходов.*,
	|АналитикаУчетаПродукции.*,
	|Продукция.*,
	|ХарактеристикаПродукции.*,
	|СерияПродукции.*,
	|НазначениеПродукции.*,
	|ПартияПроизводства.*,
	|ЗаказНаПроизводство.*,
	|аНачальныйОстатокКоличество,
	|аНачальныйОстатокСтоимость,
	|аНачальныйОстатокПР,
	|аНачальныйОстатокВР,
	|аНачальныйОстатокЗабалансовая,
	|бПоступилоКоличество,
	|бПоступилоСтоимость,
	|бПоступилоПР,
	|бПоступилоВР,
	|бПоступилоЗабалансовая,
	|гРасходНаПроизводствоКоличество,
	|гРасходНаПроизводствоСтоимость,
	|гРасходНаПроизводствоПР,
	|гРасходНаПроизводствоВР,
	|гРасходНаПроизводствоЗабалансовая,
	|еКонечныйОстатокКоличество,
	|еКонечныйОстатокСтоимость,
	|еКонечныйОстатокПР,
	|еКонечныйОстатокВР,
	|еКонечныйОстатокЗабалансовая}
	|ИЗ
	// материалы
	|(ВЫБРАТЬ
	|	""Производство"" КАК Таблица,
	|	""Начальный остаток (материалы)"" КАК Содержание,
	|	Значение(Перечисление.ТипыЗатрат.Материальные) КАК ТипЗатрат,
	|	ДД.Организация КАК Организация,
	|	Аналитика.Склад КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеОтправитель,
	|	ВЫБОР
	|		КОГДА ДД.Партия Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.Партия КАК Документ.ЭтапПроизводства2_2).Подразделение
	|		КОГДА ДД.Партия Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.Партия КАК Документ.ПроизводствоБезЗаказа).Подразделение
	|		КОГДА ДД.Партия Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.Партия КАК Документ.ОтчетПереработчика).Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ КАК ПодразделениеВыпуска,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	Аналитика.Назначение.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Аналитика.Номенклатура КАК Номенклатура,
	|	Аналитика.Характеристика КАК Характеристика,
	|	Аналитика.Серия КАК Серия,
	|	Аналитика.Назначение КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|	
	|	ДД.Партия КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ДД.Партия Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.Партия КАК Документ.ЭтапПроизводства2_2).Распоряжение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	ДД.КоличествоОстаток        КАК аНачальныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток + ДД.ДопРасходыОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеСНДСОстаток + ДД.ПостатейныеПеременныеСНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьРеглОстаток + ДД.ДопРасходыРеглОстаток + ДД.ТрудозатратыРеглОстаток + ДД.ПостатейныеПостоянныеРеглОстаток + ДД.ПостатейныеПеременныеРеглОстаток
	|	КОНЕЦ                       КАК аНачальныйОстатокСтоимость,
	|	ДД.ПостояннаяРазницаОстаток КАК аНачальныйОстатокПР,
	|	ДД.ВременнаяРазницаОстаток  КАК аНачальныйОстатокВР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьЗабалансоваяОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансоваяРеглОстаток
	|	КОНЕЦ                       КАК аНачальныйОстатокЗабалансовая,
	|	
	|	0 КАК бПоступилоКоличество,
	|	0 КАК бПоступилоСтоимость,
	|	0 КАК бПоступилоПР,
	|	0 КАК бПоступилоВР,
	|	0 КАК бПоступилоЗабалансовая,
	|	
	|	0 КАК гРасходНаПроизводствоКоличество,
	|	0 КАК гРасходНаПроизводствоСтоимость,
	|	0 КАК гРасходНаПроизводствоПР,
	|	0 КАК гРасходНаПроизводствоВР,
	|	0 КАК гРасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК еКонечныйОстатокКоличество,
	|	0 КАК еКонечныйОстатокСтоимость,
	|	0 КАК еКонечныйОстатокПР,
	|	0 КАК еКонечныйОстатокВР,
	|	0 КАК еКонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			{(&НачалоПериода)},
	|			НЕ &БезОтбораПоПериоду
	|				И АналитикаУчетаНоменклатуры.Склад ССЫЛКА Справочник.СтруктураПредприятия
	|				И (АналитикаУчетаНоменклатуры.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|						ИЛИ Партия Ссылка Документ.ЗаказНаПроизводство)) КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Поступило на незавершенное производство (материалы) для 2.2"",
	|	Значение(Перечисление.ТипыЗатрат.Материальные),
	|	ДД.Организация,
	|	КорАналитика.Склад,
	|	Аналитика.Склад,
	|	ВЫБОР
	|		КОГДА ДД.КорПартия Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.КорПартия КАК Документ.ЭтапПроизводства2_2).Подразделение
	|		КОГДА ДД.КорПартия Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.КорПартия КАК Документ.ПроизводствоБезЗаказа).Подразделение
	|		КОГДА ДД.КорПартия Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.КорПартия КАК Документ.ОтчетПереработчика).Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДД.Регистратор,
	|	КорАналитика.Назначение.НаправлениеДеятельности,
	|	КорАналитика.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	КорАналитика.Номенклатура,
	|	КорАналитика.Характеристика,
	|	КорАналитика.Серия,
	|	КорАналитика.Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.КорПартия,
	|	ВЫБОР
	|		КОГДА ДД.КорПартия Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.Партия КАК Документ.ЭтапПроизводства2_2).Распоряжение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	|	КОНЕЦ,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|			ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитика
	|			ПО ДД.КорАналитикаУчетаНоменклатуры = КорАналитика.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И КорАналитика.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Поступило на незавершенное производство (материалы) для 2.1"",
	|	Значение(Перечисление.ТипыЗатрат.Материальные),
	|	ДД.Организация,
	|	КорАналитика.Склад,
	|	Аналитика.Склад,
	|	КорАналитика.Склад,
	|	ДД.Регистратор,
	|	КорАналитика.Назначение.НаправлениеДеятельности,
	|	КорАналитика.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	КорАналитика.Номенклатура,
	|	КорАналитика.Характеристика,
	|	КорАналитика.Серия,
	|	КорАналитика.Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.КорПартия,
	|	ДД.КорПартия,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|			ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитика
	|			ПО ДД.КорАналитикаУчетаНоменклатуры = КорАналитика.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И (ДД.Регистратор Ссылка Документ.МаршрутныйЛистПроизводства
	|		ИЛИ (ДД.Регистратор Ссылка Документ.ВыпускПродукции И НЕ ВЫРАЗИТЬ(ДД.Регистратор КАК Документ.ВыпускПродукции).ВыпускПоРаспоряжениям)
	|		ИЛИ (ДД.Регистратор Ссылка Документ.РаспределениеПроизводственныхЗатрат И НЕ ВЫРАЗИТЬ(ДД.Регистратор КАК Документ.РаспределениеПроизводственныхЗатрат).НовоеПроизводство))
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Поступило на незавершенное производство (отходы по фиксированной стоимости)"",
	|	Значение(Перечисление.ТипыЗатрат.Материальные),
	|	ДД.Организация,
	|	Аналитика.Склад,
	|	КорАналитика.Склад,
	|	ВЫБОР
	|		КОГДА ДД.Партия Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.Партия КАК Документ.ЭтапПроизводства2_2).Подразделение
	|		КОГДА ДД.Партия Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.Партия КАК Документ.ПроизводствоБезЗаказа).Подразделение
	|		КОГДА ДД.Партия Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.Партия КАК Документ.ОтчетПереработчика).Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДД.Регистратор,
	|	Аналитика.Назначение.НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.Партия,
	|	ВЫБОР
	|		КОГДА ДД.Партия Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.Партия КАК Документ.ЭтапПроизводства2_2).Распоряжение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	|	КОНЕЦ,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|			ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитика
	|			ПО ДД.КорАналитикаУчетаНоменклатуры = КорАналитика.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И Аналитика.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Расход из незавершенного производства (материалы) для 2.2"",
	|	Значение(Перечисление.ТипыЗатрат.Материальные),
	|	ДД.Организация,
	|	Аналитика.Склад,
	|	Аналитика.Склад,
	|	ВЫБОР
	|		КОГДА ДД.Партия Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.Партия КАК Документ.ЭтапПроизводства2_2).Подразделение
	|		КОГДА ДД.Партия Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.Партия КАК Документ.ПроизводствоБезЗаказа).Подразделение
	|		КОГДА ДД.Партия Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.Партия КАК Документ.ОтчетПереработчика).Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДД.Регистратор,
	|	Аналитика.Назначение.НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	АналитикаПродукции.Номенклатура,
	|	АналитикаПродукции.Характеристика,
	|	АналитикаПродукции.Серия,
	|	АналитикаПродукции.Назначение,
	|	
	|	ДД.Партия,
	|	ВЫБОР
	|		КОГДА ДД.Партия Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.Партия КАК Документ.ЭтапПроизводства2_2).Распоряжение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	|	КОНЕЦ,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
	|		ПО ДД.КорАналитикаУчетаНоменклатуры = АналитикаПродукции.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И Аналитика.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Расход из незавершенного производства (материалы) для 2.1"",
	|	Значение(Перечисление.ТипыЗатрат.Материальные),
	|	ДД.Организация,
	|	Аналитика.Склад,
	|	Аналитика.Склад,
	|	Аналитика.Склад,
	|	ДД.Регистратор,
	|	Аналитика.Назначение.НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	АналитикаПродукции.Номенклатура,
	|	АналитикаПродукции.Характеристика,
	|	АналитикаПродукции.Серия,
	|	АналитикаПродукции.Назначение,
	|	
	|	ДД.Партия,
	|	ДД.Партия,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
	|		ПО ДД.КорАналитикаУчетаНоменклатуры = АналитикаПродукции.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ДД.Регистратор Ссылка Документ.ВыпускПродукции
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Конечный остаток (материалы)"",
	|	Значение(Перечисление.ТипыЗатрат.Материальные),
	|	ДД.Организация,
	|	Аналитика.Склад,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА ДД.Партия Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.Партия КАК Документ.ЭтапПроизводства2_2).Подразделение
	|		КОГДА ДД.Партия Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.Партия КАК Документ.ПроизводствоБезЗаказа).Подразделение
	|		КОГДА ДД.Партия Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.Партия КАК Документ.ОтчетПереработчика).Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО,
	|	Аналитика.Назначение.НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.Партия,
	|	ВЫБОР
	|		КОГДА ДД.Партия Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.Партия КАК Документ.ЭтапПроизводства2_2).Распоряжение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	|	КОНЕЦ,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток + ДД.ДопРасходыОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеСНДСОстаток + ДД.ПостатейныеПеременныеСНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьРеглОстаток + ДД.ДопРасходыРеглОстаток + ДД.ТрудозатратыРеглОстаток + ДД.ПостатейныеПостоянныеРеглОстаток + ДД.ПостатейныеПеременныеРеглОстаток
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазницаОстаток,
	|	ДД.ВременнаяРазницаОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьЗабалансоваяОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансоваяРеглОстаток
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			{(&ОкончаниеПериодаГраница)},
	|			АналитикаУчетаНоменклатуры.Склад ССЫЛКА Справочник.СтруктураПредприятия
	|				И (АналитикаУчетаНоменклатуры.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|						ИЛИ Партия Ссылка Документ.ЗаказНаПроизводство)) КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	// трудозатраты
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Начальный остаток (трудозатраты) для 2.2"" КАК Содержание,
	|	Значение(Перечисление.ТипыЗатрат.ОплатаТруда),
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ЭтапПроизводства2_2).Подразделение
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).Подразделение
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ОтчетПереработчика).Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ КАК ПодразделениеВыпуска,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ЭтапПроизводства2_2).НаправлениеДеятельности
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ПартияПроизводства КАК Партия,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ЭтапПроизводства2_2).Распоряжение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	ДД.КоличествоОстаток КАК аНачальныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|	КОНЕЦ КАК аНачальныйОстатокСтоимость,
	|	0,
	|	0,
	|	0,
	|	
	|	0 КАК бПоступилоКоличество,
	|	0 КАК бПоступилоСтоимость,
	|	0 КАК бПоступилоПР,
	|	0 КАК бПоступилоВР,
	|	0 КАК бПоступилоЗабалансовая,
	|	
	|	0 КАК гРасходНаПроизводствоКоличество,
	|	0 КАК гРасходНаПроизводствоСтоимость,
	|	0 КАК гРасходНаПроизводствоПР,
	|	0 КАК гРасходНаПроизводствоВР,
	|	0 КАК гРасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК еКонечныйОстатокКоличество,
	|	0 КАК еКонечныйОстатокСтоимость,
	|	0 КАК еКонечныйОстатокПР,
	|	0 КАК еКонечныйОстатокВР,
	|	0 КАК еКонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства.Остатки(
	|			{(&НачалоПериода)},
	|			ПартияПроизводства <> НЕОПРЕДЕЛЕНО
	|			И НЕ &БезОтбораПоПериоду) КАК ДД
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Начальный остаток (трудозатраты) для 2.1"" КАК Содержание,
	|	Значение(Перечисление.ТипыЗатрат.ОплатаТруда),
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	ДД.Подразделение КАК ПодразделениеВыпуска,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	ДД.ЗаказНаПроизводство.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ЗаказНаПроизводство КАК Партия,
	|	ДД.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	
	|	ДД.КоличествоОстаток КАК аНачальныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|	КОНЕЦ КАК аНачальныйОстатокСтоимость,
	|	0,
	|	0,
	|	0,
	|	
	|	0 КАК бПоступилоКоличество,
	|	0 КАК бПоступилоСтоимость,
	|	0 КАК бПоступилоПР,
	|	0 КАК бПоступилоВР,
	|	0 КАК бПоступилоЗабалансовая,
	|	
	|	0 КАК гРасходНаПроизводствоКоличество,
	|	0 КАК гРасходНаПроизводствоСтоимость,
	|	0 КАК гРасходНаПроизводствоПР,
	|	0 КАК гРасходНаПроизводствоВР,
	|	0 КАК гРасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК еКонечныйОстатокКоличество,
	|	0 КАК еКонечныйОстатокСтоимость,
	|	0 КАК еКонечныйОстатокПР,
	|	0 КАК еКонечныйОстатокВР,
	|	0 КАК еКонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства.Остатки(
	|			{(&НачалоПериода)},
	|			ПартияПроизводства = НЕОПРЕДЕЛЕНО
	|			И НЕ &БезОтбораПоПериоду) КАК ДД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Поступило на незавершенное производство (трудозатраты) для 2.2"",
	|	Значение(Перечисление.ТипыЗатрат.ОплатаТруда),
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ЭтапПроизводства2_2).Подразделение
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).Подразделение
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ОтчетПереработчика).Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДД.Регистратор,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ЭтапПроизводства2_2).НаправлениеДеятельности
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ЭтапПроизводства2_2).Распоряжение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	|	КОНЕЦ,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьРегл
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства КАК ДД
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ПартияПроизводства <> НЕОПРЕДЕЛЕНО
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Поступило на незавершенное производство (трудозатраты) для 2.1"",
	|	Значение(Перечисление.ТипыЗатрат.ОплатаТруда),
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ДД.Регистратор,
	|	ЕСТЬNULL(ДД.ЗаказНаПроизводство.НаправлениеДеятельности, ДД.ДокументВыпуска.НаправлениеДеятельности) КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ЗаказНаПроизводство,
	|	ДД.ЗаказНаПроизводство,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьРегл
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства КАК ДД
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ПартияПроизводства = НЕОПРЕДЕЛЕНО
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Расход из незавершенного производства (трудозатраты) для 2.2"",
	|	Значение(Перечисление.ТипыЗатрат.ОплатаТруда),
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ЭтапПроизводства2_2).Подразделение
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).Подразделение
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ОтчетПереработчика).Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДД.Регистратор,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ЭтапПроизводства2_2).НаправлениеДеятельности
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.КорАналитикаУчетаПродукции,
	|	АналитикаПродукции.Номенклатура,
	|	АналитикаПродукции.Характеристика,
	|	АналитикаПродукции.Серия,
	|	АналитикаПродукции.Назначение,
	|
	|	ДД.ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ЭтапПроизводства2_2).Распоряжение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьРегл
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
	|	ПО ДД.КорАналитикаУчетаПродукции = АналитикаПродукции.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ПартияПроизводства <> НЕОПРЕДЕЛЕНО
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Расход из незавершенного производства (трудозатраты) для 2.1"",
	|	Значение(Перечисление.ТипыЗатрат.ОплатаТруда),
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ДД.Регистратор,
	|	ЕСТЬNULL(ДД.ЗаказНаПроизводство.НаправлениеДеятельности, ДД.ДокументВыпуска.НаправлениеДеятельности) КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.КорАналитикаУчетаПродукции,
	|	АналитикаПродукции.Номенклатура,
	|	АналитикаПродукции.Характеристика,
	|	АналитикаПродукции.Серия,
	|	АналитикаПродукции.Назначение,
	|
	|	ВЫБОР
	|		КОГДА ДД.ЗаказНаПроизводство <> ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка)
	|			ТОГДА ДД.ЗаказНаПроизводство
	|		ИНАЧЕ
	|			ДД.ДокументВыпуска
	|	КОНЕЦ КАК Партия,
	|	ДД.ЗаказНаПроизводство,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьРегл
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
	|	ПО ДД.КорАналитикаУчетаПродукции = АналитикаПродукции.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ПартияПроизводства = НЕОПРЕДЕЛЕНО
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Конечный остаток (трудозатраты) для 2.2"",
	|	Значение(Перечисление.ТипыЗатрат.ОплатаТруда),
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ЭтапПроизводства2_2).Подразделение
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).Подразделение
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ОтчетПереработчика).Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ЭтапПроизводства2_2).НаправлениеДеятельности
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ЭтапПроизводства2_2).Распоряжение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	|	КОНЕЦ,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства.Остатки(
	|			{(&ОкончаниеПериодаГраница)},
	|			ПартияПроизводства <> НЕОПРЕДЕЛЕНО) КАК ДД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Конечный остаток (трудозатраты) для 2.1"",
	|	Значение(Перечисление.ТипыЗатрат.ОплатаТруда),
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	ДД.Подразделение,
	|	НЕОПРЕДЕЛЕНО,
	|	ДД.ЗаказНаПроизводство.НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ЗаказНаПроизводство,
	|	ДД.ЗаказНаПроизводство,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	ДД.КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства.Остатки(
	|			{(&ОкончаниеПериодаГраница)},
	|			ПартияПроизводства = НЕОПРЕДЕЛЕНО) КАК ДД
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	// постатейные
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Начальный остаток (постатейные) для 2.2"" КАК Содержание,
	|	Значение(Перечисление.ТипыЗатрат.Прочее),
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ЭтапПроизводства2_2).Подразделение
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).Подразделение
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ОтчетПереработчика).Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ЭтапПроизводства2_2).НаправлениеДеятельности
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ЭтапПроизводства2_2).Распоряжение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	|	КОНЕЦ,
	|	
	|	0                            КАК аНачальныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|	КОНЕЦ КАК аНачальныйОстатокСтоимость,
	|	ДД.ПостояннаяРазницаОстаток  КАК аНачальныйОстатокПР,
	|	ДД.ВременнаяРазницаОстаток   КАК аНачальныйОстатокВР,
	|	0                            КАК аНачальныйОстатокЗабалансовая,
	|	
	|	0 КАК бПоступилоКоличество,
	|	0 КАК бПоступилоСтоимость,
	|	0 КАК бПоступилоПР,
	|	0 КАК бПоступилоВР,
	|	0 КАК бПоступилоЗабалансовая,
	|	
	|	0 КАК гРасходНаПроизводствоКоличество,
	|	0 КАК гРасходНаПроизводствоСтоимость,
	|	0 КАК гРасходНаПроизводствоПР,
	|	0 КАК гРасходНаПроизводствоВР,
	|	0 КАК гРасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК еКонечныйОстатокКоличество,
	|	0 КАК еКонечныйОстатокСтоимость,
	|	0 КАК еКонечныйОстатокПР,
	|	0 КАК еКонечныйОстатокВР,
	|	0 КАК еКонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства.Остатки(
	|			{(&НачалоПериода)},
	|			ПартияПроизводства <> НЕОПРЕДЕЛЕНО И НЕ &БезОтбораПоПериоду) КАК ДД
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Начальный остаток (постатейные) для 2.1"" КАК Содержание,
	|	Значение(Перечисление.ТипыЗатрат.Прочее),
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	ДД.Подразделение,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	ДД.ЗаказНаПроизводство.НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ЗаказНаПроизводство,
	|	ДД.ЗаказНаПроизводство,
	|	
	|	0                            КАК аНачальныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|	КОНЕЦ КАК аНачальныйОстатокСтоимость,
	|	ДД.ПостояннаяРазницаОстаток  КАК аНачальныйОстатокПР,
	|	ДД.ВременнаяРазницаОстаток   КАК аНачальныйОстатокВР,
	|	0                            КАК аНачальныйОстатокЗабалансовая,
	|	
	|	0 КАК бПоступилоКоличество,
	|	0 КАК бПоступилоСтоимость,
	|	0 КАК бПоступилоПР,
	|	0 КАК бПоступилоВР,
	|	0 КАК бПоступилоЗабалансовая,
	|	
	|	0 КАК гРасходНаПроизводствоКоличество,
	|	0 КАК гРасходНаПроизводствоСтоимость,
	|	0 КАК гРасходНаПроизводствоПР,
	|	0 КАК гРасходНаПроизводствоВР,
	|	0 КАК гРасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК еКонечныйОстатокКоличество,
	|	0 КАК еКонечныйОстатокСтоимость,
	|	0 КАК еКонечныйОстатокПР,
	|	0 КАК еКонечныйОстатокВР,
	|	0 КАК еКонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства.Остатки(
	|			{(&НачалоПериода)},
	|			ПартияПроизводства = НЕОПРЕДЕЛЕНО И НЕ &БезОтбораПоПериоду) КАК ДД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Поступило на незавершенное производство (постатейные) для 2.2"",
	|	Значение(Перечисление.ТипыЗатрат.Прочее),
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	Реквизиты.Подразделение,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ЭтапПроизводства2_2).Подразделение
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).Подразделение
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ОтчетПереработчика).Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДД.Регистратор,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ЭтапПроизводства2_2).НаправлениеДеятельности
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ЭтапПроизводства2_2).Распоряжение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	|	КОНЕЦ,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьРегл
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Реквизиты
	|		ПО ДД.Регистратор = Реквизиты.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ПартияПроизводства <> НЕОПРЕДЕЛЕНО
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Поступило на незавершенное производство (постатейные) для 2.1"",
	|	Значение(Перечисление.ТипыЗатрат.Прочее),
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	Реквизиты.Подразделение,
	|	ДД.Подразделение,
	|	ДД.Регистратор,
	|	ДД.ЗаказНаПроизводство.НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ЗаказНаПроизводство,
	|	ВЫБОР
	|		КОГДА ДД.ЗаказНаПроизводство Ссылка Документ.ЗаказНаПроизводство
	|			ТОГДА ДД.ЗаказНаПроизводство
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка)
	|	КОНЕЦ,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьРегл
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Реквизиты
	|		ПО ДД.Регистратор = Реквизиты.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ПартияПроизводства = НЕОПРЕДЕЛЕНО
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Расход из незавершенного производства (постатейные) для 2.2"",
	|	Значение(Перечисление.ТипыЗатрат.Прочее),
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ЭтапПроизводства2_2).Подразделение
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).Подразделение
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ОтчетПереработчика).Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДД.Регистратор,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ЭтапПроизводства2_2).НаправлениеДеятельности
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.АналитикаУчетаПродукции,
	|	АналитикаПродукции.Номенклатура,
	|	АналитикаПродукции.Характеристика,
	|	АналитикаПродукции.Серия,
	|	АналитикаПродукции.Назначение,
	|
	|	ДД.ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ЭтапПроизводства2_2).Распоряжение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	|	КОНЕЦ,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьРегл
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
	|	ПО ДД.АналитикаУчетаПродукции = АналитикаПродукции.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ПартияПроизводства <> НЕОПРЕДЕЛЕНО
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Расход из незавершенного производства (постатейные) для 2.1"",
	|	Значение(Перечисление.ТипыЗатрат.Прочее),
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ДД.Регистратор,
	|	ДД.ЗаказНаПроизводство.НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.АналитикаУчетаПродукции,
	|	АналитикаПродукции.Номенклатура,
	|	АналитикаПродукции.Характеристика,
	|	АналитикаПродукции.Серия,
	|	АналитикаПродукции.Назначение,
	|
	|	ДД.ЗаказНаПроизводство,
	|	ВЫБОР
	|		КОГДА ДД.ЗаказНаПроизводство Ссылка Документ.ЗаказНаПроизводство
	|			ТОГДА ДД.ЗаказНаПроизводство
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка)
	|	КОНЕЦ,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьРегл
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	0,
	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
	|	ПО ДД.АналитикаУчетаПродукции = АналитикаПродукции.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ПартияПроизводства = НЕОПРЕДЕЛЕНО
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Конечный остаток (постатейные) для 2.2"",
	|	Значение(Перечисление.ТипыЗатрат.Прочее),
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ЭтапПроизводства2_2).Подразделение
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).Подразделение
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ОтчетПереработчика).Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ЭтапПроизводства2_2).НаправлениеДеятельности
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ПроизводствоБезЗаказа
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ПроизводствоБезЗаказа).НаправлениеДеятельности
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ОтчетПереработчика).НаправлениеДеятельности
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства Ссылка Документ.ЭтапПроизводства2_2
	|			ТОГДА ВЫРАЗИТЬ(ДД.ПартияПроизводства КАК Документ.ЭтапПроизводства2_2).Распоряжение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство2_2.ПустаяСсылка)
	|	КОНЕЦ,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазницаОстаток,
	|	ДД.ВременнаяРазницаОстаток,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства.Остатки(
	|			{(&ОкончаниеПериодаГраница)},
	|			ПартияПроизводства <> НЕОПРЕДЕЛЕНО) КАК ДД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Производство"",
	|	""Конечный остаток (постатейные) для 2.1"",
	|	Значение(Перечисление.ТипыЗатрат.Прочее),
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	ДД.Подразделение,
	|	НЕОПРЕДЕЛЕНО,
	|	ДД.ЗаказНаПроизводство.НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ЗаказНаПроизводство,
	|	ВЫБОР
	|		КОГДА ДД.ЗаказНаПроизводство Ссылка Документ.ЗаказНаПроизводство
	|			ТОГДА ДД.ЗаказНаПроизводство
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка)
	|	КОНЕЦ,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	
	|	0,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазницаОстаток,
	|	ДД.ВременнаяРазницаОстаток,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства.Остатки(
	|			{(&ОкончаниеПериодаГраница)},
	|			ПартияПроизводства = НЕОПРЕДЕЛЕНО) КАК ДД
	|) КАК ДД
	|
	|СГРУППИРОВАТЬ ПО
	|
	|	ДД.Таблица,
	|	ДД.Содержание,
	|	ДД.ТипЗатрат,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.ПодразделениеОтправитель,
	|	ДД.ПодразделениеВыпуска,
	|	ДД.Регистратор,
	|	ДД.НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.Номенклатура,
	|	ДД.Характеристика,
	|	ДД.Серия,
	|	ДД.Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.АналитикаУчетаПродукции,
	|	ДД.Продукция,
	|	ДД.ХарактеристикаПродукции,
	|	ДД.СерияПродукции,
	|	ДД.НазначениеПродукции,
	|	
	|	ДД.ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство
	|";
	
	Ресурсы = Новый Массив;
	
	Ресурсы.Добавить("аНачальныйОстатокКоличество");
	Ресурсы.Добавить("аНачальныйОстатокСтоимость");
	Ресурсы.Добавить("аНачальныйОстатокПР");
	Ресурсы.Добавить("аНачальныйОстатокВР");
	Ресурсы.Добавить("аНачальныйОстатокЗабалансовая");
	
	Ресурсы.Добавить("бПоступилоКоличество");
	Ресурсы.Добавить("бПоступилоСтоимость");
	Ресурсы.Добавить("бПоступилоПР");
	Ресурсы.Добавить("бПоступилоВР");
	Ресурсы.Добавить("бПоступилоЗабалансовая");

	Ресурсы.Добавить("гРасходНаПроизводствоКоличество");
	Ресурсы.Добавить("гРасходНаПроизводствоСтоимость");
	Ресурсы.Добавить("гРасходНаПроизводствоПР");
	Ресурсы.Добавить("гРасходНаПроизводствоВР");
	Ресурсы.Добавить("гРасходНаПроизводствоЗабалансовая");

	Ресурсы.Добавить("еКонечныйОстатокКоличество");
	Ресурсы.Добавить("еКонечныйОстатокСтоимость");
	Ресурсы.Добавить("еКонечныйОстатокПР");
	Ресурсы.Добавить("еКонечныйОстатокВР");
	Ресурсы.Добавить("еКонечныйОстатокЗабалансовая");
	
	Возврат Новый Структура("ТекстЗапроса, Ресурсы", ТекстЗапроса, Ресурсы);

КонецФункции

Процедура ДобавитьОтборПоВыбраннымРесурсам(Ресурсы, НаборДанных) Экспорт
	
	Если СтрНайти(НаборДанных.Запрос, "ИМЕЮЩИЕ") > 0 Тогда
		// в запросе уже есть отбор
		Возврат;
	КонецЕсли;
	
	НачалоЗапроса = "
	|ИМЕЮЩИЕ
	|	СУММА(%1) <> 0";
	
	ШаблонРесурса = "
	|	ИЛИ СУММА(%1) <> 0";
	
	ТекстОтбора = "";
	
	Для Каждого Поле Из НаборДанных.Поля Цикл
		Если Ресурсы.Найти(Поле.Имя) <> Неопределено Тогда
			
			Если ТекстОтбора = "" Тогда
				ТекстОтбора = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НачалоЗапроса, Поле.Имя);
			Иначе
				ТекстОтбора = ТекстОтбора + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонРесурса, Поле.Имя);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	НаборДанных.Запрос = НаборДанных.Запрос + ТекстОтбора;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти

