#Область ПрограммныйИнтерфейс
// Функция возвращает возможность работы модуля в асинхронном режиме.
// Стандартные команды модуля:
// - ПодключитьУстройство
// - ОтключитьУстройство
// - ВыполнитьКоманду
// Команды модуля для работы асинхронном режиме (должны быть определены):
// - НачатьПодключениеУстройства
// - НачатьОтключениеУстройства
// - НачатьВыполнениеКоманды.
//
Функция ПоддержкаАсинхронногоРежима () Экспорт
	
	Возврат Истина;
	
КонецФункции

// Функция осуществляет подключение устройства.
// Параметры:
//  ОбъектДрайвера       - <*>
//           - Объект драйвера торгового оборудования.
//  Параметры            - <Структура>
//           - Параметры устройства.
//  ПараметрыПодключения - <Структура>
//           - Параметры подключения устройства.
//  ВыходныеПараметры    - <Структура>
//           - ВыходныеПараметрыФункции.
//
// Возвращаемое значение:
//  <Булево> - Результат работы функции.
//
Функция ПодключитьУстройство(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт
	
	Результат      		= Истина;
	ВыходныеПараметры 	= Новый Массив();
	ОбъектДрайвера 		= Неопределено;
	ВходныеПараметры 	= Неопределено;
	
	ТокенПриложения = Неопределено;
	Магазин         = Неопределено;
	Терминал        = Неопределено;
	
	Параметры.Свойство("Токен", ТокенПриложения);
	Параметры.Свойство("Магазин", Магазин);
	Параметры.Свойство("Терминал", Терминал);
	
	Если ТокенПриложения = Неопределено Тогда
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Не настроены параметры устройства.
		|Для корректной работы устройства необходимо задать параметры его работы.'"));
		Результат = Ложь;
	Иначе
		ОбъектДрайвера = Новый Структура("Параметры", Параметры);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция начинает подключения устройства.
// Параметры:
//  ОповещениеПоЗавершении  - <*>
//           - Описание оповещения для выполнения.
//  ОбъектДрайвера          - <*>
//           - Объект драйвера торгового оборудования.
//  Параметры               - <Структура>
//           - Параметры устройства.
//  ПараметрыПодключения    - <Структура>
//           - Параметры подключения устройства.
//  ДополнительныеПараметры - <Структура>
//           - Дополнительные параметры команды.
//
// Возвращаемое значение:
//  <Булево> - Результат работы функции.
//
Процедура НачатьПодключениеУстройства(ОповещениеПриЗавершении, ОбъектДрайвера, Параметры, ПараметрыПодключения, ДополнительныеПараметры) Экспорт
	
	ВыходныеПараметры = Неопределено;
	Результат = ПодключитьУстройство(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
	
	РезультатВыполнения = Новый Структура("Результат, ВыходныеПараметры", Результат, ВыходныеПараметры);
	ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатВыполнения);
	
КонецПроцедуры

// Функция осуществляет отключение устройства.
// Параметры:
//  ОбъектДрайвера          - <*>
//           - Объект драйвера торгового оборудования.
//  Параметры               - <Структура>
//           - Параметры устройства.
//  ПараметрыПодключения    - <Структура>
//           - Параметры подключения устройства.
//  ВыходныеПараметры       - <Структура>
//           - ВыходныеПараметрыФункции.
//
// Возвращаемое значение:
//  <Булево> - Результат работы функции.
//
Функция ОтключитьУстройство(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт

	Результат = Истина;
	Возврат Результат;

КонецФункции

// Функция начинает отключение устройства.
// Параметры:
//  ОповещениеПоЗавершении - <*>
//           - Описание оповещения для выполнения.
//  ОбъектДрайвера         - <*>
//           - Объект драйвера торгового оборудования.
//  Параметры              - <Структура>
//           - Параметры устройства.
//  ПараметрыПодключения   - <Структура>
//           - Параметры подключения устройства.
//  ВыходныеПараметры      - <Структура>
//           - ВыходныеПараметрыФункции.
//
// Возвращаемое значение:
//  <Булево> - Результат работы функции.
//
Процедура НачатьОтключениеУстройства(ОповещениеПриЗавершении, ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт
	
	Результат = ОтключитьУстройство(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
	
	РезультатВыполнения = Новый Структура("Результат, ВыходныеПараметры", Результат, ВыходныеПараметры);
	ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатВыполнения);
	
КонецПроцедуры

// Функция получает, обрабатывает и перенаправляет на исполнение команду к драйверу
// Параметры:
//  Команда              - <Строка>
//           - НаименованиеКоманды.
//  ВходныеПараметры    - <Структура>
//           - ВыходныеПараметрыФункции.
//  ВыходныеПараметры    - <Структура>
//           - ВыходныеПараметрыФункции.
//  ОбъектДрайвера       - <*>
//           - Объект драйвера торгового оборудования.
//  Параметры            - <Структура>
//           - Параметры устройства.
//  ПараметрыПодключения   - <Структура>
//           - Параметры подключения устройства.
//
// Возвращаемое значение:
//  <Булево> - Результат работы функции.
//
Функция ВыполнитьКоманду(Команда, ВходныеПараметры = Неопределено, ВыходныеПараметры = Неопределено,
							 ОбъектДрайвера, Параметры, ПараметрыПодключения) Экспорт

	Результат = Истина;
	
	ВыходныеПараметры = Новый Массив();

	Если Команда = "ЗагрузитьМагазины" Тогда
		Результат = ЗагрузитьМагазины(Параметры, ВходныеПараметры, ВыходныеПараметры, Команда);
	ИначеЕсли Команда = "ЗагрузитьТерминалы" Тогда
		Результат = ЗагрузитьТерминалы(Параметры, ВходныеПараметры, ВыходныеПараметры, Команда);
	ИначеЕсли Команда = "ЗагрузитьСотрудников" Тогда
		Результат = ЗагрузитьСотрудников(Параметры, ВходныеПараметры, ВыходныеПараметры, Команда);
	ИначеЕсли Команда = "ЗагрузитьТовары" Тогда
		Результат = ЗагрузитьТовары(Параметры, ВходныеПараметры, ВыходныеПараметры, Команда);
	ИначеЕсли Команда = "ЗагрузитьОтчет" ИЛИ Команда = "ЗагрузитьРасширенныйОтчет" Тогда
		Результат = ЗагрузитьДокументы(Параметры, ВходныеПараметры, ВыходныеПараметры, Команда);
	ИначеЕсли Команда = "ВыгрузитьТовары" Тогда 
		Результат = ПередатьТовары(Параметры, ВходныеПараметры[0], ВыходныеПараметры, Команда);
	ИначеЕсли Команда = "ОчиститьБазу" Тогда
		Результат = УдалитьТовары(Параметры, ВходныеПараметры, ВыходныеПараметры, Команда);
	ИначеЕсли Команда = "ТестУстройства" Тогда
		Результат = ТестУстройства(Параметры, ВходныеПараметры, ВыходныеПараметры, Команда);
	ИначеЕсли Команда = "РасширеннаяВыгрузка" ИЛИ Команда = "РасширеннаяВыгрузка" Тогда
		Результат = ПроверитьВозможностьРасширеннойВыгрузки();
	ИначеЕсли Команда = "РасширеннаяЗагрузка" ИЛИ Команда = "РасширеннаяЗагрузка" Тогда
		Результат = ПроверитьВозможностьРасширеннойЗагрузки();
		
	Иначе
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Команда ""%Команда%"" не поддерживается данным драйвером.'"));
		ВыходныеПараметры[1] = СтрЗаменить(ВыходныеПараметры[1], "%Команда%", Команда);
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Процедура начинает выполнение команды, обрабатывает и перенаправляет на исполнение команду к драйверу.
//  ОповещениеПоЗавершении - <*>
//           - Описание оповещения для выполнения.
//  Команда                - <Строка>
//           - НаименованиеКоманды.
//  ВходныеПараметры      - <Структура>
//           - ВыходныеПараметрыФункции.
//  ОбъектДрайвера         - <*>
//           - Объект драйвера торгового оборудования.
//  Параметры              - <Структура>
//           - Параметры устройства.
//  ПараметрыПодключения   - <Структура>
//           - Параметры подключения устройства
//
Процедура НачатьВыполнениеКоманды(ОповещениеПриЗавершении, Команда, ВходныеПараметры = Неопределено, ОбъектДрайвера, Параметры, ПараметрыПодключения) Экспорт
	
	ВыходныеПараметры = Новый Массив();
	
	Если Команда = "ЗагрузитьМагазины" Тогда
		НачатьЗагрузкуМагазинов(ОповещениеПриЗавершении, Параметры, ВходныеПараметры, ВыходныеПараметры, Команда);
	ИначеЕсли Команда = "ЗагрузитьТерминалы" Тогда
		НачатьЗагрузкуТерминалов(ОповещениеПриЗавершении, Параметры, ВходныеПараметры, ВыходныеПараметры, Команда);
	ИначеЕсли Команда = "ЗагрузитьСотрудников" Тогда
		НачатьЗагрузкуСотрудников(ОповещениеПриЗавершении, Параметры, ВходныеПараметры, ВыходныеПараметры, Команда);
	ИначеЕсли Команда = "ЗагрузитьТовары" Тогда
		НачатьЗагрузкуТоваров(ОповещениеПриЗавершении, Параметры, ВходныеПараметры, ВыходныеПараметры, Команда);
	ИначеЕсли Команда = "ЗагрузитьОтчет" ИЛИ Команда = "ЗагрузитьРасширенныйОтчет" Тогда
		НачатьЗагрузкуДокументов(ОповещениеПриЗавершении, Параметры, ВходныеПараметры, ВыходныеПараметры, Команда);
	ИначеЕсли Команда = "ВыгрузитьТовары" Тогда
		НачатьПередачуТоваров(ОповещениеПриЗавершении, Параметры, ВходныеПараметры[0], ВыходныеПараметры, Команда);
	ИначеЕсли Команда = "ОчиститьБазу" Тогда
		НачатьУдалениеТоваров(ОповещениеПриЗавершении, Параметры, ВходныеПараметры, ВыходныеПараметры, Команда);
	ИначеЕсли Команда = "ТестУстройства" ИЛИ Команда = "CheckHealth" Тогда
		НачатьТестУстройства(ОповещениеПриЗавершении, Параметры, ВходныеПараметры, ВыходныеПараметры, Команда);
	ИначеЕсли Команда = "РасширеннаяВыгрузка" ИЛИ Команда = "РасширеннаяВыгрузка" Тогда
		Результат = ПроверитьВозможностьРасширеннойВыгрузки();
	ИначеЕсли Команда = "РасширеннаяЗагрузка" ИЛИ Команда = "РасширеннаяЗагрузка" Тогда
		Результат = ПроверитьВозможностьРасширеннойЗагрузки();
	Иначе
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Команда ""%Команда%"" не поддерживается данным драйвером.'"));
		ВыходныеПараметры[1] = СтрЗаменить(ВыходныеПараметры[1], "%Команда%", Команда);
		РезультатВыполнения = Новый Структура("Результат, ВыходныеПараметры", Ложь, ВыходныеПараметры);
		Если ОповещениеПриЗавершении <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатВыполнения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#Область КомандыДрайвера
#Область СинхронныеКоманды
// Функция осуществляет загрузку магазинов из облака Эвотор
//
Функция ЗагрузитьМагазины(Параметры, ВходныеПараметры, ВыходныеПараметры, Команда)
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса = ЗаполнитьПараметрыЗапроса(Команда, Параметры);
	
	Результат = ОтправитьЗапрос(ПараметрыЗапроса, ВыходныеПараметры);
	Если Результат Тогда
		РезультатЗапроса = ВыходныеПараметры[0];
		СтруктураОтвета = ПодключаемоеОборудование1СЭвоторВызовСервера.ЗаполнитьСтруктуруОтвета(РезультатЗапроса, ВыходныеПараметры);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция осуществляет загрузку терминалов из облака Эвотор
//
Функция ЗагрузитьТерминалы(Параметры, ВходныеПараметры, ВыходныеПараметры, Команда)
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса = ЗаполнитьПараметрыЗапроса(Команда, Параметры);
	
	Результат = ОтправитьЗапрос(ПараметрыЗапроса, ВыходныеПараметры);
	Если Результат Тогда
		РезультатЗапроса = ВыходныеПараметры[0];
		СтруктураОтвета = ПодключаемоеОборудование1СЭвоторВызовСервера.ЗаполнитьСтруктуруОтвета(РезультатЗапроса, ВыходныеПараметры);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция осуществляет загрузку сотрудников из облака Эвотор
//
Функция ЗагрузитьСотрудников(Параметры, ВходныеПараметры, ВыходныеПараметры, Команда)
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса = ЗаполнитьПараметрыЗапроса(Команда, Параметры);
	
	Результат = ОтправитьЗапрос(ПараметрыЗапроса, ВыходныеПараметры);
	Если Результат Тогда
		РезультатЗапроса = ВыходныеПараметры[0];
		СтруктураОтвета = ПодключаемоеОборудование1СЭвоторВызовСервера.ЗаполнитьСтруктуруОтвета(РезультатЗапроса, ВыходныеПараметры);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция осуществляет загрузку товаров из облака Эвотор
//
Функция ЗагрузитьТовары(Параметры, ВходныеПараметры, ВыходныеПараметры, Команда)
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса = ЗаполнитьПараметрыЗапроса(Команда, Параметры);
	
	Результат = ОтправитьЗапрос(ПараметрыЗапроса, ВыходныеПараметры);
	Если Результат Тогда
		РезультатЗапроса = ВыходныеПараметры[0];
		СтруктураОтвета = ПодключаемоеОборудование1СЭвоторВызовСервера.ЗаполнитьСтруктуруОтвета(РезультатЗапроса, ВыходныеПараметры);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция осуществляет загрузку документов из облака Эвотор
//
Функция ЗагрузитьДокументы(Параметры, ВходныеПараметры, ВыходныеПараметры, Команда)
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса = ЗаполнитьПараметрыЗапроса(Команда, Параметры);
	
	ТелоЗапроса = Неопределено;
	ДанныеОтвета = Неопределено;
	Результат = ОтправитьЗапрос(ПараметрыЗапроса, ВыходныеПараметры);
	Если Результат Тогда
		РезультатЗапроса  = ВыходныеПараметры[0];
		Если ЗначениеЗаполнено(РезультатЗапроса) Тогда
			РезультатОбработки = ПодключаемоеОборудование1СЭвоторВызовСервера.ЗаполнитьСтруктуруОтвета(РезультатЗапроса, ДанныеОтвета);
		Иначе
			РезультатОбработки = Ложь;
		КонецЕсли;
		
		Если РезультатОбработки Тогда
			ВыходныеПараметры = ПодключаемоеОборудование1СЭвоторВызовСервера.ОбработатьДанныеЗапроса(ДанныеОтвета, Команда);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция осуществляет выгрузку товаров в облако Эвотор
//
Функция ПередатьТовары(Параметры, ВходныеПараметры, ВыходныеПараметры, Команда)
	
	ТекстЗапроса = ПодключаемоеОборудование1СЭвоторВызовСервера.ПолучитьТекстJSONЗапроса(ВходныеПараметры, "ВыгрузитьТовары");
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса = ЗаполнитьПараметрыЗапроса(Команда, Параметры);
	Результат = ОтправитьЗапрос(ПараметрыЗапроса, ВыходныеПараметры);
	
	Возврат Результат;
	
КонецФункции

// Функция осуществляет удаление товаров в облаке Эвотор
//
Функция УдалитьТовары(Параметры, ВходныеПараметры, ВыходныеПараметры, Команда)
	
	ТекстЗапроса = ПодключаемоеОборудование1СЭвоторВызовСервера.ПолучитьТекстJSONЗапроса(ВходныеПараметры, "УдалитьТовары");
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса = ЗаполнитьПараметрыЗапроса(Команда, Параметры);
	Результат = ОтправитьЗапрос(ПараметрыЗапроса, ВыходныеПараметры);
	
	Возврат Результат;
	
КонецФункции

// Функция осуществляет тест устройства
Функция ТестУстройства(Параметры, ВходныеПараметры, ВыходныеПараметры, Команда)
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса = ЗаполнитьПараметрыЗапроса(Команда, Параметры);
	
	Результат = ОтправитьЗапрос(ПараметрыЗапроса, ВыходныеПараметры);
	
	Возврат Результат;
	
КонецФункции

Функция ОтправитьЗапрос(ПараметрыЗапроса, ВыходныеПараметры)
	
	Результат = Ложь;
	
	Попытка
		Соединение = Новый HTTPСоединение(ПараметрыЗапроса.СерверЗапроса, 443, , , Новый ИнтернетПрокси( Истина), 300, Новый ЗащищенноеСоединениеOpenSSL);
	Исключение
		ТекстСообщения = НСтр("ru = 'При создании соединения произошла ошибка'");
		СоздатьСообщениеОбОшибке(ВыходныеПараметры, ТекстСообщения);
		Возврат Ложь;
	КонецПопытки;
	
	Попытка
		HTTPЗапрос = Новый HTTPЗапрос(ПараметрыЗапроса.АдресЗапроса, ПараметрыЗапроса.ЗаголовкиЗапроса);
		Если ПараметрыЗапроса.МетодЗапроса = "GET" Тогда
			Ответ = Соединение.Получить(HTTPЗапрос);
			ВыходныеПараметры.Добавить(Ответ.ПолучитьТелоКакСтроку());
			Результат = Истина;
		ИначеЕсли ПараметрыЗапроса.МетодЗапроса = "POST" Тогда
			HTTPЗапрос.УстановитьТелоИзСтроки(ПараметрыЗапроса.ТекстЗапроса);
			Ответ = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
			Результат = Истина;
		ИначеЕсли ПараметрыЗапроса.МетодЗапроса = "DELETE" Тогда
			Ответ = Соединение.Удалить(HTTPЗапрос);
			Результат = Истина;
		КонецЕсли;
		
	Исключение
		ТекстСообщения =  НСтр("ru = 'Не удалось получить данные'");
		СоздатьСообщениеОбОшибке(ВыходныеПараметры, ТекстСообщения);
		Возврат Ложь;
		
	КонецПопытки;
	
	Если Ответ.КодСостояния = 401 Тогда
		ТекстСообщения = НСтр("ru = 'Ключ авторизации неверный.'");
		СоздатьСообщениеОбОшибке(ВыходныеПараметры, ТекстСообщения);
		Результат = Ложь;
	ИначеЕсли Ответ.КодСостояния = 402 Тогда
		ТекстСообщения = НСтр("ru = 'Точка продаж, аккаунт или поддержка интеграции заблокирована.'");
		СоздатьСообщениеОбОшибке(ВыходныеПараметры, ТекстСообщения);
		Результат = Ложь;
	ИначеЕсли Ответ.КодСостояния = 404 Тогда
		ТекстСообщения = НСтр("ru = 'Не найдена указанная точка продаж.'");
		СоздатьСообщениеОбОшибке(ВыходныеПараметры, ТекстСообщения);
		Результат = Ложь;
	ИначеЕсли Ответ.КодСостояния = 405 Тогда
		ТекстСообщения = НСтр("ru = 'Терминал не активен в рамках текущей подписки.'");
		СоздатьСообщениеОбОшибке(ВыходныеПараметры, ТекстСообщения);
		Результат = Ложь;
	ИначеЕсли Ответ.КодСостояния = 500 Тогда
		ТекстСообщения = НСтр("ru = 'Внутренняя ошибка сервиса.'");
		СоздатьСообщениеОбОшибке(ВыходныеПараметры, ТекстСообщения);
		Результат = Ложь;
	ИначеЕсли Ответ.КодСостояния = 503 Тогда
		ТекстСообщения = НСтр("ru = 'Сервис недоступен.'");
		СоздатьСообщениеОбОшибке(ВыходныеПараметры, ТекстСообщения);
		Результат = Ложь;
	ИначеЕсли Ответ.КодСостояния = 500 Тогда
		ТекстСообщения = НСтр("ru = 'Терминал не активен.'");
		СоздатьСообщениеОбОшибке(ВыходныеПараметры, ТекстСообщения);
		Результат = Ложь;
	ИначеЕсли НЕ Ответ.КодСостояния = 200 Тогда
		ТекстСообщения = НСтр("ru = 'Произошла ошибка при выгрузке данных. Код ответа: %КодСостояния%.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%КодСостояния%", Ответ.КодСостояния);
		СоздатьСообщениеОбОшибке(ВыходныеПараметры, ТекстСообщения);
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
#КонецОбласти

#Область АсинхронныеКоманды

// Функция осуществляет загрузку магазинов из облака Эвотор
//
Процедура НачатьЗагрузкуМагазинов(ОповещениеПриЗавершении, Параметры, ВходныеПараметры, ВыходныеПараметры, Команда)
	
	РезультатЗапроса = Новый Структура;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса = ЗаполнитьПараметрыЗапроса(Команда, Параметры);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
	ДополнительныеПараметры.Вставить("ВыходныеПараметры",       ВыходныеПараметры);
	ДополнительныеПараметры.Вставить("ПараметрыЗапроса",        ПараметрыЗапроса);
	ДополнительныеПараметры.Вставить("НаименованиеКоманды",     Команда);
	
	ОповещениеОтправкиЗапроса = Новый ОписаниеОповещения("НачатьПринятиеДанных", ЭтотОбъект, ДополнительныеПараметры);
	ВыполнитьОбработкуОповещения(ОповещениеОтправкиЗапроса, РезультатЗапроса);
	
КонецПроцедуры

// Функция осуществляет загрузку терминало из облака Эвотор
//
Процедура НачатьЗагрузкуТерминалов(ОповещениеПриЗавершении, Параметры, ВходныеПараметры, ВыходныеПараметры, Команда)
	
	РезультатЗапроса = Новый Структура;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса = ЗаполнитьПараметрыЗапроса(Команда, Параметры);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
	ДополнительныеПараметры.Вставить("ВыходныеПараметры",       ВыходныеПараметры);
	ДополнительныеПараметры.Вставить("ПараметрыЗапроса",        ПараметрыЗапроса);
	ДополнительныеПараметры.Вставить("НаименованиеКоманды",     Команда);
	
	ОповещениеОтправкиЗапроса = Новый ОписаниеОповещения("НачатьПринятиеДанных", ЭтотОбъект, ДополнительныеПараметры);
	ВыполнитьОбработкуОповещения(ОповещениеОтправкиЗапроса, РезультатЗапроса);
	
КонецПроцедуры

// Функция осуществляет загрузку сотрудников из облака Эвотор
//
Процедура НачатьЗагрузкуСотрудников(ОповещениеПриЗавершении, Параметры, ВходныеПараметры, ВыходныеПараметры, Команда)
	
	РезультатЗапроса = Новый Структура;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса = ЗаполнитьПараметрыЗапроса(Команда, Параметры);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
	ДополнительныеПараметры.Вставить("ВыходныеПараметры",       ВыходныеПараметры);
	ДополнительныеПараметры.Вставить("ПараметрыЗапроса",        ПараметрыЗапроса);
	ДополнительныеПараметры.Вставить("НаименованиеКоманды",     Команда);
	
	ОповещениеОтправкиЗапроса = Новый ОписаниеОповещения("НачатьПринятиеДанных", ЭтотОбъект, ДополнительныеПараметры);
	ВыполнитьОбработкуОповещения(ОповещениеОтправкиЗапроса, РезультатЗапроса);
	
КонецПроцедуры

// Функция осуществляет загрузку товаров из облака Эвотор
//
Процедура НачатьЗагрузкуТоваров(ОповещениеПриЗавершении, Параметры, ВходныеПараметры, ВыходныеПараметры, Команда)
	
	РезультатЗапроса = Новый Структура;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса = ЗаполнитьПараметрыЗапроса(Команда, Параметры);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
	ДополнительныеПараметры.Вставить("ВыходныеПараметры",       ВыходныеПараметры);
	ДополнительныеПараметры.Вставить("ПараметрыЗапроса",        ПараметрыЗапроса);
	ДополнительныеПараметры.Вставить("НаименованиеКоманды",     Команда);
	
	ОповещениеОтправкиЗапроса = Новый ОписаниеОповещения("НачатьПринятиеДанных", ЭтотОбъект, ДополнительныеПараметры);
	ВыполнитьОбработкуОповещения(ОповещениеОтправкиЗапроса, РезультатЗапроса);
	
КонецПроцедуры

// Функция осуществляет загрузку документов из облака Эвотор
//
Процедура НачатьЗагрузкуДокументов(ОповещениеПриЗавершении, Параметры, ВходныеПараметры, ВыходныеПараметры, Команда)
	
	РезультатЗапроса = Новый Структура;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса = ЗаполнитьПараметрыЗапроса(Команда, Параметры);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
	ДополнительныеПараметры.Вставить("ВыходныеПараметры",       ВыходныеПараметры);
	ДополнительныеПараметры.Вставить("ПараметрыЗапроса",        ПараметрыЗапроса);
	ДополнительныеПараметры.Вставить("НаименованиеКоманды",     Команда);
	
	ОповещениеОтправкиЗапроса = Новый ОписаниеОповещения("НачатьПринятиеДанных", ЭтотОбъект, ДополнительныеПараметры);
	ВыполнитьОбработкуОповещения(ОповещениеОтправкиЗапроса, РезультатЗапроса);
	
КонецПроцедуры

// Функция осуществляет выгрузку товаров в облако Эвотор
//
Процедура НачатьПередачуТоваров(ОповещениеПриЗавершении, Параметры, ВходныеПараметры, ВыходныеПараметры, Команда)
	
	РезультатЗапроса = Новый Структура;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса = ЗаполнитьПараметрыЗапроса(Команда, Параметры);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
	ДополнительныеПараметры.Вставить("ВыходныеПараметры",       ВыходныеПараметры);
	ДополнительныеПараметры.Вставить("ПараметрыЗапроса",        ПараметрыЗапроса);
	ДополнительныеПараметры.Вставить("ВходныеПараметры",        ВходныеПараметры);
	ДополнительныеПараметры.Вставить("НаименованиеКоманды",     Команда);
	
	ОповещениеОтправкиЗапроса = Новый ОписаниеОповещения("НачатьОтправкуДанных", ЭтотОбъект, ДополнительныеПараметры);
	ВыполнитьОбработкуОповещения(ОповещениеОтправкиЗапроса, РезультатЗапроса);
	
КонецПроцедуры

// Функция осуществляет удаление товаров в облаке Эвотор
//
Процедура НачатьУдалениеТоваров(ОповещениеПриЗавершении, Параметры, ВходныеПараметры, ВыходныеПараметры, Команда)
	
	РезультатЗапроса = Новый Структура;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса = ЗаполнитьПараметрыЗапроса(Команда, Параметры);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
	ДополнительныеПараметры.Вставить("ВыходныеПараметры",       ВыходныеПараметры);
	ДополнительныеПараметры.Вставить("ПараметрыЗапроса",        ПараметрыЗапроса);
	ДополнительныеПараметры.Вставить("ВходныеПараметры",        ВходныеПараметры);
	ДополнительныеПараметры.Вставить("НаименованиеКоманды",     Команда);
	
	ОповещениеОтправкиЗапроса = Новый ОписаниеОповещения("НачатьОтправкуДанных", ЭтотОбъект, ДополнительныеПараметры);
	ВыполнитьОбработкуОповещения(ОповещениеОтправкиЗапроса, РезультатЗапроса);
	
КонецПроцедуры

// Функция осуществляет загрузку магазинов из облака Эвотор
//
Процедура НачатьТестУстройства(ОповещениеПриЗавершении, Параметры, ВходныеПараметры, ВыходныеПараметры, Команда)
	
	РезультатЗапроса = Новый Структура;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса = ЗаполнитьПараметрыЗапроса(Команда, Параметры);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
	ДополнительныеПараметры.Вставить("ВыходныеПараметры",       ВыходныеПараметры);
	ДополнительныеПараметры.Вставить("ПараметрыЗапроса",        ПараметрыЗапроса);
	ДополнительныеПараметры.Вставить("НаименованиеКоманды",     Команда);
	
	ОповещениеОтправкиЗапроса = Новый ОписаниеОповещения("НачатьПринятиеДанных", ЭтотОбъект, ДополнительныеПараметры);
	ВыполнитьОбработкуОповещения(ОповещениеОтправкиЗапроса, РезультатЗапроса);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
Процедура НачатьОтправкуДанных(Результат, ДополнительныеПараметры) Экспорт
	
	ВыходныеПараметры = Новый Массив;
	ТекстЗапроса = ПодключаемоеОборудование1СЭвоторВызовСервера.ПолучитьТекстJSONЗапроса(ДополнительныеПараметры.ВходныеПараметры, ДополнительныеПараметры.НаименованиеКоманды);
	ДополнительныеПараметры.ПараметрыЗапроса.Вставить("ТекстЗапроса", ТекстЗапроса);
	
	Результат = ОтправитьЗапрос(ДополнительныеПараметры.ПараметрыЗапроса, ВыходныеПараметры);
	
	РезультатВыполнения = Новый Структура("Результат, ВыходныеПараметры", Результат, ВыходныеПараметры);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПриЗавершении, РезультатВыполнения);
	
КонецПроцедуры

Процедура НачатьПринятиеДанных(Результат, ДополнительныеПараметры) Экспорт
	
	ВыходныеПараметры = Новый Массив;
	СтруктураОтвета   = Новый Структура;
	ТелоЗапроса       = Новый Массив;
	
	Результат = ОтправитьЗапрос(ДополнительныеПараметры.ПараметрыЗапроса, ТелоЗапроса);
	Если Результат Тогда
		СтруктураОтвета = ПодключаемоеОборудование1СЭвоторВызовСервера.ЗаполнитьСтруктуруОтвета(ТелоЗапроса[0], ВыходныеПараметры);
	Иначе
		ДополнительныеПараметры.ВыходныеПараметры = ТелоЗапроса;
	КонецЕсли;
	
	ОповещениеОбработкиДанных = Новый ОписаниеОповещения("НачатьОбработкуДанных", ЭтотОбъект, ДополнительныеПараметры);
	ВыполнитьОбработкуОповещения(ОповещениеОбработкиДанных, ВыходныеПараметры);
	
КонецПроцедуры

Процедура НачатьОбработкуДанных(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Если Не ЗначениеЗаполнено(ДополнительныеПараметры.ВыходныеПараметры) Тогда
			ТекстСообщения = НСтр("ru = 'Нет данных для заполнения'");
			СоздатьСообщениеОбОшибке(Результат, ТекстСообщения);
		Иначе
			ТекстСообщения = НСтр("ru ='%Наименование%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Наименование%", ДополнительныеПараметры.ВыходныеПараметры[2]);
			СоздатьСообщениеОбОшибке(Результат, ТекстСообщения);
		КонецЕсли;
		РезультатВыполнения = Новый Структура("Результат, ВыходныеПараметры", Ложь, Результат);
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПриЗавершении, РезультатВыполнения);
			
	Иначе
		СтруктураДанных = Новый Структура;
		ПараметрыКоманды = Новый Структура;
		ПараметрыКоманды.Вставить("НаименованиеКоманды", ДополнительныеПараметры.НаименованиеКоманды);
		СтруктураДанных = ПодключаемоеОборудование1СЭвоторВызовСервера.ОбработатьДанныеЗапроса(Результат, ПараметрыКоманды);
		РезультатВыполнения = Новый Структура("Результат, ВыходныеПараметры", Истина, СтруктураДанных);
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПриЗавершении, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Процедура добавляет в массив выходных параметров сообщение об ошибке.
//		Параметры:
//			- ВыходныеПараметры - массив, в который будет помещено сообщение об ошибке.
//			- ТекстСообщения - текст сообщения, содержащий информация об ошибке.
Процедура СоздатьСообщениеОбОшибке(ВыходныеПараметры, ТекстСообщения)
	
	ВыходныеПараметры.Добавить(999);
	ВыходныеПараметры.Добавить(ТекстСообщения);
	
КонецПроцедуры

// Проверка возможности расширенной выгрузки товаров в ККМ ККМ Offline.
//
Функция ПроверитьВозможностьРасширеннойВыгрузки()
	
	Возврат Истина;
	
КонецФункции

// Проверка возможности расширенной выгрузки отчета о продажах.
//
Функция ПроверитьВозможностьРасширеннойЗагрузки()
	
	Возврат Истина;
	
КонецФункции

Функция ЗаполнитьПараметрыЗапроса(КомандаЗапроса, Параметры)
	
	ЗаголовкиЗапроса = Новый Соответствие();
	ЗаголовкиЗапроса.Вставить("Content-Type", "application/json");
	ЗаголовкиЗапроса.Вставить("X-Authorization", Параметры.Токен);
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("СерверЗапроса",    "api.evotor.ru");
	ПараметрыЗапроса.Вставить("ЗаголовкиЗапроса", ЗаголовкиЗапроса);
	
	Если КомандаЗапроса = "ЗагрузитьМагазины" Тогда
		АдресЗапроса = "api/v1/inventories/stores/search";
		МетодЗапроса = "GET";
	ИначеЕсли КомандаЗапроса = "ЗагрузитьТерминалы" Тогда
		АдресЗапроса = "api/v1/inventories/devices/search";
		МетодЗапроса = "GET";
	ИначеЕсли КомандаЗапроса = "ЗагрузитьСотрудников" Тогда
		АдресЗапроса = "api/v1/inventories/employees/search";
		МетодЗапроса = "GET";
	ИначеЕсли КомандаЗапроса = "ЗагрузитьТовары" Тогда
		АдресЗапроса = "api/v1/inventories/stores/"+ Параметры.МагазинЗначение + "/products";
		МетодЗапроса = "GET";
	ИначеЕсли КомандаЗапроса = "ЗагрузитьОтчет" ИЛИ КомандаЗапроса = "ЗагрузитьРасширенныйОтчет" Тогда
		АдресЗапроса = "api/v1/inventories/stores/" + Параметры.МагазинЗначение + "/documents";
		
		Если ЗначениеЗаполнено(Параметры.Терминал) Тогда
			АдресЗапроса = АдресЗапроса + "?deviceUuid=" + Параметры.ТерминалЗначение;
		Иначе
			АдресЗапроса = АдресЗапроса + "?deviceUuid=";
		КонецЕсли;
		
		НачалоВыгрузки = ПодключаемоеОборудование1СЭвоторВызовСервера.ПреобразоватьДату(Параметры.ПериодНачалоВыгрузки);
		Если ЗначениеЗаполнено(Параметры.ПериодНачалоВыгрузки) Тогда
			АдресЗапроса = АдресЗапроса + "&gtCloseDate=" + НачалоВыгрузки;
		Иначе
			АдресЗапроса = АдресЗапроса + "&gtCloseDate=";
		КонецЕсли;
		
		ОкончаниеВыгрузки = ПодключаемоеОборудование1СЭвоторВызовСервера.ПреобразоватьДату(Параметры.ПериодОкончаниеВыгрузки);
		Если ЗначениеЗаполнено(Параметры.ПериодОкончаниеВыгрузки) Тогда
			АдресЗапроса = АдресЗапроса + "&ltCloseDate=" + ОкончаниеВыгрузки;
		Иначе
			АдресЗапроса = АдресЗапроса + "&ltCloseDate=";
		КонецЕсли;
		
		АдресЗапроса = АдресЗапроса + "&types=SELL,PAYBACK,CASH_INCOME,CASH_OUTCOME,OPEN_SESSION,FPRINT,CLOSE_SESSION,OPEN_TARE";
		МетодЗапроса = "GET";
		
	ИначеЕсли КомандаЗапроса = "ВыгрузитьТовары" Тогда
		АдресЗапроса = "api/v1/inventories/stores/" + Параметры.МагазинЗначение + "/products";
		МетодЗапроса = "POST";
		ЗаголовкиЗапроса.Вставить("Content-Encoding", "gzip");
	ИначеЕсли КомандаЗапроса = "ОчиститьБазу" Тогда
		АдресЗапроса = "api/v1/inventories/stores/" + Параметры.МагазинЗначение + "/products/delete";
		МетодЗапроса = "POST";
		ЗаголовкиЗапроса.Вставить("Content-Encoding", "gzip");
	ИначеЕсли КомандаЗапроса = "ТестУстройства" ИЛИ КомандаЗапроса = "CheckHealth" Тогда
		АдресЗапроса = "api/v1/inventories/stores/search";
		МетодЗапроса = "GET";
	КонецЕсли;
	
	ПараметрыЗапроса.Вставить("АдресЗапроса",     АдресЗапроса);
	ПараметрыЗапроса.Вставить("МетодЗапроса",     МетодЗапроса);
	
	Возврат ПараметрыЗапроса;
	
КонецФункции

#КонецОбласти
#КонецОбласти