
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриСозданииЧтенииНаСервере();
	КонецЕсли;
	
	СобытияФормЕГАИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	СобытияФормЕГАИСКлиентПереопределяемый.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриСозданииЧтенииНаСервере();
	
	СобытияФормЕГАИСПереопределяемый.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	СобытияФормЕГАИСКлиентПереопределяемый.ПередЗаписью(ЭтотОбъект, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДекорацияПолучитьСправку1Нажатие(Элемент)
	
	ОчиститьСообщения();
	ПолучитьСправкуАПоНомеру();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормЕГАИСКлиентПереопределяемый.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииЧтенииНаСервере()

	УправлениеДоступностью();

КонецПроцедуры 

&НаСервере
Процедура УправлениеДоступностью()

	Если ЗначениеЗаполнено(Объект.Справка1) Тогда
		
		Элементы.СтраницыСправка1.ТекущаяСтраница = Элементы.СтраницаСправка1;
		
	Иначе
		
		Элементы.СтраницыСправка1.ТекущаяСтраница = Элементы.СтраницаНомерСправки1;
		
	КонецЕсли;
	

КонецПроцедуры 

&НаКлиенте
Процедура Справка1ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПолучитьСправкуПоНомеру" Тогда
		
		ПолучитьСправкуАПоНомеру();
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьСправку" Тогда
		
		Если ЗначениеЗаполнено(Объект.Справка1) Тогда
			
			ПоказатьЗначение(, Объект.Справка1);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСправкуАПоНомеру()
	
	Если НЕ ЗначениеЗаполнено(Объект.Справка1) Тогда
		Справка1 =  Справочники.Справки1ЕГАИС.ПустаяСсылка();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ Первые 1
	|	Справки1ЕГАИС.Ссылка
	|ИЗ
	|	Справочник.Справки1ЕГАИС КАК Справки1ЕГАИС
	|ГДЕ
	|	Справки1ЕГАИС.РегистрационныйНомер = &РегистрационныйНомер";
	
	Запрос.УстановитьПараметр("РегистрационныйНомер", Объект.НомерСправки1);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Справка1 =  Выборка.Ссылка;
		
	Иначе
		
		Справка1 =  Справочники.Справки1ЕГАИС.ПустаяСсылка();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Справка А не найдена по номеру'"), Объект.Ссылка, "Объект.НомерСправки1");
	
	КонецЕсли;
	
	Если Объект.Справка1 <> Справка1 Тогда
		Объект.Справка1 = Справка1;
		УправлениеДоступностью();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
