&НаКлиенте
Процедура Обработать(Команда)
	//ИндексСтроки = Объект.Товары.Индекс(Элементы.Товары.ТекущиеДанные);
	//ВыделеннаяСтрока = Объект.Товары.Получить(ИндексСтроки);
	
	Оповещение = Новый ОписаниеОповещения("ОтветНаВопрос", ЭтотОбъект);
	ТекстВопроса = НСтр("ru = 'Желаете внести изменения в оборудование?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	


КонецПроцедуры

&НаКлиенте 
Процедура ОтветНаВопрос(Результат, ДополнительныеПараметры)  Экспорт 
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	ИндексСтроки = Объект.Товары.Индекс(Элементы.Товары.ТекущиеДанные);
	ВыделеннаяСтрока = Объект.Товары.Получить(ИндексСтроки);	
	
	соот = Новый Соответствие;
	
	соот.Вставить("Номенклатура",ВыделеннаяСтрока.Номенклатура);
	соот.Вставить("КодОборудования",ВыделеннаяСтрока.КодОборудования);
	соот.Вставить("НомерБлока",ВыделеннаяСтрока.НомерБлока);
	соот.Вставить("ТехХарактеристика",ВыделеннаяСтрока.ТехХарактеристика);
	соот.Вставить("Наименование",ВыделеннаяСтрока.Наименование);

	
	СсылкаНоменклатуры = ЗаписатьВоборудования(соот);
	ВыделеннаяСтрока.Номенклатура = СсылкаНоменклатуры;
	

	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
	ЭтаФорма.Записать(ПараметрыЗаписи);		
	
КонецПроцедуры  

&НаСервере
Функция ЗаписатьВоборудования(ВыделеннаяСтрока)
	
	Номенклатура = ВыделеннаяСтрока.Получить("Номенклатура");
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Номенклатура = Номенклатура.ПолучитьОбъект();
	Иначе
	    Номенклатура = Справочники.Номенклатура.СоздатьЭлемент();
	КонецЕсли;
	
	Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Оборудование");
	Номенклатура.Артикул =  ВыделеннаяСтрока.Получить("КодОборудования");
	Номенклатура.пр_ТехническиеХарактеристики =  ВыделеннаяСтрока.Получить("ТехХарактеристика");
	Номенклатура.пр_НомерБлока =  ВыделеннаяСтрока.Получить("НомерБлока");
	Номенклатура.Наименование =  ВыделеннаяСтрока.Получить("Наименование");
	Номенклатура.НаименованиеПолное =  ВыделеннаяСтрока.Получить("Наименование");

	Номенклатура.Записать();
	Возврат Номенклатура.Ссылка;
КонецФункции
