////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции формирования отчетности по НДС.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область РасширенныйНалоговыйПериод

// Определяет нужно или нет представлять отчетность за квартал, внутри которого находится переданная дата.
// Параметры:
//  Организация - СправочникСсылка.Организации
//  Период      - Дата - на которую определяется необходимость представления отчетности по НДС.
//
// Возвращаемое значение:
//  Булево - Истина - отчетность по НДС необходимо представить,
//           Ложь   - отчетность по НДС не представляется.
Функция ОтчетностьПоНДСПредставляется(Организация, Период) Экспорт
	
	БлижайшийНалоговыйПериод = БлижайшийНалоговыйПериод(
		Организация,
		Период);
	
	Возврат БлижайшийНалоговыйПериод.Конец = КонецДня(КонецКвартала(Период));

КонецФункции

// Определяет соответствие выбранного в отчете периода налоговому.
// Параметры:
//  Организация   - СправочникСсылка.Организация - организация, для которой определяется налоговый период,
//  НачалоПериода - Дата - начало периода отчета,
//  КонецПериода  - Дата - конец периода отчета.
//
// Возвращаемое значение:
//  Булево - Истина - период соответствует налоговому, можно формировать отчет по стандартной форме (с шапкой и подписями)
//           Ложь   - период не соответствует налоговому, отчет формируется без шапки и подписей.
Функция ПериодОтчетаСоответствуетНалоговому(Организация, НачалоПериода, КонецПериода) Экспорт
	
	БлижайшийНалоговыйПериод = БлижайшийНалоговыйПериод(
		Организация,
		КонецПериода);
		
	Возврат БлижайшийНалоговыйПериод.Начало = НачалоПериода
	      И БлижайшийНалоговыйПериод.Конец = КонецДня(КонецПериода);
	
КонецФункции

// Определяет начало налогового периода по НДС.
// Параметры:
//  Организация - СправочникСсылка.Организации
//  Период      - Дата - внутри налогового периода, для которого необходимо определить начало.
//
// Возвращаемое значение:
//  Дата - начало налогового периода по НДС, если отчетность в данном периоде представляется
//         или начало квартала, если отчетность не представляется.
Функция НачалоНалоговогоПериода(Организация, Период) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("РегламентированнаяОтчетность") Тогда
		ИмяПеречисленияБРО = "ВариантыРасширенногоПервогоНалоговогоПериода";
		МодульИнтерфейсыВзаимодействияБРО = ОбщегоНазначения.ОбщийМодуль("ИнтерфейсыВзаимодействияБРО");
		НачалоНалоговогоПериода = МодульИнтерфейсыВзаимодействияБРО.НачалоНалоговогоПериода(
			Организация,
			Период,
			Перечисления[ИмяПеречисленияБРО].РегистрацияВПоследние10ДнейКвартала,
			Перечисления.Периодичность.Квартал);
	Иначе
		НачалоНалоговогоПериода = '0001-01-01';
	КонецЕсли;
		
	Если ЗначениеЗаполнено(НачалоНалоговогоПериода) Тогда
		Возврат НачалоНалоговогоПериода;
	Иначе
		Возврат НачалоКвартала(Период);
	КонецЕсли;
	
КонецФункции

// Возвращает ближайщий налоговый период.
// См. Перечисления.ВариантыРасширенногоПервогоНалоговогоПериода.БлижайшийНалоговыйПериод.
//
// Параметры:
//	Организация - СправочникСсылка.Организации - Организация.
//	Период - Дата - Дата периода.
//
// Возвращаемое значение:
//	Структура - Содержит ключи:
//    * Период - Дата - стандартное начало налогового периода (например, 01 июля для третьего квартала);
//    * Начало - Дата - фактическое начало налогового периода (может совпадать со стандартным началом или
//               датой регистрации организации;
//    * Конец  - Дата - дата с указанием времени.
// 
Функция БлижайшийНалоговыйПериод(Организация, Период) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("РегламентированнаяОтчетность") Тогда
		ИмяПеречисленияБРО = "ВариантыРасширенногоПервогоНалоговогоПериода";
		МодульИнтерфейсыВзаимодействияБРО = ОбщегоНазначения.ОбщийМодуль("ИнтерфейсыВзаимодействияБРО");
		Результат = МодульИнтерфейсыВзаимодействияБРО.БлижайшийНалоговыйПериод(
			Организация,
			Период,
			Перечисления[ИмяПеречисленияБРО].РегистрацияВПоследние10ДнейКвартала,
			Перечисления.Периодичность.Квартал);
	Иначе
		Результат = Новый Структура;
		Результат.Вставить("Период", НачалоКвартала(Период));
		Результат.Вставить("Начало", НачалоКвартала(Период));
		Результат.Вставить("Конец",  КонецКвартала(Период));
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОбщиеПроцедурыИФункцииОтчетов

Процедура ФормаОтчетаПриСозданииНаСервере(Форма) Экспорт
	
	Отчет = Форма.Отчет;
	
	Если НЕ ЗначениеЗаполнено(Отчет.Организация) Тогда
		Отчет.Организация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Отчет.КонецПериода) Тогда
		Отчет.КонецПериода = КонецКвартала(ОбщегоНазначения.ТекущаяДатаПользователя());
		Если НЕ ЗначениеЗаполнено(Отчет.НачалоПериода) Тогда
			// В случае расширенного налогового периода необходимо правильно указать дату начала.
			Отчет.НачалоПериода = НачалоНалоговогоПериода(
				Отчет.Организация, Отчет.КонецПериода);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Отчет.НачалоПериода) Тогда
		Отчет.НачалоПериода = НачалоКвартала(ОбщегоНазначения.ТекущаяДатаПользователя());
	КонецЕсли;
	
	УчетНДСКлиентСервер.ОтобразитьПоясненияКПериодуОтчета(Форма);

	БухгалтерскиеОтчетыПереопределяемый.ПриСозданииНаСервере(Форма);

КонецПроцедуры

Процедура ФормаОтчетаОбработатьВыборПериода(Форма) Экспорт
	
	Отчет = Форма.Отчет;
	
	Если НачалоКвартала(Отчет.КонецПериода) = Отчет.НачалоПериода
		И КонецКвартала(Отчет.КонецПериода) = КонецДня(Отчет.КонецПериода) Тогда
		// Выбран квартал. В случае расширенного налогового периода необходимо правильно указать дату начала.
		Отчет.НачалоПериода = НачалоНалоговогоПериода(
			Отчет.Организация, Отчет.КонецПериода);
	КонецЕсли;
	
	УчетНДСКлиентСервер.ОтобразитьПоясненияКПериодуОтчета(Форма);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСоСчетамифактурами

// Функция возвращает структуру вариантов представления счета-фактуры для вывода на печать в книге покупок.
//
// Параметры:
//	ДокументОснование - ДокументСсылка.* - Ссылка на документ, указываемый в качестве измерения
//						в регистрах НДС.
//	НомерСчетаФактуры - Строка - Номер счета-фактуры полученный предварительно.
//	ДатаСчетаФактуры  - Дата - Дата счета-фактуры, полученная предварительно.
//	ОбрабатыватьНомерДокумента - Булево - Признак того, что необходимо исключить префиксы из номера
//									документа перед печатью.
//	СчетФактураДокумент - ДокументСсылка.СчетФактураПолученный, СчетФактураВыданный - Ссылка на 
//							подчиненный документ "счет-фактура" (необязательный).
//	ЗаписьКнигиПродаж - Булево - Признак того, что отчет является книгой продаж.
//
// Возвращаемое значение:
//	Структура - см. НовыйВариантыПредставленияСчетаФактуры().
//
Функция ОпределитьДатуИНомерСчетаФактурыДляПечати(
	ДокументОснование, 
	НомерСчетаФактуры, 
	ДатаСчетаФактуры, 
	ОбрабатыватьНомерДокумента, 
	СчетФактураДокумент,
	ЗаписьКнигиПродаж) Экспорт

	ВариантыПредставленияСчетаФактуры = НовыйВариантыПредставленияСчетаФактуры();

	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат ВариантыПредставленияСчетаФактуры;
	КонецЕсли;

	ДатаСФ 	= "";
	НомерСФ = "";
	
	Если ЗначениеЗаполнено(ДатаСчетаФактуры) И ЗначениеЗаполнено(НомерСчетаФактуры) Тогда
		
		ДатаСФ	= Формат(ДатаСчетаФактуры, "ДФ=dd.MM.yyyy") ;
		
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаявлениеОВвозеТоваров")
			И ОбрабатыватьНомерДокумента Тогда
			
			НомерСФ = ?(ЗначениеЗаполнено(ДатаСФ), НСтр("ru = 'Заявление №'") + " ", "") 
				+ ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(НомерСчетаФактуры, Истина, Ложь);
			Представление = СтрШаблон(НСтр("ru='%1 № %2 от %3'"),
				НСтр("ru='Заявление о ввозе товаров'"),
				ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(НомерСчетаФактуры, Истина, Ложь),
				ДатаСФ);
		
		ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ТаможеннаяДекларацияИмпорт") Тогда
			
			ВариантыПредставленияСчетаФактуры.Дата          = ?(ЗаписьКнигиПродаж, ДатаСФ, "");
			ВариантыПредставленияСчетаФактуры.Номер         = НомерСчетаФактуры;
			ВариантыПредставленияСчетаФактуры.НомерДата     = НомерСчетаФактуры;
			ВариантыПредставленияСчетаФактуры.ДатаНомер     = НомерСчетаФактуры;
			ВариантыПредставленияСчетаФактуры.Представление = СтрШаблон(НСтр("ru='%1 № %2 от %3'"),
				НСтр("ru='Таможенная декларация'"),
				ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(НомерСчетаФактуры, Истина, Ложь),
				ДатаСФ);
			Возврат ВариантыПредставленияСчетаФактуры;
			
		Иначе
			Если ОбрабатыватьНомерДокумента Тогда			
				ДатаСФ	= Формат(ДатаСчетаФактуры, "ДФ=dd.MM.yyyy") ;
				НомерСФ = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(НомерСчетаФактуры, Истина, Истина);
			Иначе
				ДатаСФ 	= Формат(ДатаСчетаФактуры, "ДФ=dd.MM.yyyy");
				НомерСФ = СокрЛП(НомерСчетаФактуры);
			КонецЕсли;
		КонецЕсли;

		Если ЗначениеЗаполнено(СчетФактураДокумент) Тогда
			Если ТипЗнч(СчетФактураДокумент) = Тип("ДокументСсылка.СчетФактураВыданный")
				ИЛИ ТипЗнч(СчетФактураДокумент) = Тип("ДокументСсылка.СчетФактураВыданныйАванс")
				ИЛИ ТипЗнч(СчетФактураДокумент) = Тип("ДокументСсылка.СчетФактураНалоговыйАгент")
				ИЛИ ТипЗнч(СчетФактураДокумент) = Тип("ДокументСсылка.СчетФактураНаНеподтвержденнуюРеализацию0") Тогда
				Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 № %2 от %3'"),
					НСтр("ru='Счет-фактура выданный'"),
					НомерСФ,
					ДатаСФ);
			ИначеЕсли ТипЗнч(СчетФактураДокумент) = Тип("ДокументСсылка.СчетФактураПолученный")
				ИЛИ ТипЗнч(СчетФактураДокумент) = Тип("ДокументСсылка.СчетФактураПолученныйАванс") Тогда
				Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 № %2 от %3'"),
					НСтр("ru='Счет-фактура полученный'"),
					НомерСФ,
					ДатаСФ);
			Иначе
				ИмяДокумента = ДокументОснование.Метаданные().Синоним;
				Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 № %2 от %3'"),
					ИмяДокумента,
					НомерСФ,
					ДатаСФ);
			КонецЕсли;
		КонецЕсли;

	Иначе
	
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СчетФактураВыданный")
			ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СчетФактураВыданныйАванс")
			ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СчетФактураНалоговыйАгент")
			ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СчетФактураНаНеподтвержденнуюРеализацию0") Тогда
			
			РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "Дата, Номер");
			
			ДатаСФ  = Формат(РеквизитыДокумента.Дата, "ДФ=dd.MM.yyyy");
			НомерСФ = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(РеквизитыДокумента.Номер, Истина, Истина);
			Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 № %2 от %3'"),
				НСтр("ru='Счет-фактура выданный'"),
				НомерСФ,
				ДатаСФ);
		ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СчетФактураПолученный")
			ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СчетФактураПолученныйАванс") Тогда

			РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "Дата, Номер");
			
			ДатаСФ  = Формат(РеквизитыДокумента.Дата, "ДФ=dd.MM.yyyy");
			НомерСФ = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(РеквизитыДокумента.Номер, Истина, Истина);
			Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 № %2 от %3'"),
				НСтр("ru='Счет-фактура полученный'"),
				НомерСФ,
				ДатаСФ);
		ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ТаможеннаяДекларацияИмпорт") Тогда

			ДатаГТД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Дата");
			
			ВариантыПредставленияСчетаФактуры.Дата = ?(ЗаписьКнигиПродаж, ДатаГТД, "");
			ВариантыПредставленияСчетаФактуры.Номер = НомерСчетаФактуры;
			ВариантыПредставленияСчетаФактуры.НомерДата = НомерСчетаФактуры;
			ВариантыПредставленияСчетаФактуры.ДатаНомер = НомерСчетаФактуры;
			ВариантыПредставленияСчетаФактуры.Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='%1 № %2 от %3'"),
				НСтр("ru='Таможенная декларация'"),
				ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(НомерСчетаФактуры, Истина, Истина),
				Формат(СчетФактураДокумент.Дата, "ДФ=dd.MM.yyyy"));
			Возврат ВариантыПредставленияСчетаФактуры;
			
		ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаписьКнигиПокупок") 
			И НЕ ЗначениеЗаполнено(ДатаСФ) Тогда
			
			ВариантыПредставленияСчетаФактуры.Номер = НомерСчетаФактуры;
			ВариантыПредставленияСчетаФактуры.НомерДата = НомерСчетаФактуры;
			ВариантыПредставленияСчетаФактуры.ДатаНомер = НомерСчетаФактуры;
			ВариантыПредставленияСчетаФактуры.Представление = Представление;
			Возврат ВариантыПредставленияСчетаФактуры;
			
		КонецЕсли;
		
	КонецЕсли;

	ВариантыПредставленияСчетаФактуры.ДатаНомер = "" + ДатаСФ + ?(ЗначениеЗаполнено(ДатаСФ), ";", "") + НомерСФ;
	ВариантыПредставленияСчетаФактуры.НомерДата = "" + НомерСФ + ?(ЗначениеЗаполнено(НомерСФ), ";", "") + ДатаСФ;
		
	ВариантыПредставленияСчетаФактуры.Номер = НомерСФ;
	ВариантыПредставленияСчетаФактуры.Дата = ДатаСФ;
	ВариантыПредставленияСчетаФактуры.Представление = Представление;
	
	Возврат ВариантыПредставленияСчетаФактуры;

КонецФункции

// Возвращает структуру полей, составляющих представление счета-фактуры.
//
// Возвращаемое значение:
//	Структура - Содержит ключи:
//		* ДатаНомер - Строка - Представление даты и номера.
//		* НомерДата - Строка - Представление номера и даты.
//		* Дата - Строка - Представление даты.
//		* Номер - Строка - Представление номера.
//		* Представление - Строка - Полное представление счета-фактуры.
//
Функция НовыйВариантыПредставленияСчетаФактуры() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ДатаНомер"    , "");
	Результат.Вставить("НомерДата"    , "");
	Результат.Вставить("Дата"         , "");
	Результат.Вставить("Номер"        , "");
	Результат.Вставить("Представление", "");
	
	Возврат Результат;
	
КонецФункции

// Функция определяет наличие счетов-фактур, полученных по документам,
// которые могут являться основаниями для ввода счетов-фактур полученных.
//
// Применяется для контроля за наличием в ИБ информации о наличии счетов-фактур.
//
// Параметры:
//  ПараметрыПоискаСчетовФактур - Структура - параметры поиска счетов-фактур.
//                                См. конструктор параметров УчетНДС.НовыйПараметрыПоискаСчетовФактур().
//   * НачалоПериода - Дата - Начальная дата выборки (включительно, с 00:00:00)
//   * КонецПериода  - Дата - Конечная дата выборки (включительно, по 23:59:59)
//   * Организация   - СправочникСсылка.Организации - Организация, по которой
//                     осуществляется поиск. Если организация не задана, то поиск
//                     ведется по всем организациям.
//   * Фильтр        - Документ.Ссылка, Массив, Неопределено - Документ или список документов,
//                     по которым осуществляется поиск.
//                     Если не задан, поиск осуществляется по всем документам,
//                     которые могут являться основаниями для ввода счетов-фактур
//                     полученных.
//   * ВсеКромеФильтра  - Булево - Признак отбора документов, не входящих в Фильтр.
//
//   * НаличиеСчетаФактуры - Булево, Неопределено - Признак отбора документов:
//                           Истина - искать документы, по которым существуют счета-фактуры.
//                           Ложь - искать документы, по которым счета-фактуры отсутствуют.
//                           Неопределено - поиск осуществляется для всех документов.
//   * СчетФактураПроведен - Булево, Неопределено - Признак отбора счетов-фактур:
//                           Истина - искать проведенные счета-фактуры.
//                           Ложь - искать непроведенные счета-фактуры.
//                           Неопределено - осуществляется поиск всех счетов-фактур.
//   * ДатаСФНеБолее    - Дата, Неопределено - крайняя дата поиска счетов-фактур.
//   * ИскатьПоОборотам - Булево - Истина - поиск осуществляется по оборотам регистра накопления НДСПредъявленный,
//                                 Ложь - поиск осуществляется по остаткам.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица значений - Состав колонок:
//   * Документ - ДокументСсылка - Документ, по которому производился поиск счета-фактуры полученного.
//   * СчетФактура - ДокументСсылка, Неопределено - Ссылка на счет-фактуру полученный.
//
Функция ОпределитьНаличиеСчетовФактурПолученных(ПараметрыПоискаСчетовФактур) Экспорт

	НачПериода          = ПараметрыПоискаСчетовФактур.НачалоПериода;
	КонПериода          = ПараметрыПоискаСчетовФактур.КонецПериода;
	Организация         = ПараметрыПоискаСчетовФактур.Организация;
	Фильтр              = ПараметрыПоискаСчетовФактур.Фильтр;
	ВсеКромеФильтра     = ПараметрыПоискаСчетовФактур.ВсеКромеФильтра;
	НаличиеСчетаФактуры = ПараметрыПоискаСчетовФактур.НаличиеСчетаФактуры;
	СчетФактураПроведен = ПараметрыПоискаСчетовФактур.СчетФактураПроведен;
	ДатаСФНеБолее       = ПараметрыПоискаСчетовФактур.ДатаСФНеБолее;
	ЭтоОтчет            = ПараметрыПоискаСчетовФактур.ИскатьПоОборотам;

	Запрос = Новый Запрос();

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриобретениеТоваровУслуг.Ссылка КАК Основание
	|ПОМЕСТИТЬ ВтОснованияСФПолученные
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|ГДЕ
	|	ПриобретениеТоваровУслуг.Проведен
	|	И ПриобретениеТоваровУслуг.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
	|	И ПриобретениеТоваровУслуг.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика),
	|														ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаФактуровкаПоставки),
	|														ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаТоварыВПути),
	|														ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаЧерезПодотчетноеЛицо),
	|														ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет))
	|	И ПриобретениеТоваровУслуг.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|	И (ВЫБОР
	|			КОГДА &Организация <> Неопределено
	|				ТОГДА ПриобретениеТоваровУслуг.Организация = &Организация
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	|	И (ВЫБОР
	|			КОГДА &Фильтр И &ВсеКромеФильтра
	|				ТОГДА ПриобретениеТоваровУслуг.Ссылка НЕ В (&СписокФильтр)
	|			КОГДА &Фильтр И НЕ &ВсеКромеФильтра
	|				ТОГДА ПриобретениеТоваровУслуг.Ссылка В (&СписокФильтр)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриобретениеУслугПрочихАктивов.Ссылка
	|ИЗ
	|	Документ.ПриобретениеУслугПрочихАктивов КАК ПриобретениеУслугПрочихАктивов
	|ГДЕ
	|	ПриобретениеУслугПрочихАктивов.Проведен
	|	И ПриобретениеУслугПрочихАктивов.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
	|	И ПриобретениеУслугПрочихАктивов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика)
	|	И ПриобретениеУслугПрочихАктивов.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|	И (ВЫБОР
	|			КОГДА &Организация <> Неопределено
	|				ТОГДА ПриобретениеУслугПрочихАктивов.Организация = &Организация
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	|	И (ВЫБОР
	|			КОГДА &Фильтр И &ВсеКромеФильтра
	|				ТОГДА ПриобретениеУслугПрочихАктивов.Ссылка НЕ В (&СписокФильтр)
	|			КОГДА &Фильтр И НЕ &ВсеКромеФильтра
	|				ТОГДА ПриобретениеУслугПрочихАктивов.Ссылка В (&СписокФильтр)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратТоваровОтКлиента.Ссылка
	|ИЗ
	|	Документ.ВозвратТоваровОтКлиента КАК ВозвратТоваровОтКлиента
	|ГДЕ
	|	ВозвратТоваровОтКлиента.Проведен
	|	И ВозвратТоваровОтКлиента.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
	|	И ВозвратТоваровОтКлиента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента)
	|	И ВозвратТоваровОтКлиента.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|	И НЕ ВозвратТоваровОтКлиента.ПокупательНеПлательщикНДС
	|	И (ВЫБОР
	|			КОГДА &Организация <> Неопределено
	|				ТОГДА ВозвратТоваровОтКлиента.Организация = &Организация
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	|	И (ВЫБОР
	|			КОГДА &Фильтр И &ВсеКромеФильтра
	|				ТОГДА ВозвратТоваровОтКлиента.Ссылка НЕ В (&СписокФильтр)
	|			КОГДА &Фильтр И НЕ &ВсеКромеФильтра
	|				ТОГДА ВозвратТоваровОтКлиента.Ссылка В (&СписокФильтр)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтчетКомиссионера.Ссылка
	|ИЗ
	|	Документ.ОтчетКомиссионера КАК ОтчетКомиссионера
	|ГДЕ
	|	ОтчетКомиссионера.Проведен
	|	И ОтчетКомиссионера.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
	|	И ОтчетКомиссионера.СуммаВознаграждения <> 0
	|	И ОтчетКомиссионера.СтавкаНДСВознаграждения <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И (ВЫБОР
	|			КОГДА &Организация <> Неопределено
	|				ТОГДА ОтчетКомиссионера.Организация = &Организация
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	|	И (ВЫБОР
	|			КОГДА &Фильтр И &ВсеКромеФильтра
	|				ТОГДА ОтчетКомиссионера.Ссылка НЕ В (&СписокФильтр)
	|			КОГДА &Фильтр И НЕ &ВсеКромеФильтра
	|				ТОГДА ОтчетКомиссионера.Ссылка В (&СписокФильтр)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПередачаТоваровМеждуОрганизациями.Ссылка
	|ИЗ
	|	Документ.ПередачаТоваровМеждуОрганизациями КАК ПередачаТоваровМеждуОрганизациями
	|ГДЕ
	|	ПередачаТоваровМеждуОрганизациями.Проведен
	|	И ПередачаТоваровМеждуОрганизациями.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
	|	И ПередачаТоваровМеждуОрганизациями.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|	И ПередачаТоваровМеждуОрганизациями.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|	И ПередачаТоваровМеждуОрганизациями.РасчетыЧерезОтдельногоКонтрагента
	|	И (ВЫБОР
	|			КОГДА &Организация <> Неопределено
	|				ТОГДА ПередачаТоваровМеждуОрганизациями.ОрганизацияПолучатель = &Организация
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	|	И (ВЫБОР
	|			КОГДА &Фильтр И &ВсеКромеФильтра
	|				ТОГДА ПередачаТоваровМеждуОрганизациями.Ссылка НЕ В (&СписокФильтр)
	|			КОГДА &Фильтр И НЕ &ВсеКромеФильтра
	|				ТОГДА ПередачаТоваровМеждуОрганизациями.Ссылка В (&СписокФильтр)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратТоваровМеждуОрганизациями.Ссылка
	|ИЗ
	|	Документ.ВозвратТоваровМеждуОрганизациями КАК ВозвратТоваровМеждуОрганизациями
	|ГДЕ
	|	ВозвратТоваровМеждуОрганизациями.Проведен
	|	И ВозвратТоваровМеждуОрганизациями.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
	|	И ВозвратТоваровМеждуОрганизациями.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями)
	|	И ВозвратТоваровМеждуОрганизациями.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|	И ВозвратТоваровМеждуОрганизациями.РасчетыЧерезОтдельногоКонтрагента
	|	И (ВЫБОР
	|			КОГДА &Организация <> Неопределено
	|				ТОГДА ВозвратТоваровМеждуОрганизациями.ОрганизацияПолучатель = &Организация
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	|	И (ВЫБОР
	|			КОГДА &Фильтр И &ВсеКромеФильтра
	|				ТОГДА ВозвратТоваровМеждуОрганизациями.Ссылка НЕ В (&СписокФильтр)
	|			КОГДА &Фильтр И НЕ &ВсеКромеФильтра
	|				ТОГДА ВозвратТоваровМеждуОрганизациями.Ссылка В (&СписокФильтр)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтчетПоКомиссииМеждуОрганизациями.Ссылка
	|ИЗ
	|	Документ.ОтчетПоКомиссииМеждуОрганизациями КАК ОтчетПоКомиссииМеждуОрганизациями
	|ГДЕ
	|	ОтчетПоКомиссииМеждуОрганизациями.Проведен
	|	И ОтчетПоКомиссииМеждуОрганизациями.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
	|	И ОтчетПоКомиссииМеждуОрганизациями.СуммаВознаграждения <> 0
	|	И ОтчетПоКомиссииМеждуОрганизациями.СтавкаНДСВознаграждения <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И ОтчетПоКомиссииМеждуОрганизациями.РасчетыЧерезОтдельногоКонтрагента
	|	И (ВЫБОР
	|			КОГДА &Организация <> Неопределено
	|				ТОГДА ОтчетПоКомиссииМеждуОрганизациями.Организация = &Организация
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	|	И (ВЫБОР
	|			КОГДА &Фильтр И &ВсеКромеФильтра
	|				ТОГДА ОтчетПоКомиссииМеждуОрганизациями.Ссылка НЕ В (&СписокФильтр)
	|			КОГДА &Фильтр И НЕ &ВсеКромеФильтра
	|				ТОГДА ОтчетПоКомиссииМеждуОрганизациями.Ссылка В (&СписокФильтр)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВыкупВозвратнойТарыУПоставщика.Ссылка
	|ИЗ
	|	Документ.ВыкупВозвратнойТарыУПоставщика КАК ВыкупВозвратнойТарыУПоставщика
	|ГДЕ
	|	ВыкупВозвратнойТарыУПоставщика.Проведен
	|	И ВыкупВозвратнойТарыУПоставщика.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
	|	И ВыкупВозвратнойТарыУПоставщика.Организация = &Организация
	|	И ВыкупВозвратнойТарыУПоставщика.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|	И (ВЫБОР
	|			КОГДА &Организация <> Неопределено
	|				ТОГДА ВыкупВозвратнойТарыУПоставщика.Организация = &Организация
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	|	И (ВЫБОР
	|			КОГДА &Фильтр И &ВсеКромеФильтра
	|				ТОГДА ВыкупВозвратнойТарыУПоставщика.Ссылка НЕ В (&СписокФильтр)
	|			КОГДА &Фильтр И НЕ &ВсеКромеФильтра
	|				ТОГДА ВыкупВозвратнойТарыУПоставщика.Ссылка В (&СписокФильтр)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаПриобретения.Ссылка
	|ИЗ
	|	Документ.КорректировкаПриобретения КАК КорректировкаПриобретения
	|ГДЕ
	|	КорректировкаПриобретения.ВидКорректировки = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаПоСогласованиюСторон)
	|	И КорректировкаПриобретения.Проведен
	|	И КорректировкаПриобретения.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
	|	И КорректировкаПриобретения.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|	И (ВЫБОР
	|			КОГДА &Организация <> Неопределено
	|				ТОГДА КорректировкаПриобретения.Организация = &Организация
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	|	И (ВЫБОР
	|			КОГДА &Фильтр И &ВсеКромеФильтра
	|				ТОГДА КорректировкаПриобретения.Ссылка НЕ В (&СписокФильтр)
	|			КОГДА &Фильтр И НЕ &ВсеКромеФильтра
	|				ТОГДА КорректировкаПриобретения.Ссылка В (&СписокФильтр)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаРеализации.Ссылка
	|ИЗ
	|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.ВидыЗапасовОприходование КАК Оприходование
	|		ПО КорректировкаРеализации.Ссылка = Оприходование.Ссылка
	|ГДЕ
	|	КорректировкаРеализации.ВидКорректировки = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратНедопоставленногоТовара)
	|	И КорректировкаРеализации.Проведен
	|	И КорректировкаРеализации.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
	|	И КорректировкаРеализации.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|	И (ВЫБОР
	|			КОГДА &Организация <> Неопределено
	|				ТОГДА КорректировкаРеализации.Организация = &Организация
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	|	И (ВЫБОР
	|			КОГДА &Фильтр И &ВсеКромеФильтра
	|				ТОГДА КорректировкаРеализации.Ссылка НЕ В (&СписокФильтр)
	|			КОГДА &Фильтр И НЕ &ВсеКромеФильтра
	|				ТОГДА КорректировкаРеализации.Ссылка В (&СписокФильтр)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаРеализации.Ссылка
	|ИЗ
	|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.Расхождения КАК ТаблицаРасхождения
	|		ПО КорректировкаРеализации.Ссылка = ТаблицаРасхождения.Ссылка
	|ГДЕ
	|	КорректировкаРеализации.ВидКорректировки = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратНедопоставленногоТовара)
	|	И (ТаблицаРасхождения.Номенклатура.ТипНоменклатуры НЕ В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|		ИЛИ ТаблицаРасхождения.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|	И КорректировкаРеализации.Проведен
	|	И КорректировкаРеализации.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
	|	И КорректировкаРеализации.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|	И (ВЫБОР
	|			КОГДА &Организация <> Неопределено
	|				ТОГДА КорректировкаРеализации.Организация = &Организация
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	|	И (ВЫБОР
	|			КОГДА &Фильтр И &ВсеКромеФильтра
	|				ТОГДА КорректировкаРеализации.Ссылка НЕ В (&СписокФильтр)
	|			КОГДА &Фильтр И НЕ &ВсеКромеФильтра
	|				ТОГДА КорректировкаРеализации.Ссылка В (&СписокФильтр)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПередачаТоваровМеждуОрганизациями.Ссылка КАК Основание
	|ПОМЕСТИТЬ ВтОснованияСФВыданные
	|ИЗ
	|	Документ.ПередачаТоваровМеждуОрганизациями КАК ПередачаТоваровМеждуОрганизациями
	|ГДЕ
	|	ПередачаТоваровМеждуОрганизациями.Проведен
	|	И ПередачаТоваровМеждуОрганизациями.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
	|	И ПередачаТоваровМеждуОрганизациями.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию)
	|	И ПередачаТоваровМеждуОрганизациями.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|	И НЕ ПередачаТоваровМеждуОрганизациями.РасчетыЧерезОтдельногоКонтрагента
	|	И (ВЫБОР
	|			КОГДА &Организация <> Неопределено
	|				ТОГДА ПередачаТоваровМеждуОрганизациями.ОрганизацияПолучатель = &Организация
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	|	И (ВЫБОР
	|			КОГДА &Фильтр И &ВсеКромеФильтра
	|				ТОГДА ПередачаТоваровМеждуОрганизациями.Ссылка НЕ В (&СписокФильтр)
	|			КОГДА &Фильтр И НЕ &ВсеКромеФильтра
	|				ТОГДА ПередачаТоваровМеждуОрганизациями.Ссылка В (&СписокФильтр)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратТоваровМеждуОрганизациями.Ссылка
	|ИЗ
	|	Документ.ВозвратТоваровМеждуОрганизациями КАК ВозвратТоваровМеждуОрганизациями
	|ГДЕ
	|	ВозвратТоваровМеждуОрганизациями.Проведен
	|	И ВозвратТоваровМеждуОрганизациями.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
	|	И ВозвратТоваровМеждуОрганизациями.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями)
	|	И ВозвратТоваровМеждуОрганизациями.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|	И НЕ ВозвратТоваровМеждуОрганизациями.РасчетыЧерезОтдельногоКонтрагента
	|	И (ВЫБОР
	|			КОГДА &Организация <> Неопределено
	|				ТОГДА ВозвратТоваровМеждуОрганизациями.ОрганизацияПолучатель = &Организация
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	|	И (ВЫБОР
	|			КОГДА &Фильтр И &ВсеКромеФильтра
	|				ТОГДА ВозвратТоваровМеждуОрганизациями.Ссылка НЕ В (&СписокФильтр)
	|			КОГДА &Фильтр И НЕ &ВсеКромеФильтра
	|				ТОГДА ВозвратТоваровМеждуОрганизациями.Ссылка В (&СписокФильтр)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтчетПоКомиссииМеждуОрганизациями.Ссылка
	|ИЗ
	|	Документ.ОтчетПоКомиссииМеждуОрганизациями КАК ОтчетПоКомиссииМеждуОрганизациями
	|ГДЕ
	|	ОтчетПоКомиссииМеждуОрганизациями.Проведен
	|	И ОтчетПоКомиссииМеждуОрганизациями.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
	|	И ОтчетПоКомиссииМеждуОрганизациями.СуммаВознаграждения <> 0
	|	И ОтчетПоКомиссииМеждуОрганизациями.СтавкаНДСВознаграждения <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И НЕ ОтчетПоКомиссииМеждуОрганизациями.РасчетыЧерезОтдельногоКонтрагента
	|	И (ВЫБОР
	|			КОГДА &Организация <> Неопределено
	|				ТОГДА ОтчетПоКомиссииМеждуОрганизациями.Организация = &Организация
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	|	И (ВЫБОР
	|			КОГДА &Фильтр И &ВсеКромеФильтра
	|				ТОГДА ОтчетПоКомиссииМеждуОрганизациями.Ссылка НЕ В (&СписокФильтр)
	|			КОГДА &Фильтр И НЕ &ВсеКромеФильтра
	|				ТОГДА ОтчетПоКомиссииМеждуОрганизациями.Ссылка В (&СписокФильтр)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КорректировкаПриобретения.Ссылка КАК Основание
	|ПОМЕСТИТЬ ВтОснованияСФПолученныеИспраления
	|ИЗ
	|	Документ.КорректировкаПриобретения КАК КорректировкаПриобретения
	|ГДЕ
	|	КорректировкаПриобретения.ВидКорректировки = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ИсправлениеОшибок)
	|	И КорректировкаПриобретения.Проведен
	|	И КорректировкаПриобретения.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
	|	И КорректировкаПриобретения.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|	И (ВЫБОР
	|			КОГДА &Организация <> Неопределено
	|				ТОГДА КорректировкаПриобретения.Организация = &Организация
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	|	И (ВЫБОР
	|			КОГДА &Фильтр И &ВсеКромеФильтра
	|				ТОГДА КорректировкаПриобретения.Ссылка НЕ В (&СписокФильтр)
	|			КОГДА &Фильтр И НЕ &ВсеКромеФильтра
	|				ТОГДА КорректировкаПриобретения.Ссылка В (&СписокФильтр)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОснованияСФПолученные.Основание КАК ДокументОснование,
	|	ЕСТЬNULL(СчетФактураПолученный.Ссылка,НЕОПРЕДЕЛЕНО) КАК СчетФактура,
	|	ЕСТЬNULL(СчетФактураПолученный.Ссылка.Проведен,ЛОЖЬ) КАК СчетФактураПроведен,
	|	ЕСТЬNULL(СчетФактураПолученный.Ссылка.Дата,ДАТАВРЕМЯ(1, 1, 1)) КАК СчетФактураДата,
	|	ЕСТЬNULL(СчетФактураПолученный.Ссылка.Номер,"""") КАК СчетФактураНомер,
	|	ЛОЖЬ КАК ЭтоСчетФактураПолученный // признак используется в отчете о наличии с/ф для специального форматирования в БП представления документа, если ЛОЖЬ, то общий порядок
	|ИЗ
	|	ВтОснованияСФПолученные КАК ОснованияСФПолученные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученный
	|		ПО ОснованияСФПолученные.Основание = СчетФактураПолученный.ДокументОснование
	|			И НЕ СчетФактураПолученный.Ссылка.ПометкаУдаления
	|			И НЕ СчетФактураПолученный.Ссылка.Исправление
	|ГДЕ
	|	(ВЫБОР
	|		КОГДА &НаличиеСчетаФактуры = НЕОПРЕДЕЛЕНО
	|			ТОГДА ИСТИНА
	|		КОГДА &НаличиеСчетаФактуры
	|			ТОГДА НЕ СчетФактураПолученный.Ссылка ЕСТЬ NULL
	|		ИНАЧЕ
	|			СчетФактураПолученный.Ссылка ЕСТЬ NULL
	|	КОНЕЦ)
	|	И (ВЫБОР
	|			КОГДА &СчетФактураПроведен = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			КОГДА &СчетФактураПроведен
	|				ТОГДА ЕСТЬNULL(СчетФактураПолученный.Ссылка.Проведен,НЕОПРЕДЕЛЕНО) = ИСТИНА
	|			ИНАЧЕ
	|				ЕСТЬNULL(СчетФактураПолученный.Ссылка.Проведен,НЕОПРЕДЕЛЕНО) = ЛОЖЬ
	|		КОНЕЦ)
	|	И (ВЫБОР
	|			КОГДА &ДатаСФНеБолее = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			КОГДА НЕ СчетФактураПолученный.Ссылка ЕСТЬ NULL
	|				ТОГДА СчетФактураПолученный.Ссылка.ДатаСоставления <= &ДатаСФНеБолее
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОснованияСФВыданные.Основание,
	|	ЕСТЬNULL(СчетФактураВыданный.Ссылка,НЕОПРЕДЕЛЕНО),
	|	ЕСТЬNULL(СчетФактураВыданный.Ссылка.Проведен,ЛОЖЬ),
	|	ЕСТЬNULL(СчетФактураВыданный.Ссылка.Дата,ДАТАВРЕМЯ(1, 1, 1)) КАК СчетФактураДата,
	|	ЕСТЬNULL(СчетФактураВыданный.Ссылка.Номер,"""") КАК СчетФактураНомер,
	|	ЛОЖЬ КАК ЭтоСчетФактураПолученный // признак используется в отчете о наличии с/ф для специального форматирования в БП представления документа, если ЛОЖЬ, то общий порядок
	|ИЗ
	|	ВтОснованияСФВыданные КАК ОснованияСФВыданные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданный
	|		ПО ОснованияСФВыданные.Основание = СчетФактураВыданный.ДокументОснование
	|			И НЕ СчетФактураВыданный.Ссылка.ПометкаУдаления
	|			И НЕ СчетФактураВыданный.Ссылка.Исправление
	|ГДЕ
	|	(ВЫБОР
	|		КОГДА &НаличиеСчетаФактуры = НЕОПРЕДЕЛЕНО
	|			ТОГДА ИСТИНА
	|		КОГДА &НаличиеСчетаФактуры
	|			ТОГДА НЕ СчетФактураВыданный.Ссылка ЕСТЬ NULL
	|		ИНАЧЕ
	|			СчетФактураВыданный.Ссылка ЕСТЬ NULL
	|	КОНЕЦ)
	|	И (ВЫБОР
	|			КОГДА &СчетФактураПроведен = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			КОГДА &СчетФактураПроведен
	|				ТОГДА ЕСТЬNULL(СчетФактураВыданный.Ссылка.Проведен,НЕОПРЕДЕЛЕНО) = ИСТИНА
	|			ИНАЧЕ
	|				ЕСТЬNULL(СчетФактураВыданный.Ссылка.Проведен,НЕОПРЕДЕЛЕНО) = ЛОЖЬ
	|		КОНЕЦ)
	|	И (ВЫБОР
	|			КОГДА &ДатаСФНеБолее = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			КОГДА НЕ СчетФактураВыданный.Ссылка ЕСТЬ NULL
	|				ТОГДА СчетФактураВыданный.Ссылка.Дата <= &ДатаСФНеБолее
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОснованияСФПолученныеИсправления.Основание,
	|	ЕСТЬNULL(СчетФактураПолученный.Ссылка,НЕОПРЕДЕЛЕНО),
	|	ЕСТЬNULL(СчетФактураПолученный.Ссылка.Проведен,ЛОЖЬ),
	|	ЕСТЬNULL(СчетФактураПолученный.Ссылка.Дата,ДАТАВРЕМЯ(1, 1, 1)) КАК СчетФактураДата,
	|	ЕСТЬNULL(СчетФактураПолученный.Ссылка.Номер,"""") КАК СчетФактураНомер,
	|	ЛОЖЬ КАК ЭтоСчетФактураПолученный // признак используется в отчете о наличии с/ф для специального форматирования в БП представления документа, если ЛОЖЬ, то общий порядок
	|ИЗ
	|	ВтОснованияСФПолученныеИспраления КАК ОснованияСФПолученныеИсправления
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученный
	|		ПО ОснованияСФПолученныеИсправления.Основание = СчетФактураПолученный.ДокументОснование
	|			И НЕ СчетФактураПолученный.Ссылка.ПометкаУдаления
	|ГДЕ
	|	(ВЫБОР
	|		КОГДА &НаличиеСчетаФактуры = НЕОПРЕДЕЛЕНО
	|			ТОГДА ИСТИНА
	|		КОГДА &НаличиеСчетаФактуры
	|			ТОГДА НЕ СчетФактураПолученный.Ссылка ЕСТЬ NULL
	|		ИНАЧЕ
	|			СчетФактураПолученный.Ссылка ЕСТЬ NULL
	|	КОНЕЦ)
	|	И (ВЫБОР
	|			КОГДА &СчетФактураПроведен = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			КОГДА &СчетФактураПроведен
	|				ТОГДА ЕСТЬNULL(СчетФактураПолученный.Ссылка.Проведен,НЕОПРЕДЕЛЕНО) = ИСТИНА
	|			ИНАЧЕ
	|				ЕСТЬNULL(СчетФактураПолученный.Ссылка.Проведен,НЕОПРЕДЕЛЕНО) = ЛОЖЬ
	|		КОНЕЦ)
	|	И (ВЫБОР
	|			КОГДА &ДатаСФНеБолее = НЕОПРЕДЕЛЕНО
	|				ТОГДА ИСТИНА
	|			КОГДА НЕ СчетФактураПолученный.Ссылка ЕСТЬ NULL
	|				ТОГДА СчетФактураПолученный.Ссылка.ДатаСоставления <= &ДатаСФНеБолее
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ)
	|";
	
	Если (ЗначениеЗаполнено(НачПериода)) И (НЕ ЗначениеЗаполнено(КонПериода)) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Дата МЕЖДУ &ПериодНачало И &ПериодОкончание","Дата >= &ПериодНачало");
	ИначеЕсли (НЕ ЗначениеЗаполнено(НачПериода)) И (ЗначениеЗаполнено(КонПериода)) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Дата МЕЖДУ &ПериодНачало И &ПериодОкончание","Дата <= &ПериодОкончание");
	ИначеЕсли (НЕ ЗначениеЗаполнено(НачПериода)) И (НЕ ЗначениеЗаполнено(КонПериода)) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"Дата МЕЖДУ &ПериодНачало И &ПериодОкончание","Дата <> ДАТАВРЕМЯ(1,1,1)");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПериодНачало",			НачПериода);
	Запрос.УстановитьПараметр("ПериодОкончание",		?(ЗначениеЗаполнено(КонПериода),КонецДня(КонПериода),КонПериода));
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("Фильтр",					?(НЕ ЗначениеЗаполнено(Фильтр),Ложь,Истина));
	Запрос.УстановитьПараметр("СписокФильтр",			Фильтр);
	Запрос.УстановитьПараметр("ВсеКромеФильтра",		ВсеКромеФильтра);
	Запрос.УстановитьПараметр("НаличиеСчетаФактуры",	НаличиеСчетаФактуры);
	Запрос.УстановитьПараметр("СчетФактураПроведен",	СчетФактураПроведен);
	Запрос.УстановитьПараметр("ДатаСФНеБолее",			?(НЕ ЗначениеЗаполнено(ДатаСФНеБолее),Неопределено,КонецДня(ДатаСФНеБолее)));
	
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаДокументов;
	
КонецФункции // ОпределитьНаличиеСчетовФактурПолученных()

// Функция возвращает процент НДС.
//
// Параметры:
//	СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - Значение ставки НДС.
//	ПрименяютсяСтавки4и2 - Булево - Признак применения ставок 4% и 2%.
//
// Возвращаемое значение:
//	Число - Процент НДС.
//
Функция ПолучитьСтавкуНДС(СтавкаНДС, ПрименяютсяСтавки4и2 = Ложь) Экспорт

	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС10 ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110 Тогда
		Ставка = ?(ПрименяютсяСтавки4и2, 2, 10);
		Возврат Ставка;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18 ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118 Тогда
		Ставка = ?(ПрименяютсяСтавки4и2, 4, 18);
		Возврат Ставка;
	КонецЕсли;

	Возврат 0;

КонецФункции

// Функция возвращает номер счета-фактуры на печать с учетом индекса обособленного подразделения.
// 
// Параметры:
// 	 Номер - Строка - Номер документа ИБ.
//   УдалитьПользовательскийПрефикс - Булево - Признак необходимости исключения пользовательского префикса из номера.
// 	 ОбособленноеПодразделение - Булево -  Признак того, что организация является обособленным подразделением.
// 	 ЦифровойИндексОбособленногоПодразделения - Число - Цифровой индекс обособленного подразделения.
//
// Возвращаемое значение:
// 	НомерНаПечать - Строка - Номер счета-фактуры на печать.
//
Функция НомерСчетаФактурыНаПечать(Номер, УдалитьПользовательскийПрефикс, ОбособленноеПодразделение, ЦифровойИндексОбособленногоПодразделения) Экспорт
	
	НомерНаПечать = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Номер, Ложь, УдалитьПользовательскийПрефикс);
	
	Если ОбособленноеПодразделение И ЗначениеЗаполнено(ЦифровойИндексОбособленногоПодразделения) Тогда
		НомерНаПечать = НомерНаПечать + "/" + ЦифровойИндексОбособленногоПодразделения;
	КонецЕсли;
	
	Возврат НомерНаПечать;
	
КонецФункции

// Функция возвращает код вида операции для регистрации счета-фактуры по смещанным операциям в журнале счетов-фактур по комиссии.
// 
// Параметры:
// 	КодВидаОперации - Строка - Код вида операции счета-фактуры.
// 	Период - Дата - Период записи журнала.
// 
// Возвращаемое значение:
// 	КодВидаОперацииКомиссия - Строка - Код вида операции для журнала счетов-фактур по комиссии.
//
Функция КодВидаОперацииКомиссия(КодВидаОперации, Период) Экспорт
	
	КодВидаОперацииКомиссия = КодВидаОперации;
	
	ВерсияКодовВидовОпераций = УчетНДСКлиентСервер.ВерсияКодовВидовОпераций(Период);
	ВозможенСоставнойКод     = (ВерсияКодовВидовОпераций < 3);
			
	Если СтрДлина(КодВидаОперации) >= 4 
			И ВозможенСоставнойКод Тогда 
		Если СтрНайти(КодВидаОперации, "04") > 0 Тогда
			КодВидаОперацииКомиссия = "04";
		ИначеЕсли СтрНайти(КодВидаОперации, "05") > 0 Тогда	
			КодВидаОперацииКомиссия  = "05"
		ИначеЕсли СтрНайти(КодВидаОперации, "13") > 0 Тогда	
			КодВидаОперацииКомиссия  = "13"
		КонецЕсли;
	КонецЕсли;
	
	Возврат КодВидаОперацииКомиссия;
	
КонецФункции

// Функция возвращает типы документов, являющихся ручными операциями по НДС.
//
// Возвращаемое значение:
//	Массив - Массив со значениями типов документов.
//
Функция ТипыДокументовРучныхОперацийНДС() Экспорт

	Результат = Новый Массив;
	Результат.Добавить(Тип("ДокументСсылка.ЗаписьКнигиПокупок"));
	Результат.Добавить(Тип("ДокументСсылка.ЗаписьКнигиПродаж"));
	
	Возврат Результат;

КонецФункции

// КОРРЕКТИРОВОЧНЫЕ И ИСПРАВИТЕЛЬНЫЕ СЧЕТА-ФАКТУРЫ

// Функция возвращает массив пустых ссылок на документы, являющиеся типами для ИсправленногоСчетаФактуры.
//
// Возвращаемое значение:
//	Массив - Пустые ссылки типов измерения ИсправленныйСчетФактура.
//
Функция ПолучитьМассивПустыхИсправленныхСчетовФактур() Экспорт

	МассивДокументовИсправлений = Новый Массив;
	
	МассивТипов = Метаданные.РегистрыНакопления.НДСЗаписиКнигиПокупок.Измерения.ИсправленныйСчетФактура.Тип.Типы();
	Для Каждого ТипДокумента Из МассивТипов Цикл
		МетаданныеДокумента = Метаданные.НайтиПоТипу(ТипДокумента);
		Если МетаданныеДокумента <> Неопределено Тогда
			ИмяДокумента = МетаданныеДокумента.Имя;
			МассивДокументовИсправлений.Добавить(Документы[ИмяДокумента].ПустаяСсылка());
		КонецЕсли;
	КонецЦикла;
	
	МассивДокументовИсправлений.Добавить(Неопределено);

	Возврат МассивДокументовИсправлений;

КонецФункции // ПолучитьМассивПустыхИсправленныхСчетовФактур()

// Функция возвращает таблицу значений со ссылками на документы счета-фактуры, 
// которые записываются в субконто субсчетов 19 и в регистры НДС по таблице первичных 
// документов поступлений. Используется в отчете "ОтчетПоНаличиюСчетовФактур".
// 
// Параметры:
//	ТаблицаДокументов - ТаблицаЗначений - Содержит колонки:
//		* Документ - ДокументСсылка.* - Ссылка на первичный документ поступления.
//
// Возвращаемое значение:
//	ТаблицаЗначений - Таблица с колонкой "СчетФактура".
//
Функция ПреобразоватьДокументыВСчетаФактуры(ТаблицаДокументов) Экспорт

	// В БРУ нет специальных документов счетов-фактур, поэтому возвращаем исходную таблицу.
	ТаблицаРезультат = ТаблицаДокументов.Скопировать(, "Документ");
	ТаблицаРезультат.Колонки.Документ.Имя = "СчетФактура";
	
	Возврат ТаблицаРезультат;

КонецФункции // ПреобразоватьДокументыВСчетаФактуры()

//	ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возвращает версию постановления Правительства РФ от 26.12.2011 г. № 1137.
//
// Параметры:
// 	Период  - Дата - В данном параметре передается дата, 
//     на которую необходимо определить версию постановления.
//
// Возвращаемое значение:
//  Число   - 	версия постановления, 
//				1 - исходная версия постановления Правительства РФ от 26.12.2011 г. № 1137.
//              2 - постановление Правительства РФ от 26.12.2011 г. № 1137 в редакции постановления № 952.
//              3 - постановление Правительства РФ от 26.12.2011 г. № 1137 в редакции постановления № 735.
//
Функция ВерсияПостановленияНДС1137(Период) Экспорт
	
	Если Период >= '20141001' Тогда 		// Постановление № 735 вступает в силу с 1 октября 2014 года.
		Возврат 3;
	ИначеЕсли Период >= '20131106' Тогда 	// Постановление № 952 вступает в силу с 6 ноября 2013 года.
		Возврат 2;
	Иначе
		Возврат 1;                          // Исходная версия Постановления Правительства РФ от 26.12.2011 г. № 1137.
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ФункцииПолученияТекстовЗапросов

// Функция возвращает текст запроса, выбирающего корректировочные счета-фактуры. 
// Используется в отчете "Журнал учета счетов-фактур 1137".
//
// Параметры:
//	Запрос - Запрос - Объект Запрос, с помощью которого будет выполнен текст запроса.
//	Период - Дата - Последняя дата периода, за который строится запрос.
//	Отбор  - Структура - Структура отбора, содержащая следующие ключи:
//		* СписокОрганизаций - СписокЗначений - Список организаций, по которым строится запрос.
//		* Контрагент - Структура - Настройки отбора по контрагенту (необязательный ключ)
//			** ВидСравнения - ВидСравнения - Вид сравнения
//			** Значение - СправочникСсылка.Контрагенты - Ссылка на контрагента для отбора.
//
// Возвращаемое значение:
//	Строка - Текст запроса, формирующего таблицу со следующими полями:
//		* СчетФактура - ДокументСсылка.* - Ссылка на документ счета-фактуры.
//		* Организация - СправочникСсылка.Организации - Организация из счета-фактуры.
//
Функция ТекстЗапросаКорректировочныеСчетаФактуры(Запрос, Период, Отбор) Экспорт

	// В БРУ нет документов счетов-фактур.
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК СчетФактура,
	|	Операция.Организация КАК Организация
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Операция
	|ГДЕ
	|	Операция.Корректировочный
	|	И Операция.Дата >= &Квартал
	|	И Операция.Организация В (&СписокОрганизаций)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК СчетФактура,
	|	Операция.Организация КАК Организация
	|ИЗ
	|	Документ.СчетФактураПолученный КАК Операция
	|ГДЕ
	|	Операция.Корректировочный
	|	И (ВЫБОР
	|		КОГДА Операция.Исправление
	|			ТОГДА Операция.ДатаИсправления >= &Квартал
	|		ИНАЧЕ
	|			Операция.ДатаСоставления >= &Квартал
	|	КОНЕЦ)
	|	И Операция.Организация В (&СписокОрганизаций)
	|";

	Возврат ТекстЗапроса;

КонецФункции // ТекстЗапросаКорректировочныеСчетаФактуры()

// Функция возвращает текст запроса со списком документов счетов-фактур полученных,
// в которых сама организация выступает в роли поставщика в книге покупок.
//
// Параметры:
//	Запрос - Запрос - Объект Запрос, с помощью которого будет выполнен текст запроса.
//	СписокОрганизаций - СписокЗначений - Список организаций, по которым строится запрос.
//	Период - Дата - Последняя дата периода, за который строится запрос.
//
// Возвращаемое значение:
//	Строка - Текст запроса, формирующего таблицу со следующими полями:
//		* СчетФактура - ДокументСсылка.* - Ссылка на документ счета-фактуры.
//		* Организация - СправочникСсылка.Организации - Организация из счета-фактуры.
//		* ГоловнаяОрганизация - СправочникСсылка.Организации - Головная организация.
//		* ЭтоКорректировкаРеализации 	- Булево - Истина, если счет-фактура относится к корректировке реализации.
//
Функция ТекстЗапросаСчетаФактурыПолученныеГдеОрганизацияЯвляетсяПоставщиком(Запрос, СписокОрганизаций, Период) Экспорт

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК СчетФактура,
	|	Операция.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА Операция.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА Операция.Организация
	|		ИНАЧЕ
	|			Операция.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	ИСТИНА КАК ЭтоКорректировкаРеализации
	|ИЗ 
	|	Документ.КорректировкаРеализации КАК Операция
	|ГДЕ
	|	Операция.ВидКорректировки = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаПоСогласованиюСторон)
	|	И Операция.Проведен
	|";
	
	Возврат ТекстЗапроса;

КонецФункции // ТекстЗапросаСчетаФактурыПолученныеГдеОрганизацияЯвляетсяПоставщиком()

// Функция возвращает текст запроса со списком документов счетов-фактур выданных,
// в которых сама организация выступает в роли покупателя в книге продаж.
//
// Параметры:
//	Запрос - Запрос - Объект запрос, с помощью которого выполняется обращение к данным.
//	СписокОрганизаций - СписокЗначений - Организации, по которым строится отчет.
//	Период - ДатаВремя - Конец периода формирования отчет.
//
// Возвращаемое значение:
//	Строка - Текст запроса.
//
Функция ТекстЗапросаСчетаФактурыВыданныеГдеОрганизацияЯвляетсяПокупателем(Запрос, СписокОрганизаций, Период) Экспорт

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК СчетФактура,
	|	Операция.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА Операция.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА Операция.Организация
	|		ИНАЧЕ
	|			Операция.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	ИСТИНА КАК ЭтоКорректировкаПоступления
	|ИЗ 
	|	Документ.КорректировкаПриобретения КАК Операция
	|ГДЕ
	|	Операция.ВидКорректировки = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаПоСогласованиюСторон)
	|	И Операция.Проведен
	|";

	Возврат ТекстЗапроса;

КонецФункции // ТекстЗапросаСчетаФактурыВыданныеГдеОрганизацияЯвляетсяПокупателем()

// Функция возвращает текст запроса со списком документов счетов-фактур из 
// книги покупок, которые могут являться регистраторами исправительных записей.
//
// Параметры:
//	Запрос - Запрос - Объект Запрос, с помощью которого будет выполнен текст запроса.
//	СписокОрганизаций - СписокЗначений - Список организаций, по которым строится запрос.
//	Период - Дата - Последняя дата периода, за который строится запрос.
//
// Возвращаемое значение:
//	Строка - Текст запроса, формирующего таблицу со следующими полями:
//		* СчетФактура - ДокументСсылка.* - Ссылка на документ счета-фактуры.
//		* Организация - СправочникСсылка.Организации - Организация из счета-фактуры.
//		* ГоловнаяОрганизация - СправочникСсылка.Организации - Головная организация.
//		* ЭтоКорректировкаПоступления 	- Булево - Истина, если счет-фактура относится к корректировке поступления.
//		* ЭтоКорректировкаРеализации 	- Булево - Истина, если счет-фактура относится к корректировке реализации.
//
Функция ТекстЗапросаСчетаФактурыИсправленияКнигиПокупок(Запрос, СписокОрганизаций, Период) Экспорт

	// В БРУ таких документов нет.
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК СчетФактура,
	|	Операция.Организация КАК Организация,
	|	ВЫБОР КОГДА Операция.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) ТОГДА
	|		Операция.Организация
	|	ИНАЧЕ
	|		Операция.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	Операция.Корректировочный КАК ЭтоКорректировкаПоступления,
	|	ЛОЖЬ КАК ЭтоКорректировкаРеализации
	|ИЗ
	|	Документ.СчетФактураПолученный КАК Операция
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.Дата >= &НачалоПериода
	|	И Операция.Организация В (&Организация)
	|	И Операция.Исправление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Основания.ДокументОснование КАК СчетФактура,
	|	Операция.Организация КАК Организация,
	|	ВЫБОР КОГДА Операция.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) ТОГДА
	|		Операция.Организация
	|	ИНАЧЕ
	|		Операция.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	Операция.Корректировочный КАК ЭтоКорректировкаПоступления,
	|	ЛОЖЬ КАК ЭтоКорректировкаРеализации
	|ИЗ
	|	Документ.СчетФактураПолученный КАК Операция
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.СчетФактураПолученный.ДокументыОснования КАК Основания
	|	ПО
	|		Операция.Ссылка = Основания.Ссылка
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.Дата >= &НачалоПериода
	|	И Операция.Организация В (&Организация)
	|	И Операция.Исправление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК СчетФактура,
	|	Операция.Организация КАК Организация,
	|	ВЫБОР КОГДА Операция.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) ТОГДА
	|		Операция.Организация
	|	ИНАЧЕ
	|		Операция.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	ЛОЖЬ КАК ЭтоКорректировкаПоступления,
	|	ЛОЖЬ КАК ЭтоКорректировкаРеализации
	|ИЗ
	|	Документ.СчетФактураПолученныйАванс КАК Операция
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.Дата >= &НачалоПериода
	|	И Операция.Организация В (&Организация)
	|	И Операция.Исправление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Ссылка,
	|	Операция.Организация,
	|	ВЫБОР 
	|		КОГДА Операция.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА Операция.Организация
	|		ИНАЧЕ
	|			Операция.Организация.ГоловнаяОрганизация
	|	КОНЕЦ,
	|	ЛОЖЬ,
	|	Операция.Корректировочный
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Операция
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.Дата >= &НачалоПериода
	|	И Операция.Организация В (&Организация)
	|	И Операция.Исправление
	|	И Операция.Корректировочный
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Ссылка,
	|	Операция.Контрагент,
	|	ВЫБОР
	|		КОГДА ДанныеОрганизации.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА Операция.Контрагент
	|		ИНАЧЕ
	|			ДанныеОрганизации.ГоловнаяОрганизация
	|	КОНЕЦ,
	|	Операция.Корректировочный,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Операция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК ДанныеОрганизации
	|			ПО Операция.Контрагент = ДанныеОрганизации.Ссылка
	|			И ДанныеОрганизации.Ссылка В (&Организация)
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.ДатаВыставления >= &НачалоПериода
	|	И Операция.Исправление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Ссылка,
	|	Операция.Комиссионер,
	|	ВЫБОР
	|		КОГДА ДанныеОрганизации.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА Операция.Комиссионер
	|		ИНАЧЕ
	|			ДанныеОрганизации.ГоловнаяОрганизация
	|	КОНЕЦ,
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.СчетФактураКомиссионеру КАК Операция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК ДанныеОрганизации
	|			ПО Операция.Комиссионер = ДанныеОрганизации.Ссылка
	|			И ДанныеОрганизации.Ссылка В (&Организация)
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.ДатаВыставления >= &НачалоПериода
	|	И Операция.Исправление
	|";
	
	Возврат ТекстЗапроса;

КонецФункции // ТекстЗапросаСчетаФактурыИсправленияКнигиПокупок()

// Функция возвращает текст запроса со списком документов счетов-фактур из 
// книги продаж, которые могут являться регистраторами исправительных записей.
//
// Параметры:
//	Запрос - Запрос - Объект Запрос, с помощью которого будет выполнен текст запроса.
//	СписокОрганизаций - СписокЗначений - Список организаций, по которым строится запрос.
//	Период - Дата - Последняя дата периода, за который строится запрос.
//
// Возвращаемое значение:
//	Строка - Текст запроса, формирующего таблицу со следующими полями:
//		* СчетФактура - ДокументСсылка.* - Ссылка на документ счета-фактуры.
//		* Организация - СправочникСсылка.Организации - Организация из счета-фактуры.
//		* ГоловнаяОрганизация - СправочникСсылка.Организации - Головная организация.
//		* ЭтоКорректировкаПоступления 	- Булево - Истина, если счет-фактура относится к корректировке поступления.
//		* ЭтоКорректировкаРеализации 	- Булево - Истина, если счет-фактура относится к корректировке реализации.
//
Функция ТекстЗапросаСчетаФактурыИсправленияКнигиПродаж(Запрос, СписокОрганизаций, Период) Экспорт

	// В БРУ таких документов нет.
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК СчетФактура,
	|	Операция.Организация КАК Организация,
	|	ВЫБОР КОГДА Операция.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) ТОГДА
	|		Операция.Организация
	|	ИНАЧЕ
	|		Операция.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	ЛОЖЬ КАК ЭтоКорректировкаПоступления,
	|	Операция.Корректировочный КАК ЭтоКорректировкаРеализации
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Операция
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.Дата >= &НачалоПериода
	|	И Операция.Организация В (&Организация)
	|	И Операция.Исправление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК СчетФактура,
	|	Операция.Организация КАК Организация,
	|	ВЫБОР КОГДА Операция.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) ТОГДА
	|		Операция.Организация
	|	ИНАЧЕ
	|		Операция.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	Операция.Корректировочный,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.СчетФактураПолученный КАК Операция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК Строки
	|			ПО Операция.Ссылка = Строки.Ссылка
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.Корректировочный
	|	И Операция.Дата >= &НачалоПериода
	|	И Операция.Организация В (&Организация)
	|	И Операция.Исправление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Строки.ДокументОснование КАК СчетФактура,
	|	Операция.Организация КАК Организация,
	|	ВЫБОР КОГДА Операция.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) ТОГДА
	|		Операция.Организация
	|	ИНАЧЕ
	|		Операция.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	Операция.Корректировочный,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.СчетФактураПолученный КАК Операция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК Строки
	|			ПО Операция.Ссылка = Строки.Ссылка
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.Корректировочный
	|	И Операция.Дата >= &НачалоПериода
	|	И Операция.Организация В (&Организация)
	|	И Операция.Исправление

	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Ссылка,
	|	Операция.Организация,
	|	ВЫБОР КОГДА Операция.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) ТОГДА
	|		Операция.Организация
	|	ИНАЧЕ
	|		Операция.Организация.ГоловнаяОрганизация
	|	КОНЕЦ,
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.СчетФактураКомиссионеру КАК Операция
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.Дата >= &НачалоПериода
	|	И Операция.Организация В (&Организация)
	|	И Операция.Исправление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Ссылка,
	|	Операция.Организация,
	|	ВЫБОР КОГДА Операция.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) ТОГДА
	|		Операция.Организация
	|	ИНАЧЕ
	|		Операция.Организация.ГоловнаяОрганизация
	|	КОНЕЦ,
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.СчетФактураВыданныйАванс КАК Операция
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.Дата >= &НачалоПериода
	|	И Операция.Организация В (&Организация)
	|	И Операция.Исправление
	|";
	
	Возврат ТекстЗапроса;

КонецФункции // ТекстЗапросаСчетаФактурыИсправленияКнигиПродаж()

// Функция возвращает запрос для получения информации о ГТД и стране происхождения
// для счетов фактур.
//
// Параметры:
//	Запрос - Запрос - Объект запрос, с помощью которого будет выполняться обращение к базе данных.
//
// Возвращаемое значение:
//	Строка - Текст запроса для получения таблица со следующими полями:
//		* СчетФактура - ДокументСсылка.* - Ссылка на документ, представляющий счет-фактуру.
//		* СтранаПроисхождения - СправочникСсылка.СтраныМира - Страна происхождения товара.
//		* НомерГТД - СправочникСсылка.НомераГТД - Таможенная декларация, указанная в счете-фактуре.
//
Функция ТекстЗапросаНомераГТДпоСчетамФактурам(Запрос) Экспорт

	// В БРУ таких документов нет.

	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Строки.Ссылка КАК СчетФактура,
	|	Строки.НомерГТД.СтранаПроисхождения КАК СтранаПроисхождения,
	|	Строки.НомерГТД КАК НомерГТД
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК Строки
	|ГДЕ
	|	Строки.НомерГТД <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Счетфактура.Ссылка,
	|	Строки.НомерГТД.СтранаПроисхождения,
	|	Строки.НомерГТД
	|ИЗ
	|	Документ.СчетфактураПолученный.ДокументыОснования КАК СФОснования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг.Товары КАК Строки
	|			ПО СФОснования.ДокументОснование = Строки.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетфактураПолученный КАК Счетфактура
	|			ПО СФОснования.Ссылка = Счетфактура.Ссылка
	|ГДЕ
	|	Строки.НомерГТД <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|	И Счетфактура.Проведен
	|	И Счетфактура.Исправление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Строки.Ссылка,
	|	Строки.НомерГТД.СтранаПроисхождения,
	|	Строки.НомерГТД
	|ИЗ
	|	Документ.ВозвратТоваровОтКлиента.ВидыЗапасов КАК Строки
	|ГДЕ
	|	Строки.НомерГТД <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Счетфактура.Ссылка,
	|	Строки.НомерГТД.СтранаПроисхождения,
	|	Строки.НомерГТД
	|ИЗ
	|	Документ.СчетфактураПолученный.ДокументыОснования КАК СФОснования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтКлиента.ВидыЗапасов КАК Строки
	|			ПО СФОснования.ДокументОснование = Строки.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетфактураПолученный КАК Счетфактура
	|			ПО СФОснования.Ссылка = Счетфактура.Ссылка
	|ГДЕ
	|	Строки.НомерГТД <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|	И Счетфактура.Проведен
	|	И Счетфактура.Исправление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Строки.Ссылка,
	|	Строки.НомерГТД.СтранаПроисхождения,
	|	Строки.НомерГТД
	|ИЗ
	|	Документ.ПередачаТоваровМеждуОрганизациями.Товары КАК Строки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями КАК Операция
	|			ПО Строки.Ссылка = Операция.Ссылка
	|ГДЕ
	|	Операция.УказыватьНомераГТД
	|	И Строки.НомерГТД <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетФактура.Ссылка,
	|	Строки.НомерГТД.СтранаПроисхождения,
	|	Строки.НомерГТД
	|ИЗ
	|	Документ.СчетфактураПолученный.ДокументыОснования КАК СФОснования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетфактураПолученный КАК СчетФактура
	|			ПО СФОснования.Ссылка = СчетФактура.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями КАК ДокОснования
	|			ПО СФОснования.ДокументОснование = ДокОснования.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями.Товары КАК Строки
	|			ПО СФОснования.ДокументОснование = Строки.Ссылка
	|ГДЕ
	|	Счетфактура.Проведен
	|	И Счетфактура.Исправление
	|	И ДокОснования.УказыватьНомераГТД
	|	И ДокОснования.РасчетыЧерезОтдельногоКонтрагента
	|	И Строки.НомерГТД <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетФактура.Ссылка,
	|	Строки.НомерГТД.СтранаПроисхождения,
	|	Строки.НомерГТД
	|ИЗ
	|	Документ.СчетфактураВыданный.ДокументыОснования КАК СФОснования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетфактураВыданный КАК СчетФактура
	|			ПО СФОснования.Ссылка = СчетФактура.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями КАК ДокОснование
	|			ПО СФОснования.ДокументОснование = ДокОснование.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями.Товары КАК Строки
	|			ПО СФОснования.ДокументОснование = Строки.Ссылка
	|ГДЕ
	|	СчетФактура.Проведен
	|	И СчетФактура.Исправление
	|	И ДокОснование.УказыватьНомераГТД
	|	И НЕ ДокОснование.РасчетыЧерезОтдельногоКонтрагента
	|	И Строки.НомерГТД <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Строки.Ссылка,
	|	Строки.НомерГТД.СтранаПроисхождения,
	|	Строки.НомерГТД
	|ИЗ
	|	Документ.ПередачаТоваровМеждуОрганизациями.ВидыЗапасов КАК Строки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями КАК ДокОснование
	|			ПО Строки.Ссылка = ДокОснование.Ссылка
	|ГДЕ
	|	НЕ ДокОснование.УказыватьНомераГТД
	|	И Строки.НомерГТД <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетФактура.Ссылка,
	|	Строки.НомерГТД.СтранаПроисхождения,
	|	Строки.НомерГТД
	|ИЗ
	|	Документ.СчетфактураПолученный.ДокументыОснования КАК СФОснования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетфактураПолученный КАК СчетФактура
	|			ПО СФОснования.Ссылка = СчетФактура.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями КАК ДокОснования
	|			ПО СФОснования.ДокументОснование = ДокОснования.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями.ВидыЗапасов КАК Строки
	|			ПО СФОснования.ДокументОснование = Строки.Ссылка
	|ГДЕ
	|	Счетфактура.Проведен
	|	И Счетфактура.Исправление
	|	И НЕ ДокОснования.УказыватьНомераГТД
	|	И ДокОснования.РасчетыЧерезОтдельногоКонтрагента
	|	И Строки.НомерГТД <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетФактура.Ссылка,
	|	Строки.НомерГТД.СтранаПроисхождения,
	|	Строки.НомерГТД
	|ИЗ
	|	Документ.СчетфактураВыданный.ДокументыОснования КАК СФОснования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетфактураВыданный КАК СчетФактура
	|			ПО СФОснования.Ссылка = СчетФактура.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями КАК ДокОснование
	|			ПО СФОснования.ДокументОснование = ДокОснование.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями.ВидыЗапасов КАК Строки
	|			ПО СФОснования.ДокументОснование = Строки.Ссылка
	|ГДЕ
	|	СчетФактура.Проведен
	|	И СчетФактура.Исправление
	|	И НЕ ДокОснование.УказыватьНомераГТД
	|	И НЕ ДокОснование.РасчетыЧерезОтдельногоКонтрагента
	|	И Строки.НомерГТД <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Строки.Ссылка,
	|	Строки.НомерГТД.СтранаПроисхождения,
	|	Строки.НомерГТД
	|ИЗ
	|	Документ.ВозвратТоваровМеждуОрганизациями.ВидыЗапасов КАК Строки
	|ГДЕ
	|	Строки.НомерГТД <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетФактура.Ссылка,
	|	Строки.НомерГТД.СтранаПроисхождения,
	|	Строки.НомерГТД
	|ИЗ
	|	Документ.СчетфактураПолученный.ДокументыОснования КАК СФОснования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетфактураПолученный КАК СчетФактура
	|			ПО СФОснования.Ссылка = СчетФактура.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровМеждуОрганизациями КАК ДокОснования
	|			ПО СФОснования.ДокументОснование = ДокОснования.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровМеждуОрганизациями.ВидыЗапасов КАК Строки
	|			ПО СФОснования.ДокументОснование = Строки.Ссылка
	|ГДЕ
	|	Счетфактура.Проведен
	|	И Счетфактура.Исправление
	|	И ДокОснования.РасчетыЧерезОтдельногоКонтрагента
	|	И Строки.НомерГТД <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетФактура.Ссылка,
	|	Строки.НомерГТД.СтранаПроисхождения,
	|	Строки.НомерГТД
	|ИЗ
	|	Документ.СчетфактураВыданный.ДокументыОснования КАК СФОснования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетфактураВыданный КАК СчетФактура
	|			ПО СФОснования.Ссылка = СчетФактура.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровМеждуОрганизациями КАК ДокОснование
	|			ПО СФОснования.ДокументОснование = ДокОснование.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровМеждуОрганизациями.ВидыЗапасов КАК Строки
	|			ПО СФОснования.ДокументОснование = Строки.Ссылка
	|ГДЕ
	|	СчетФактура.Проведен
	|	И СчетФактура.Исправление
	|	И НЕ ДокОснование.РасчетыЧерезОтдельногоКонтрагента
	|	И Строки.НомерГТД <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Строки.Ссылка,
	|	Строки.НомерГТД.СтранаПроисхождения,
	|	Строки.НомерГТД
	|ИЗ
	|	Документ.ЗаписьКнигиПокупок.Ценности КАК Строки
	|ГДЕ
	|	Строки.НомерГТД <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Строки.Ссылка,
	|	Строки.НомерГТД.СтранаПроисхождения,
	|	Строки.НомерГТД
	|ИЗ
	|	Документ.КорректировкаПриобретения.Товары КАК Строки
	|ГДЕ
	|	Строки.НомерГТД <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Счетфактура.Ссылка,
	|	Строки.НомерГТД.СтранаПроисхождения,
	|	Строки.НомерГТД
	|ИЗ
	|	Документ.СчетфактураПолученный.ДокументыОснования КАК Основания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаПриобретения.Товары КАК Строки
	|			ПО Основания.ДокументОснование = Строки.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетфактураПолученный КАК Счетфактура
	|			ПО Основания.Ссылка = Счетфактура.Ссылка
	|ГДЕ
	|	Строки.НомерГТД <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|	И Счетфактура.Проведен
	|	И Счетфактура.Исправление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Строки.Ссылка,
	|	Строки.НомерГТД.СтранаПроисхождения,
	|	Строки.НомерГТД
	|ИЗ
	|	Документ.КорректировкаРеализации.ВидыЗапасовКорректировкаВыручки КАК Строки
	|ГДЕ
	|	Строки.НомерГТД <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетФактура.Ссылка,
	|	Строки.НомерГТД.СтранаПроисхождения,
	|	Строки.НомерГТД
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СФОснования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактура
	|			ПО СФОснования.Ссылка = СчетФактура.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.ВидыЗапасовКорректировкаВыручки КАК Строки
	|			ПО СФОснования.ДокументОснование = Строки.Ссылка
	|ГДЕ
	|	Строки.НомерГТД <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|	И Счетфактура.Проведен
	|	И Счетфактура.Исправление
	|	И Счетфактура.Корректировочный
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Строки.Ссылка,
	|	Строки.НомерГТД.СтранаПроисхождения,
	|	Строки.НомерГТД
	|ИЗ
	|	Документ.КорректировкаРеализации.ВидыЗапасовОприходование КАК Строки
	|ГДЕ
	|	Строки.НомерГТД <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетФактура.Ссылка,
	|	Строки.НомерГТД.СтранаПроисхождения,
	|	Строки.НомерГТД
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СФОснования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактура
	|			ПО СФОснования.Ссылка = СчетФактура.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.ВидыЗапасовОприходование КАК Строки
	|			ПО СФОснования.ДокументОснование = Строки.Ссылка
	|ГДЕ
	|	Строки.НомерГТД <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|	И Счетфактура.Проведен
	|	И Счетфактура.Исправление
	|	И Счетфактура.Корректировочный
	|";

	Возврат ТекстЗапроса;

КонецФункции

// Функция возвращает текст запроса, выбирающего сводные комиссионные счета-фактуры. 
// Используется в отчете "Журнал учета счетов-фактур 1137".
//
// Параметры:
//	Запрос - Запрос - Объект запрос, с помощью которого будет выполняться обращение к базе данных.
//	Период - ДатаВремя - Конец периода формирования отчета.
//	Отбор - Структура - Структура отбора с ключами:
//		* СписокОрганизаций - СписокЗначений - список организаций, по которым строится отчет.
//		* Контрагент (необязательный) - Структура с ключами:
//			** ВидСравнения - ВидСравнения.
//			** Значение - СправочникСсылка.Контрагенты - Ссылка на контрагента.
//
// Возвращаемое значение:
//	Строка - Текст запроса для получения таблица со следующими полями:
//		* СчетФактура - ДокументСсылка.* - Ссылка на документ, представляющий счет-фактуру.
//		* Организация - СправочникСсылка.Организации - Организация, к которой относится счет-фактура.
//		* ЧастьЖурналаУчетаСчетовФактур - ПеречислениеСсылка.ЧастиЖурналаУчетаСчетовФактур.
//
//
Функция ТекстЗапросаСводныеКомиссионныеСчетаФактуры(Запрос, Период, Отбор) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СчетФактураКомиссионеру.Ссылка КАК СчетФактура,
	|	СчетФактураКомиссионеру.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ЧастиЖурналаУчетаСчетовФактур.ВыставленныеСчетаФактуры) КАК ЧастьЖурналаУчетаСчетовФактур
	|ИЗ
	|	Документ.СчетФактураКомиссионеру КАК СчетФактураКомиссионеру
	|ГДЕ
	|	СчетФактураКомиссионеру.Сводный
	|	И СчетФактураКомиссионеру.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетФактураКомитента.Ссылка,
	|	СчетФактураКомитента.Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ЧастиЖурналаУчетаСчетовФактур.ПолученныеСчетаФактуры)
	|ИЗ
	|	Документ.СчетФактураКомитента КАК СчетФактураКомитента
	|ГДЕ
	|	СчетФактураКомитента.Сводный
	|	И СчетФактураКомитента.Проведен
	|";
	
	Возврат ТекстЗапроса;

КонецФункции

// Функция возвращает запрос для получения информации о документах оплаты.
//
// Параметры:
//	Запрос - Запрос - Объект запрос, с помощью которого будет выполняться обращение к базе данных.
//
// Возвращаемое значение:
//	Строка - Текст запроса для получения таблица со следующими полями:
//		* СчетФактураДокумент - ДокументСсылка.* - Ссылка на документ, представляющий счет-фактуру.
//		* СчетФактураДата - ДатаВремя - Дата документа счета-фактуры.
//		* ПродавецСсылка - СправочникСсылка.Контрагенты - Продавец из счета-фактуры.
//		* ДатаПлатежногоДокумента - ДатаВремя - Дата платежного документа, которым оплачен счет-фактура.
//		* НомерПлатежногоДокумента - Строка - Номер платежного документа, которым оплачен счет-фактура.
//
Функция ТекстЗапросаРеквизитыКонтрагентовДокументовОплаты(Запрос) Экспорт
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СчетФактураПолученныйПродавцы.Ссылка КАК СчетФактураДокумент,
		|	СчетФактураПолученный.Дата КАК СчетФактураДата,
		|	СчетФактураПолученныйПродавцы.Продавец КАК ПродавецСсылка,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПлатежногоДокумента,
		|	"""" КАК НомерПлатежногоДокумента
		|ИЗ
		|	Документ.СчетФактураПолученный.Продавцы КАК СчетФактураПолученныйПродавцы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК СчетФактураПолученный
		|		ПО СчетФактураПолученныйПродавцы.Ссылка = СчетФактураПолученный.Ссылка
		|			И (СчетФактураПолученный.СводныйКомиссионный)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
		|		ПО СчетФактураПолученныйПродавцы.Ссылка = СчетФактураПолученныйДокументыОснования.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокСчетовФактур КАК СписокСчетовФактур
		|		ПО СчетФактураПолученныйДокументыОснования.ДокументОснование = СписокСчетовФактур.СчетФактура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СчетФактураПолученныйПродавцы.Ссылка,
		|	СчетФактураПолученный.Дата,
		|	СчетФактураПолученныйПродавцы.Продавец,
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	""""
		|ИЗ
		|	Документ.СчетФактураПолученный.Продавцы КАК СчетФактураПолученныйПродавцы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК СчетФактураПолученный
		|		ПО СчетФактураПолученныйПродавцы.Ссылка = СчетФактураПолученный.Ссылка
		|			И (СчетФактураПолученный.СводныйКомиссионный)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокСчетовФактур КАК СписокСчетовФактур
		|		ПО СчетФактураПолученный.Ссылка = СписокСчетовФактур.СчетФактура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СчетФактураПолученныйАвансПродавцы.Ссылка,
		|	СчетФактураПолученныйАванс.Дата,
		|	СчетФактураПолученныйАвансПродавцы.Продавец,
		|	ЕСТЬNULL(ДанныеПервичныхДокументов.Дата, ДАТАВРЕМЯ(1, 1, 1)),
		|	ЕСТЬNULL(ДанныеПервичныхДокументов.Номер, """")
		|ИЗ
		|	Документ.СчетФактураПолученныйАванс.Продавцы КАК СчетФактураПолученныйАвансПродавцы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученныйАванс КАК СчетФактураПолученныйАванс
		|		ПО СчетФактураПолученныйАвансПродавцы.Ссылка = СчетФактураПолученныйАванс.Ссылка
		|			И (СчетФактураПолученныйАванс.СводныйКомиссионный)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
		|		ПО (СчетФактураПолученныйАванс.ДокументОснование.Организация = ДанныеПервичныхДокументов.Организация)
		|			И (СчетФактураПолученныйАванс.ДокументОснование = ДанныеПервичныхДокументов.Документ)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокСчетовФактур КАК СписокСчетовФактур
		|		ПО СчетФактураПолученныйАванс.ДокументОснование = СписокСчетовФактур.СчетФактура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СчетФактураПолученныйАвансПродавцы.Ссылка,
		|	СчетФактураПолученныйАванс.Дата,
		|	СчетФактураПолученныйАвансПродавцы.Продавец,
		|	ЕСТЬNULL(ДанныеПервичныхДокументов.Дата, ДАТАВРЕМЯ(1, 1, 1)),
		|	ЕСТЬNULL(ДанныеПервичныхДокументов.Номер, """")
		|ИЗ
		|	Документ.СчетФактураПолученныйАванс.Продавцы КАК СчетФактураПолученныйАвансПродавцы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученныйАванс КАК СчетФактураПолученныйАванс
		|		ПО СчетФактураПолученныйАвансПродавцы.Ссылка = СчетФактураПолученныйАванс.Ссылка
		|			И (СчетФактураПолученныйАванс.СводныйКомиссионный)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
		|		ПО (СчетФактураПолученныйАванс.ДокументОснование.Организация = ДанныеПервичныхДокументов.Организация)
		|			И (СчетФактураПолученныйАванс.ДокументОснование = ДанныеПервичныхДокументов.Документ)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокСчетовФактур КАК СписокСчетовФактур
		|		ПО СчетФактураПолученныйАванс.Ссылка = СписокСчетовФактур.СчетФактура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВозвратТоваровОтКлиента.Ссылка,
		|	ВозвратТоваровОтКлиента.Дата,
		|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
		|	ВозвратТоваровОтКлиента.ДатаРасходногоКассовогоОрдера,
		|	ВозвратТоваровОтКлиента.НомерРасходногоКассовогоОрдера
		|ИЗ
		|	Документ.ВозвратТоваровОтКлиента КАК ВозвратТоваровОтКлиента
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокСчетовФактур КАК СписокСчетовФактур
		|	ПО ВозвратТоваровОтКлиента.Ссылка = СписокСчетовФактур.СчетФактура";

	Возврат ТекстЗапроса;
	
КонецФункции

// Функция возвращает текст запроса для получения раздела 12 Декларации по НДС с 2015 г.
// "Сведения из счетов-фактур, выставленных лицами, указанными в п.5 ст.173 НК РФ".
//
// Параметры:
//	Запрос - Запрос - Объект запрос, с помощью которого будет выполняться обращение к базе данных.
//	СписокОрганизаций - СписокЗначений - Список ссылок на организации, по которым строится отчет. 
//	НачалоПериода - ДатаВремя - Начало периода формирования отчета. 
//	КонецПериода - ДатаВремя - Конец периода формирования отчета. 
//
// Возвращаемое значение:
//	Строка - Текст запроса для получения таблица со следующими полями:
//		* Номер - Строка - Номер документа счета-фактуры.
//		* Дата - ДатаВремя - Дата документа счета-фактуры.
//		* Контрагент - СправочникСсылка.Контрагенты - Контрагент из счета-фактуры.
//		* КППКонтрагента - Строка - КПП контрагента из счета-фактуры.
//		* СуммаНДСДокумента - Число - Сумма НДС по счету-фактуре.
//		* СуммаДокумента - Число - Общая сумма с НДС по счету-фактуре.
//		* ВалютаДокумента - СправочникСсылка.Валюты - Валюта счета-фактуры.
//		* Ссылка - ДокументСсылка.* - Ссылка на документ счет-фактура.
//
Функция ТекстЗапросаСчетаФактурыВыставленныеНеплательщикамиНДС(Запрос, СписокОрганизаций, НачалоПериода, КонецПериода) Экспорт

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЖурналУчетаСчетовФактур.НомерСчетаФактуры КАК Номер,
	|	ЖурналУчетаСчетовФактур.ДатаСчетаФактуры КАК Дата,
	|	ЖурналУчетаСчетовФактур.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.КППКонтрагента ПОДОБНО """"
	|			ТОГДА ЖурналУчетаСчетовФактур.Контрагент.КПП
	|		ИНАЧЕ ЖурналУчетаСчетовФактур.КППКонтрагента
	|	КОНЕЦ КАК КППКонтрагента,
	|	ЖурналУчетаСчетовФактур.СуммаНДС КАК СуммаНДСДокумента,
	|	ЖурналУчетаСчетовФактур.СуммаНДСКомиссия КАК СуммаНДСДокументаКомиссия,
	|	ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуре КАК СуммаДокумента,
	|	ЖурналУчетаСчетовФактур.Валюта КАК ВалютаДокумента,
	|	ЖурналУчетаСчетовФактур.СчетФактура КАК Ссылка
	|ИЗ
	|	РегистрСведений.ЖурналУчетаСчетовФактур КАК ЖурналУчетаСчетовФактур
	|ГДЕ
	|	ЖурналУчетаСчетовФактур.ЧастьЖурнала = ЗНАЧЕНИЕ(Перечисление.ЧастиЖурналаУчетаСчетовФактур.ВыставленныеСчетаФактуры)
	|	И ЖурналУчетаСчетовФактур.СуммаНДС - ЖурналУчетаСчетовФактур.СуммаНДСКомиссия > 0
	|	И ЖурналУчетаСчетовФактур.Организация В(&Организация)
	|	И ЖурналУчетаСчетовФактур.ДатаВыставленияПолучения МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (&ОрганизацияНеПлательшикНДС
	|			ИЛИ &ОрганизацияОсвобожденаОтУплатыНДС)
	|";
	
	Возврат ТекстЗапроса;

КонецФункции

// Функция возвращает текст запроса для сопоставления счетов-фактур, выписанных при неподтверждении 0%,
// с исходными документами отгрузки, которые не были подтверждены.
// В текст запроса можно использовать параметры запроса:
//	* Организация - Список организаций, по которым строится декларация НДС.
//	* НачалоПериода - Дата - Дата начала периода декларации НДС.
//	* КонецПериода - Дата - Дата окончания периода декларации НДС.
//
// Возвращаемое значение:
//	Строка - Текст запроса, возвращающего таблицу с колонками:
//		* СчетФактура - ДокументСсылка.* - Ссылка на счет-фактуру, выписанную при неподтверждении 0%.
//		* ДокументОтгрузки - ДокументСсылка.* - Ссылка на документ реализации по 0%, который не был подтвержден.
//
Функция ТекстЗапросаНеподтвержденныеРеализации0() Экспорт

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СчетФактураНаНеподтвержденнуюРеализацию0.Ссылка КАК СчетФактура,
	|	СчетФактураНаНеподтвержденнуюРеализацию0.ДокументОснование КАК ДокументОтгрузки
	|ИЗ
	|	Документ.СчетФактураНаНеподтвержденнуюРеализацию0 КАК СчетФактураНаНеподтвержденнуюРеализацию0
	|ГДЕ
	|	СчетФактураНаНеподтвержденнуюРеализацию0.Проведен
	|	И СчетФактураНаНеподтвержденнуюРеализацию0.Организация В (&Организация)";
	
	Возврат ТекстЗапроса;

КонецФункции

// Функция возвращает текст запроса для получения списка заявлений и налоговых периодов,
// к которым они относятся.
// В текст запроса можно использовать параметры запроса:
//	* Организация - Организация, по которым строится отчет по косвенным налогам.
//
// Возвращаемое значение:
//	Строка - Текст запроса, возвращающего таблицу с колонками:
//		* ЗаявлениеОВвозе - ДокументСсылка.* - Ссылка на заявление.
//		* ДатаПринятияНаУчет - Дата - Дата принятия к учету товаров по заявлению.
//
Функция ТекстЗапросаЗаявленияОВвозеТоваров() Экспорт

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗаявленияОВвозе.Ссылка КАК ЗаявлениеОВвозе,
	|	МИНИМУМ(ЗаявленияОВвозе.ДатаПринятияНаУчет) КАК НалоговыйПериод
	|ИЗ
	|	Документ.ЗаявлениеОВвозеТоваров.Товары КАК ЗаявленияОВвозе
	|ГДЕ
	|	ЗаявленияОВвозе.Ссылка.Организация = &Организация
	|	И ЗаявленияОВвозе.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявленияОВвозе.Ссылка";
	
	Возврат ТекстЗапроса;

КонецФункции

// Процедура ПолучитьСчетаФактурыДокументыКнигаПокупок помещает в менеджер временных таблиц Запроса
// временную таблицу "ТаблицаСчетаФактурыДокументы" с реквизитами счетов-фактур полученных для книги покупок.
//
// Параметры:
//	Запрос - Запрос - Запрос, с которым выполняется работа. У запроса установлен параметр "Организация" со списком организаций.
//		В менеджере временных таблиц существует таблица "ЗаписиКнигиПокупок",
//		по которой отбирать счета-фактуры. В таблице должна присутствовать колонки: 
//		СчетФактура - ДокументСсылка.*.
//		Организация - СправочникСсылка.Организации.
//		ДокументОплаты - ДокументСсылка.*
//		ДоговорАванса - СправочникСсылка.ДоговорыКонтрагентов.
//		НаАванс - Булево.
//		СтавкаНДС_Аванс - ПеречислениеСсылка.СтавкиНДС.
//
Процедура ПолучитьСчетаФактурыДокументыКнигаПокупок(Запрос) Экспорт

	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Строки.ДокументОснование КАК СчетФактура,
	|	Операция.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА Операция.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА Операция.Организация
	|		ИНАЧЕ
	|			Операция.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	Операция.Контрагент КАК Контрагент,
	|	Операция.Номер КАК НомерСчетаФактуры,
	|	Операция.ДатаСоставления КАК ДатаСчетаФактуры,
	|	Операция.Ссылка КАК СчетФактураДокумент,
	|	ЛОЖЬ КАК НаАванс,
	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
	|	1 КАК Приоритет,
	|	ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаПоступление) КАК ВидСчетаФактуры,
	|	Операция.Исправление КАК Исправление,
	|	Строки.ДокументОснование.Дата КАК ДатаДокументаОснования,
	|	1 КАК НомерСтроки,
	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
	|	Операция.СводныйКорректировочный КАК СводныйКорректировочный,
	|	Операция.СводныйКомиссионный КАК СводныйКомиссионный,
	|	ЛОЖЬ КАК ВозвратЧерезКомиссионера
	|
	|ПОМЕСТИТЬ СчетаФактурыДокументы
	|ИЗ
	|	Документ.СчетФактураПолученный КАК Операция
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.СчетФактураПолученный.ДокументыОснования КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.Организация В (&Организация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК СчетФактура,
	|	Операция.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА Операция.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА Операция.Организация
	|		ИНАЧЕ
	|			Операция.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	Операция.Контрагент КАК Контрагент,
	|	Операция.Номер КАК НомерСчетаФактуры,
	|	Операция.ДатаСоставления КАК ДатаСчетаФактуры,
	|	Операция.Ссылка КАК СчетФактураДокумент,
	|	ЛОЖЬ КАК НаАванс,
	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
	|	1 КАК Приоритет,
	|	ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаПоступление) КАК ВидСчетаФактуры,
	|	Операция.Исправление КАК Исправление,
	|	Строки.ДокументОснование.Дата КАК ДатаДокументаОснования,
	|	1 КАК НомерСтроки,
	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
	|	Операция.СводныйКорректировочный КАК СводныйКорректировочный,
	|	Операция.СводныйКомиссионный КАК СводныйКомиссионный,
	|	ЛОЖЬ КАК ВозвратЧерезКомиссионера
	|
	|ИЗ
	|	Документ.СчетФактураПолученный КАК Операция
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.СчетФактураПолученный.ДокументыОснования КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|		И Строки.НомерСтроки = 1
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.Организация В (&Организация)
	|	И Операция.Исправление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Ссылка КАК СчетФактура,
	|	Операция.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА Операция.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА Операция.Организация
	|		ИНАЧЕ
	|			Операция.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	Операция.Контрагент КАК Контрагент,
	|	Операция.Номер КАК НомерСчетаФактуры,
	|	Операция.ДатаСоставления КАК ДатаСчетаФактуры,
	|	Операция.Ссылка КАК СчетФактураДокумент,
	|	ЛОЖЬ КАК НаАванс,
	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
	|	1 КАК Приоритет,
	|	ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаПоступление) КАК ВидСчетаФактуры,
	|	Операция.Исправление КАК Исправление,
	|	Строки.ДокументОснование.Дата КАК ДатаДокументаОснования,
	|	1 КАК НомерСтроки,
	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
	|	Операция.СводныйКорректировочный КАК СводныйКорректировочный,
	|	Операция.СводныйКомиссионный КАК СводныйКомиссионный,
	|	ЛОЖЬ КАК ВозвратЧерезКомиссионера
	|
	|ИЗ
	|	Документ.СчетФактураПолученный КАК Операция
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.СчетФактураПолученный.ДокументыОснования КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|		И Строки.НомерСтроки = 1
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.Организация В (&Организация)
	|	И Операция.Исправление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Операция.Исправление
	|			ТОГДА Операция.Ссылка
	|		ИНАЧЕ
	|			Операция.ДокументОснование
	|	КОНЕЦ КАК СчетФактура,
	|	Операция.Организация,
	|	ВЫБОР
	|		КОГДА Операция.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА Операция.Организация
	|		ИНАЧЕ
	|			Операция.Организация.ГоловнаяОрганизация
	|	КОНЕЦ,
	|	Операция.Контрагент КАК Контрагент,
	|	Операция.Номер,
	|	Операция.ДатаСоставления,
	|	Операция.Ссылка,
	|	ИСТИНА,
	|	Строки.СтавкаНДС,
	|	НЕОПРЕДЕЛЕНО,
	|	1,
	|	ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс),
	|	Операция.Исправление,
	|	Операция.ДокументОснование.Дата,
	|	1 КАК НомерСтроки,
	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
	|	ЛОЖЬ КАК СводныйКорректировочный,
	|	Операция.СводныйКомиссионный КАК СводныйКомиссионный,
	|	ЛОЖЬ КАК ВозвратЧерезКомиссионера
	|ИЗ
	|	Документ.СчетФактураПолученныйАванс КАК Операция
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.СчетФактураПолученныйАванс.Авансы КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.Организация В (&Организация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.ДокументОснование,
	|	Операция.Организация,
	|	ВЫБОР
	|		КОГДА Операция.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА Операция.Организация
	|		ИНАЧЕ
	|			Операция.Организация.ГоловнаяОрганизация
	|	КОНЕЦ,
	|	Операция.Контрагент,
	|	Операция.Номер,
	|	Операция.Дата,
	|	Операция.Ссылка,
	|	ИСТИНА,
	|	Строки.СтавкаНДС,
	|	НЕОПРЕДЕЛЕНО,
	|	1,
	|	ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаАванс),
	|	ЛОЖЬ,
	|	Операция.ДокументОснование.Дата,
	|	1 КАК НомерСтроки,
	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
	|	ЛОЖЬ КАК СводныйКорректировочный,
	|	ЛОЖЬ КАК СводныйКомиссионный,
	|	ЛОЖЬ КАК ВозвратЧерезКомиссионера
	|ИЗ
	|	Документ.СчетФактураВыданныйАванс КАК Операция
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.СчетФактураВыданныйАванс.Авансы КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданныйАванс КАК БудущаяОперация
	|		ПО Операция.ДокументОснование = БудущаяОперация.ДокументОснование
	|			И Операция.Контрагент = БудущаяОперация.Контрагент
	|			И Операция.Дата < БудущаяОперация.Дата
	|			И БудущаяОперация.Проведен
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.Организация В (&Организация)
	|	И БудущаяОперация.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Операция.Исправление
	|			ТОГДА Операция.Ссылка
	|		ИНАЧЕ
	|			Строки.ДокументОснование
	|	КОНЕЦ,
	|	Операция.Контрагент,
	|	ВЫБОР
	|		КОГДА ДанныеОрганизации.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ДанныеОрганизации.Ссылка
	|		ИНАЧЕ
	|			ДанныеОрганизации.ГоловнаяОрганизация
	|	КОНЕЦ,
	|	Операция.Организация,
	|	Операция.Номер,
	|	Операция.Дата,
	|	Операция.Ссылка,
	|	Ложь,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	1,
	|	ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаПоступление),
	|	Операция.Исправление,
	|	Строки.ДокументОснование.Дата,
	|	2 КАК НомерСтроки,
	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
	|	Операция.СводныйКорректировочный КАК СводныйКорректировочный,
	|	ЛОЖЬ КАК СводныйКомиссионный,
	|	ЛОЖЬ КАК ВозвратЧерезКомиссионера
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Операция
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.СчетФактураВыданный.ДокументыОснования КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.Организации КАК ДанныеОрганизации
	|	ПО
	|		Операция.Контрагент = ДанныеОрганизации.Ссылка
	|		И ДанныеОрганизации.Ссылка В (&Организация)
	|ГДЕ
	|	Операция.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Операция.Исправление
	|			ТОГДА Операция.Ссылка
	|		ИНАЧЕ
	|			Строки.ДокументОснование
	|	КОНЕЦ,
	|	Корректировка.Организация,
	|	ВЫБОР
	|		КОГДА Корректировка.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА Корректировка.Организация
	|		ИНАЧЕ
	|			Корректировка.Организация.ГоловнаяОрганизация
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Операция.Корректировочный
	|			ТОГДА Корректировка.Контрагент
	|		ИНАЧЕ 
	|			Корректировка.Организация
	|	КОНЕЦ,
	|	Операция.Номер,
	|	Операция.Дата,
	|	Операция.Ссылка,
	|	Ложь,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	1,
	|	ВЫБОР
	|		КОГДА Операция.Корректировочный
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.Корректировочный)
	|		ИНАЧЕ 
	|			ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НаРеализацию)
	|	КОНЕЦ,
	|	Операция.Исправление,
	|	Корректировка.Дата,
	|	1 КАК НомерСтроки,
	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
	|	Операция.СводныйКорректировочный КАК СводныйКорректировочный,
	|	ЛОЖЬ КАК СводныйКомиссионный,
	|	ЛОЖЬ КАК ВозвратЧерезКомиссионера
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Операция
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.СчетФактураВыданный.ДокументыОснования КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.КорректировкаРеализации КАК Корректировка
	|	ПО
	|		Корректировка.Ссылка = Строки.ДокументОснование
	|ГДЕ
	|	Операция.Проведен
	|	И Корректировка.Организация В (&Организация)
	|	И Корректировка.ВидКорректировки В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ИсправлениеОшибок),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаПоСогласованиюСторон))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Ссылка,
	|	Операция.Организация,
	|	ВЫБОР
	|		КОГДА Операция.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА Операция.Организация
	|		ИНАЧЕ
	|			Операция.Организация.ГоловнаяОрганизация
	|	КОНЕЦ,
	|	Операция.Контрагент,
	|	Операция.НомерДекларации,
	|	Операция.Дата,
	|	Операция.Ссылка,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	1,
	|	ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаПоступление),
	|	ЛОЖЬ,
	|	Операция.Дата,
	|	1 КАК НомерСтроки,
	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
	|	ЛОЖЬ КАК СводныйКорректировочный,
	|	ЛОЖЬ КАК СводныйКомиссионный,
	|	ЛОЖЬ КАК ВозвратЧерезКомиссионера
	|
	|ИЗ
	|	Документ.ТаможеннаяДекларацияИмпорт КАК Операция
	|
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.Организация В (&Организация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Ссылка,
	|	Операция.Организация,
	|	ВЫБОР
	|		КОГДА Операция.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА Операция.Организация
	|		ИНАЧЕ
	|			Операция.Организация.ГоловнаяОрганизация
	|	КОНЕЦ,
	|	Операция.Контрагент,
	|	Операция.НомерОтметкиОРегистрации,
	|	Операция.ДатаПодтвержденияОплаты,
	|	Операция.Ссылка,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	1,
	|	ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаПоступление),
	|	ЛОЖЬ,
	|	Операция.Дата,
	|	1 КАК НомерСтроки,
	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
	|	ЛОЖЬ КАК СводныйКорректировочный,
	|	ЛОЖЬ КАК СводныйКомиссионный,
	|	ЛОЖЬ КАК ВозвратЧерезКомиссионера
	|
	|ИЗ
	|	Документ.ЗаявлениеОВвозеТоваров КАК Операция
	|
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.Организация В (&Организация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.ДокументОснование,
	|	Операция.Организация,
	|	ВЫБОР
	|		КОГДА Операция.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА Операция.Организация
	|		ИНАЧЕ
	|			Операция.Организация.ГоловнаяОрганизация
	|	КОНЕЦ,
	|	Операция.Поставщик,
	|	Операция.Номер,
	|	Операция.Дата,
	|	Операция.Ссылка,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА Операция.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) ТОГДА
	|			НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ 
	|			Операция.Договор 
	|	КОНЕЦ КАК ДоговорАванса,
	|	1,
	|	ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.НалоговыйАгент),
	|	ЛОЖЬ,
	|	Строки.ДатаПоступления,
	|	1 КАК НомерСтроки,
	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
	|	ЛОЖЬ КАК СводныйКорректировочный,
	|	ЛОЖЬ КАК СводныйКомиссионный,
	|	ЛОЖЬ КАК ВозвратЧерезКомиссионера
	|ИЗ
	|	Документ.СчетФактураНалоговыйАгент КАК Операция
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.СчетФактураНалоговыйАгент.ДокументыПоступления КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|		И Строки.НомерСтроки = 1
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.Организация В (&Организация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР 
	|		КОГДА Операция.ДокументРасчетов = НЕОПРЕДЕЛЕНО
	|			ТОГДА Операция.Ссылка
	|		ИНАЧЕ Операция.ДокументРасчетов
	|	КОНЕЦ,
	|	Операция.Организация,
	|	ВЫБОР
	|		КОГДА Операция.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА Операция.Организация
	|		ИНАЧЕ
	|			Операция.Организация.ГоловнаяОрганизация
	|	КОНЕЦ,
	|	Операция.Контрагент,
	|	ВЫБОР 
	|		КОГДА Операция.ПредъявленСчетФактура 
	|				И Операция.ДатаПолучения <> ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА Операция.НомерСчетаФактуры
	|		ИНАЧЕ Операция.Номер
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Операция.ПредъявленСчетФактура 
	|				И Операция.ДатаПолучения <> ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА Операция.ДатаСчетаФактуры
	|		ИНАЧЕ Операция.Дата
	|	КОНЕЦ,
	|	Операция.Ссылка,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	1,
	|	ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаПоступление),
	|	ЛОЖЬ,
	|	ВЫБОР 
	|		КОГДА Операция.ДокументРасчетов = НЕОПРЕДЕЛЕНО
	|			ТОГДА Операция.Дата
	|		ИНАЧЕ ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, Операция.Дата) 
	|	КОНЕЦ,
	|	1 КАК НомерСтроки,
	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
	|	ЛОЖЬ КАК СводныйКорректировочный,
	|	ЛОЖЬ КАК СводныйКомиссионный,
	|	ЛОЖЬ КАК ВозвратЧерезКомиссионера
	|
	|ИЗ
	|	Документ.ЗаписьКнигиПокупок КАК Операция
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|	ПО
	|		Операция.Организация = ДанныеПервичныхДокументов.Организация
	|		И Операция.ДокументРасчетов = ДанныеПервичныхДокументов.Документ
	|	
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.ПредъявленСчетФактура
	|	И Операция.Организация В (&Организация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Ссылка,
	|	Операция.Организация,
	|	ВЫБОР
	|		КОГДА Операция.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА Операция.Организация
	|		ИНАЧЕ
	|			Операция.Организация.ГоловнаяОрганизация
	|	КОНЕЦ,
	|	Операция.Контрагент,
	|	Операция.НомерРасходногоКассовогоОрдера,
	|	Операция.ДатаРасходногоКассовогоОрдера,
	|	Операция.Ссылка,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	1,
	|	ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаПоступление),
	|	ЛОЖЬ,
	|	ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, Операция.Дата),
	|	1 КАК НомерСтроки,
	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
	|	ЛОЖЬ КАК СводныйКорректировочный,
	|	ЛОЖЬ КАК СводныйКомиссионный,
	|	ЛОЖЬ КАК ВозвратЧерезКомиссионера
	|
	|ИЗ
	|	Документ.ВозвратТоваровОтКлиента КАК Операция
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|		ПО Операция.ДокументРеализации = ДанныеПервичныхДокументов.Документ
	|			И Операция.Организация = ДанныеПервичныхДокументов.Организация
	|
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя)
	|	И Операция.ВыданыДенежныеСредства
	|	И Операция.Организация В (&Организация)
	|	И НЕ Операция.ПокупательНеПлательщикНДС
	|
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Ссылка,
	|	Операция.Организация,
	|	ВЫБОР
	|		КОГДА Операция.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА Операция.Организация
	|		ИНАЧЕ
	|			Операция.Организация.ГоловнаяОрганизация
	|	КОНЕЦ,
	|	Операция.Контрагент,
	|	Операция.НомерОтметкиОРегистрации,
	|	Операция.ДатаПодтвержденияОплаты,
	|	Операция.Ссылка,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	1 КАК Приоритет,
	|	ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаПоступление),
	|	ЛОЖЬ,
	|	Операция.Дата,
	|	1 КАК НомерСтроки,
	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
	|	ЛОЖЬ КАК СводныйКорректировочный,
	|	ЛОЖЬ КАК СводныйКомиссионный,
	|	ЛОЖЬ КАК ВозвратЧерезКомиссионера
	|ИЗ
	|	Документ.ЗаявлениеОВвозеТоваров КАК Операция
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.Организация В(&Организация)
	|	И Операция.ОплатаПодтверждена
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВидыЗапасов.ДокументРеализации,
	|	ВидыЗапасов.Ссылка.Организация,
	|	ВЫБОР
	|		КОГДА ВидыЗапасов.Ссылка.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ВидыЗапасов.Ссылка.Организация
	|		ИНАЧЕ
	|			ВидыЗапасов.Ссылка.Организация.ГоловнаяОрганизация
	|	КОНЕЦ,
	|	ВидыЗапасов.Ссылка.Организация,
	|	Операция.Номер,
	|	Операция.Дата,
	|	Операция.Ссылка,
	|	Ложь,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	1,
	|	ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаПоступление),
	|	Операция.Исправление,
	|	ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ВидыЗапасов.Ссылка.Дата),
	|	2 КАК НомерСтроки,
	|	ИСТИНА КАК ОбрабатыватьНомерДокумента,
	|	Операция.СводныйКорректировочный КАК СводныйКорректировочный,
	|	ЛОЖЬ КАК СводныйКомиссионный,
	|	ЛОЖЬ КАК ВозвратЧерезКомиссионера
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Операция
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.СчетФактураВыданный.ДокументыОснования КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ВозвратТоваровОтКлиента.ВидыЗапасов КАК ВидыЗапасов
	|	ПО
	|		ВидыЗапасов.ДокументРеализации = Строки.ДокументОснование
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|		ПО ВидыЗапасов.ДокументРеализации = ДанныеПервичныхДокументов.Документ
	|			И ВидыЗапасов.Ссылка.Организация = ДанныеПервичныхДокументов.Организация
	|ГДЕ
	|	Операция.Проведен
	|	И НЕ Операция.Исправление
	|	И НЕ Операция.Корректировочный
	|	И ВидыЗапасов.Ссылка.ПокупательНеПлательщикНДС
	|	И ВидыЗапасов.Ссылка.Проведен
	|	И ВидыЗапасов.Ссылка.Организация В (&Организация)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура,
	|	ГоловнаяОрганизация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(СчетаФактурыДокументы.СчетФактура, ЗаписиКнигиПокупок.СчетФактура) КАК СчетФактура,
	|	ЕСТЬNULL(СчетаФактурыДокументы.Организация, ЗаписиКнигиПокупок.Организация) КАК Организация,
	|	ЕСТЬNULL(СчетаФактурыДокументы.ГоловнаяОрганизация, ЗаписиКнигиПокупок.ГоловнаяОрганизация) КАК ГоловнаяОрганизация,
	|	ЕСТЬNULL(СчетаФактурыДокументы.ДатаСчетаФактуры, ДанныеПервичныхДокументов.Дата) КАК ДатаСчетаФактуры,
	|	ЕСТЬNULL(СчетаФактурыДокументы.НомерСчетаФактуры, ДанныеПервичныхДокументов.Номер) КАК НомерСчетаФактуры,
	|	ЕСТЬNULL(СчетаФактурыДокументы.СчетФактураДокумент, ЗаписиКнигиПокупок.СчетФактура) КАК СчетФактураДокумент,
	|	ЕСТЬNULL(СчетаФактурыДокументы.ДоговорАванса, НЕОПРЕДЕЛЕНО) КАК ДоговорАванса,
	|	ЕСТЬNULL(СчетаФактурыДокументы.СтавкаНДСАванса, НЕОПРЕДЕЛЕНО) КАК СтавкаНДСАванса,
	|	СчетаФактурыДокументы.ОбрабатыватьНомерДокумента,
	|	СчетаФактурыДокументы.СчетФактураДокумент КАК СчетФактураДокументРасшифровка,
	|	ЕСТЬNULL(СчетаФактурыДокументы.ВидСчетаФактуры, ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаПоступление)) КАК ВидСчетаФактуры,
	|	ЕСТЬNULL(СчетаФактурыДокументы.Исправление, ЛОЖЬ) КАК Исправление,
	|	СчетаФактурыДокументы.ДатаДокументаОснования КАК ДатаДокументаОснования,
	|	СчетаФактурыДокументы.НомерСтроки,
	|	СчетаФактурыДокументы.СводныйКорректировочный КАК СводныйКорректировочный,
	|	СчетаФактурыДокументы.СводныйКомиссионный,
	|	ЕСТЬNULL(СчетаФактурыДокументы.Контрагент, ЗаписиКнигиПокупок.КонтрагентПоСчетуФактуре) КАК Контрагент,
	|	ВЫБОР
	|		КОГДА СчетаФактурыДокументы.СчетФактура ЕСТЬ NULL 
	|			ТОГДА ВЫБОР
	|					КОГДА &КонецПериода >= ДАТАВРЕМЯ(2015, 1, 1)
	|						ТОГДА ""26""
	|					ИНАЧЕ ""01""
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодВидаОперации,
	|	ЗаписиКнигиПокупок.ВозвратЧерезКомиссионера
	|ПОМЕСТИТЬ ТаблицаСчетаФактурыДокументыПредварительная
	|ИЗ
	|	ЗаписиКнигиПокупок КАК ЗаписиКнигиПокупок
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаФактурыДокументы КАК СчетаФактурыДокументы
	|		ПО  (ЗаписиКнигиПокупок.СчетФактура = СчетаФактурыДокументы.СчетФактура
	|			 ИЛИ ЗаписиКнигиПокупок.ДокументОплаты = СчетаФактурыДокументы.СчетФактура)
	|			И ЗаписиКнигиПокупок.ГоловнаяОрганизация = СчетаФактурыДокументы.ГоловнаяОрганизация
	|			И ЗаписиКнигиПокупок.КонтрагентПоСчетуФактуре = СчетаФактурыДокументы.Контрагент
	|			И ЗаписиКнигиПокупок.ДоговорАванса = СчетаФактурыДокументы.ДоговорАванса
	|			И (НЕ ЗаписиКнигиПокупок.НаАванс
	|				ИЛИ СчетаФактурыДокументы.НаАванс
	|					И ЗаписиКнигиПокупок.СтавкаНДС_Аванс = СчетаФактурыДокументы.СтавкаНДСАванса)
	|			И ЗаписиКнигиПокупок.ВозвратЧерезКомиссионера = СчетаФактурыДокументы.ВозвратЧерезКомиссионера
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|		ПО ЗаписиКнигиПокупок.СчетФактура = ДанныеПервичныхДокументов.Документ
	|			И ЗаписиКнигиПокупок.Организация = ДанныеПервичныхДокументов.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура,
	|	ДоговорАванса,
	|	ВидСчетаФактуры,
	|	Исправление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСчетаФактурыДокументы.Контрагент КАК СчетФактураДокументКонтрагент,
	|	ТаблицаСчетаФактурыДокументы.ДоговорАванса КАК ДоговорАванса,
	|	ТаблицаСчетаФактурыДокументы.ВидСчетаФактуры КАК ВидСчетаФактуры,
	|	ТаблицаСчетаФактурыДокументы.Исправление КАК Исправление,
	|	ТаблицаСчетаФактурыДокументы.СчетФактура КАК СчетФактура,
	|	МАКСИМУМ(ТаблицаСчетаФактурыДокументы.СчетФактураДокумент) КАК СчетФактураДокумент,
	|	ТаблицаСчетаФактурыДокументы.СводныйКорректировочный,
	|	ТаблицаСчетаФактурыДокументы.СводныйКомиссионный,
	|	ТаблицаСчетаФактурыДокументы.КодВидаОперации,
	|	ТаблицаСчетаФактурыДокументы.ВозвратЧерезКомиссионера
	|ПОМЕСТИТЬ ВТ_ОбъединениеСФ
	|ИЗ
	|	ТаблицаСчетаФактурыДокументыПредварительная КАК ТаблицаСчетаФактурыДокументы
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаСчетаФактурыДокументы.СчетФактура,
	|	ТаблицаСчетаФактурыДокументы.Контрагент,
	|	ТаблицаСчетаФактурыДокументы.ДоговорАванса,
	|	ТаблицаСчетаФактурыДокументы.ВидСчетаФактуры,
	|	ТаблицаСчетаФактурыДокументы.Исправление,
	|	ТаблицаСчетаФактурыДокументы.СводныйКорректировочный,
	|	ТаблицаСчетаФактурыДокументы.СводныйКомиссионный,
	|	ТаблицаСчетаФактурыДокументы.КодВидаОперации,
	|	ТаблицаСчетаФактурыДокументы.ВозвратЧерезКомиссионера
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактураДокументКонтрагент,
	|	ДоговорАванса,
	|	ВидСчетаФактуры,
	|	Исправление,
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСчетаФактурыДокументыПредварительная.СчетФактура,
	|	ТаблицаСчетаФактурыДокументыПредварительная.Организация,
	|	ТаблицаСчетаФактурыДокументыПредварительная.ГоловнаяОрганизация,
	|	ТаблицаСчетаФактурыДокументыПредварительная.ДатаСчетаФактуры,
	|	ТаблицаСчетаФактурыДокументыПредварительная.НомерСчетаФактуры,
	|	ВТ_ОбъединениеСФ.СчетФактураДокумент КАК СчетФактураДокумент,
	|	ВТ_ОбъединениеСФ.СчетФактураДокументКонтрагент,
	|	ТаблицаСчетаФактурыДокументыПредварительная.ОбрабатыватьНомерДокумента,
	|	ТаблицаСчетаФактурыДокументыПредварительная.ДоговорАванса,
	|	ТаблицаСчетаФактурыДокументыПредварительная.СтавкаНДСАванса,
	|	ТаблицаСчетаФактурыДокументыПредварительная.СчетФактураДокументРасшифровка,
	|	ТаблицаСчетаФактурыДокументыПредварительная.ДатаДокументаОснования КАК ДатаДокументаОснования,
	|	ТаблицаСчетаФактурыДокументыПредварительная.НомерСтроки,
	|	ТаблицаСчетаФактурыДокументыПредварительная.СводныйКорректировочный,
	|	ТаблицаСчетаФактурыДокументыПредварительная.СводныйКомиссионный,
	|	ТаблицаСчетаФактурыДокументыПредварительная.КодВидаОперации
	|ПОМЕСТИТЬ ВТ_ТаблицаСчетаФактурыДокументы
	|ИЗ
	|	ТаблицаСчетаФактурыДокументыПредварительная КАК ТаблицаСчетаФактурыДокументыПредварительная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОбъединениеСФ КАК ВТ_ОбъединениеСФ
	|		ПО ТаблицаСчетаФактурыДокументыПредварительная.ДоговорАванса = ВТ_ОбъединениеСФ.ДоговорАванса
	|			И ТаблицаСчетаФактурыДокументыПредварительная.ВидСчетаФактуры = ВТ_ОбъединениеСФ.ВидСчетаФактуры
	|			И ТаблицаСчетаФактурыДокументыПредварительная.Исправление = ВТ_ОбъединениеСФ.Исправление
	|			И ТаблицаСчетаФактурыДокументыПредварительная.СчетФактура = ВТ_ОбъединениеСФ.СчетФактура
	|			И ТаблицаСчетаФактурыДокументыПредварительная.Контрагент = ВТ_ОбъединениеСФ.СчетФактураДокументКонтрагент
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактураДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналУчетаСчетовФактур.Регистратор,
	|	ЖурналУчетаСчетовФактур.СчетФактура КАК СчетФактура,
	|	ЖурналУчетаСчетовФактур.Организация,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ЖурналУчетаСчетовФактур.Организация
	|		ИНАЧЕ ЖурналУчетаСчетовФактур.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	ЖурналУчетаСчетовФактур.НомерСчетаФактуры,
	|	ЖурналУчетаСчетовФактур.ДатаСчетаФактуры,
	|	ЖурналУчетаСчетовФактур.НомерКорректировочногоСчетаФактуры,
	|	ЖурналУчетаСчетовФактур.ДатаКорректировочногоСчетаФактуры,
	|	ЖурналУчетаСчетовФактур.НомерИсправления КАК НомерИсправления,
	|	ЖурналУчетаСчетовФактур.ДатаИсправления КАК ДатаИсправления,
	|	ЖурналУчетаСчетовФактур.НомерИсправленияКорректировочногоСчетаФактуры КАК НомерИсправленияКорректировки,
	|	ЖурналУчетаСчетовФактур.ДатаИсправленияКорректировочногоСчетаФактуры КАК ДатаИсправленияКорректировки,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ЖурналУчетаСчетовФактур.Продавец
	|		КОГДА ЖурналУчетаСчетовФактур.Контрагент <> ЖурналУчетаСчетовФактур.Организация
	|			ТОГДА ЖурналУчетаСчетовФактур.Контрагент
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ПродавецДляПечати,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ЖурналУчетаСчетовФактур.КПППродавца
	|		КОГДА ЖурналУчетаСчетовФактур.Контрагент <> ЖурналУчетаСчетовФактур.Организация
	|			ТОГДА ЖурналУчетаСчетовФактур.КППКонтрагента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КПППродавцаДляПечати,
	|	ВЫБОР
	|		КОГДА &ПравилаПостановления735
	|				И ЖурналУчетаСчетовФактур.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И ЖурналУчетаСчетовФактур.Контрагент <> ЖурналУчетаСчетовФактур.Организация
	|			ТОГДА ЖурналУчетаСчетовФактур.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК ПосредникСсылка,
	|	ЖурналУчетаСчетовФактур.НомерСтроки,
	|	ЖурналУчетаСчетовФактур.Валюта,
	|	ЖурналУчетаСчетовФактур.Валюта.Наименование,
	|	ЖурналУчетаСчетовФактур.Валюта.НаименованиеПолное,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураПолученный
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураПолученный).Корректировочный
	|						ТОГДА ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуреРазницаУвеличение
	|					ИНАЧЕ ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуре
	|				КОНЕЦ
	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураВыданный).Корректировочный
	|						ТОГДА ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуреРазницаУменьшение
	|					ИНАЧЕ ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуре
	|				КОНЕЦ
	|		ИНАЧЕ ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуре
	|	КОНЕЦ КАК ВсегоПокупокВВалюте,
	|	ЖурналУчетаСчетовФактур.Валюта.Код,
	|	ЖурналУчетаСчетовФактур.КодВидаОперации,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ЖурналУчетаСчетовФактур.ИННПродавца
	|		КОГДА ЖурналУчетаСчетовФактур.Контрагент <> ЖурналУчетаСчетовФактур.Организация
	|			ТОГДА ЖурналУчетаСчетовФактур.ИННКонтрагента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ИННПродавцаДляПечати,
	|	ЖурналУчетаСчетовФактур.Продавец,
	|	ВЫБОР
	|		КОГДА &ПравилаПостановления735
	|				И ЖурналУчетаСчетовФактур.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И ЖурналУчетаСчетовФактур.Контрагент <> ЖурналУчетаСчетовФактур.Организация
	|			ТОГДА ЖурналУчетаСчетовФактур.ИННКонтрагента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПосредникИНН,
	|	ВЫБОР
	|		КОГДА &ПравилаПостановления735
	|				И ЖурналУчетаСчетовФактур.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И ЖурналУчетаСчетовФактур.Контрагент <> ЖурналУчетаСчетовФактур.Организация
	|			ТОГДА ЖурналУчетаСчетовФактур.КППКонтрагента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПосредникКПП
	|ПОМЕСТИТЬ ВТ_РегистрацияСчетовФактур
	|ИЗ
	|	РегистрСведений.ЖурналУчетаСчетовФактур КАК ЖурналУчетаСчетовФактур
	|ГДЕ
	|	ЖурналУчетаСчетовФактур.Регистратор В
	|			(ВЫБРАТЬ
	|				ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент
	|			ИЗ
	|				ВТ_ТаблицаСчетаФактурыДокументы)
	|	И ЖурналУчетаСчетовФактур.Организация В(&Организация)
	|	И НЕ ЖурналУчетаСчетовФактур.Сторно
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГТДИмпорт.Ссылка КАК СчетФактура,
	|	СУММА(ГТДИмпорт.ТаможеннаяСтоимость + ГТДИмпорт.СуммаПошлины + ГТДИмпорт.СуммаНДС) КАК Стоимость
	|ПОМЕСТИТЬ ВТ_ПокупкиПриВвозеИмпорте
	|ИЗ
	|	Документ.ТаможеннаяДекларацияИмпорт.Разделы КАК ГТДИмпорт
	|ГДЕ
	|	ГТДИмпорт.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент
	|			ИЗ
	|				ВТ_ТаблицаСчетаФактурыДокументы)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГТДИмпорт.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаявлениеОВвозеТоваров.Ссылка,
	|	СУММА(ЗаявлениеОВвозеТоваров.НалоговаяБазаНДС + ЗаявлениеОВвозеТоваров.СуммаНДС)
	|ИЗ
	|	Документ.ЗаявлениеОВвозеТоваров.Товары КАК ЗаявлениеОВвозеТоваров
	|ГДЕ
	|	ЗаявлениеОВвозеТоваров.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент
	|			ИЗ
	|				ВТ_ТаблицаСчетаФактурыДокументы)
	|СГРУППИРОВАТЬ ПО
	|	ЗаявлениеОВвозеТоваров.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаСчетаФактурыДокументы.СчетФактура КАК СчетФактура,
	|	ВТ_ТаблицаСчетаФактурыДокументы.Организация КАК Организация,
	|	ВТ_ТаблицаСчетаФактурыДокументы.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.НомерСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры) КАК НомерСчетаФактуры,
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.ДатаСчетаФактуры) КАК ДатаСчетаФактуры,
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.Регистратор, ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент) КАК СчетФактураДокумент,
	|	ВТ_ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры КАК НомерСчетаФактурыСортировка,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаИсправления, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаИсправления
	|		ИНАЧЕ ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.ДатаСчетаФактуры)
	|	КОНЕЦ КАК ДатаСчетаФактурыСортировка,
	|	ВТ_ТаблицаСчетаФактурыДокументы.ДоговорАванса КАК ДоговорАванса,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СтавкаНДСАванса КАК СтавкаНДСАванса,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокументРасшифровка КАК СчетФактураДокументРасшифровка,
	|	ВТ_РегистрацияСчетовФактур.НомерКорректировочногоСчетаФактуры КАК НомерКорректировки,
	|	ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры КАК ДатаКорректировки,
	|	ВТ_РегистрацияСчетовФактур.НомерИсправления КАК НомерИсправления,
	|	ВТ_РегистрацияСчетовФактур.ДатаИсправления КАК ДатаИсправления,
	|	ВТ_РегистрацияСчетовФактур.НомерИсправленияКорректировки КАК НомерИсправленияКорректировки,
	|	ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки КАК ДатаИсправленияКорректировки,
	|	ВЫБОР
	|		КОГДА ВТ_РегистрацияСчетовФактур.СчетФактура ЕСТЬ NULL 
	|			ТОГДА ВТ_ТаблицаСчетаФактурыДокументы.ОбрабатыватьНомерДокумента
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОбрабатыватьНомерДокумента,
	|	ВТ_ТаблицаСчетаФактурыДокументы.ДатаДокументаОснования,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный,
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ПродавецДляПечати, ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокументКонтрагент) КАК ПродавецДляПечати,
	|	ВТ_РегистрацияСчетовФактур.КПППродавцаДляПечати КАК КПППродавцаДляПечати,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокументКонтрагент КАК КонтрагентПоСчетуФактуре,
	|	ВТ_РегистрацияСчетовФактур.Валюта,
	|	ВТ_РегистрацияСчетовФактур.ВалютаНаименование,
	|	ВТ_РегистрацияСчетовФактур.ВалютаНаименованиеПолное,
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ВсегоПокупокВВалюте, ВТ_ПокупкиПриВвозеИмпорте.Стоимость) КАК ВсегоПокупокВВалюте,
	|	ВТ_РегистрацияСчетовФактур.ВалютаКод,
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.КодВидаОперации, ВТ_ТаблицаСчетаФактурыДокументы.КодВидаОперации) КАК КодВидаОперации,
	|	ВТ_РегистрацияСчетовФактур.ПосредникСсылка,
	|	ВТ_РегистрацияСчетовФактур.ИННПродавцаДляПечати,
	|	ВТ_РегистрацияСчетовФактур.ПосредникИНН,
	|	ВТ_РегистрацияСчетовФактур.ПосредникКПП
	|ПОМЕСТИТЬ ТаблицаСчетаФактурыДокументы
	|ИЗ
	|	ВТ_ТаблицаСчетаФактурыДокументы КАК ВТ_ТаблицаСчетаФактурыДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РегистрацияСчетовФактур КАК ВТ_РегистрацияСчетовФактур
	|		ПО ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент = ВТ_РегистрацияСчетовФактур.СчетФактура
	|			И ВТ_ТаблицаСчетаФактурыДокументы.ГоловнаяОрганизация = ВТ_РегистрацияСчетовФактур.ГоловнаяОрганизация
	|			И (ВЫБОР
	|				КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный
	|						ИЛИ ВТ_ТаблицаСчетаФактурыДокументы.СводныйКомиссионный
	|					ТОГДА ВТ_ТаблицаСчетаФактурыДокументы.НомерСтроки = ВТ_РегистрацияСчетовФактур.НомерСтроки
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПокупкиПриВвозеИмпорте КАК ВТ_ПокупкиПриВвозеИмпорте
	|		ПО ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент = ВТ_ПокупкиПриВвозеИмпорте.СчетФактура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура,
	|	ДоговорАванса,
	|	СтавкаНДСАванса,
	|	КонтрагентПоСчетуФактуре
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаСчетаФактурыДокументыПредварительная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ОбъединениеСФ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ТаблицаСчетаФактурыДокументы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_РегистрацияСчетовФактур
	|";
	
	Запрос.Выполнить();
	
КонецПроцедуры // ПолучитьСчетаФактурыДокументыКнигаПокупок()

// Процедура ПолучитьСчетаФактурыДокументыКнигаПродаж помещает в менеджер временных таблиц Запроса
// временную таблицу "ТаблицаСчетаФактурыДокументы" с реквизитами счетов-фактур для книги продаж.
//
// Параметры:
//	Запрос - Запрос - Запрос, с которым выполняется работа. У запроса установлен параметр "Организация" со списком организаций.
//		В менеджере временных таблиц существует таблица "ЗаписиКнигиПокупок",
//		по которой отбирать счета-фактуры. В таблице должна присутствовать колонки: 
//		СчетФактура - ДокументСсылка.*.
//		ДоговорАванса - СправочникСсылка.ДоговорыКонтрагентов.
//		СтавкаНДС_Аванс - ПеречислениеСсылка.СтавкиНДС.
//
Процедура ПолучитьСчетаФактурыДокументыКнигаПродаж(Запрос) Экспорт

	// Счета-фактуры выданные, составленные от имени продавца, возникают у комиссионера, в книге не отражаются.
	// Т.к. у счетов-фактур, составленых от имени продавца, и выданных комитенту на вознаграждение один и тот же 
	// документ - основание (отчет комитенту), то необходимо отбирать только счета-фактуры на вознаграждение, 
	// чтобы не задвоились записи при соединении регистра НДС и списка документов.
	//
	// Счета-фактуры полученные, составленные от имени продавца, отражаются в базе комитента и
	// на основании их комитент принимает НДС к вычету, поэтому для счетов-фактур полученных отбор по
	// флагу "Составлен от имени продавца" не должен выполняться.
	// 
	// Счета-фактуры (полученные и выданные) на аванс в базе комиссионера, составленные от имени продавца, 
	// не формируют движения по регистрам НДС, поэтому задвоение данных при соединении регистров с ними не возникает.
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Операция.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА Операция.Исправление
	|			ТОГДА Операция.Ссылка
	|		ИНАЧЕ
	|			Строки.ДокументОснование
	|	КОНЕЦ КАК СчетФактура,
	|	Операция.Номер КАК НомерСчетаФактуры,
	|	Операция.Дата КАК ДатаСчетаФактуры,
	|	Операция.Ссылка КАК СчетФактураДокумент,
	|	ЛОЖЬ КАК НаАванс,
	|	ЛОЖЬ КАК НаСуммовуюРазницу,
	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
	|	NULL КАК Ссылка,
	|	Строки.ДокументОснование.Дата КАК ДатаДокументаОснования,
	|	NULL КАК Контрагент,
	|	ЛОЖЬ КАК ЭтоРозничнаяПродажа,
	|	1 КАК НомерСтроки,
	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
	|	Операция.СводныйКорректировочный КАК СводныйКорректировочный,
	|	ЛОЖЬ КАК СводныйКомиссионный,
	|	"""" КАК КодВидаОперации
	|
	|ПОМЕСТИТЬ ВТ_СчетаФактурыПромежуточная
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Операция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК Строки
	|		ПО Строки.Ссылка = Операция.Ссылка
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.Организация В (&Организация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Организация КАК Организация,
	|	Операция.Ссылка КАК СчетФактура,
	|	Операция.Номер КАК НомерСчетаФактуры,
	|	Операция.Дата КАК ДатаСчетаФактуры,
	|	Операция.Ссылка КАК СчетФактураДокумент,
	|	ЛОЖЬ КАК НаАванс,
	|	ЛОЖЬ КАК НаСуммовуюРазницу,
	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
	|	NULL КАК Ссылка,
	|	Операция.ДокументОснование.Дата КАК ДатаДокументаОснования,
	|	ТаблицаПокупатели.Покупатель КАК Контрагент,
	|	ЛОЖЬ КАК ЭтоРозничнаяПродажа,
	|	ТаблицаПокупатели.НомерСтроки КАК НомерСтроки,
	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
	|	ЛОЖЬ КАК СводныйКорректировочный,
	|	Операция.Сводный КАК СводныйКомиссионный,
	|	"""" КАК КодВидаОперации
	|ИЗ
	|	Документ.СчетФактураКомиссионеру.Покупатели КАК ТаблицаПокупатели
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.СчетФактураКомиссионеру КАК Операция
	|	ПО
	|		ТаблицаПокупатели.Ссылка = Операция.Ссылка
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.Организация В (&Организация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА Операция.Исправление
	|			ТОГДА Операция.Ссылка
	|		ИНАЧЕ
	|			Операция.ДокументОснование
	|	КОНЕЦ КАК СчетФактура,
	|	Операция.Номер КАК НомерСчетаФактуры,
	|	Операция.Дата КАК ДатаСчетаФактуры,
	|	Операция.Ссылка КАК СчетФактураДокумент,
	|	ИСТИНА КАК НаАванс,
	|	ЛОЖЬ КАК НаСуммовуюРазницу,
	|	Строки.СтавкаНДС КАК СтавкаНДСАванса,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
	|	NULL КАК Ссылка,
	|	Операция.ДокументОснование.Дата КАК ДатаДокументаОснования,
	|	Операция.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА Операция.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ИЛИ Операция.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.РозничныйПокупатель)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоРозничнаяПродажа,
	|	1 КАК НомерСтроки,
	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
	|	ЛОЖЬ КАК СводныйКорректировочный,
	|	ЛОЖЬ КАК СводныйКомиссионный,
	|	"""" КАК КодВидаОперации
	|ИЗ
	|	Документ.СчетФактураВыданныйАванс КАК Операция
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Документ.СчетФактураВыданныйАванс.Авансы КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.Организация В (&Организация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Организация КАК Организация,
	|	Операция.ДокументОснование КАК СчетФактура,
	|	Операция.Номер КАК НомерСчетаФактуры,
	|	Операция.ДатаСоставления КАК ДатаСчетаФактуры,
	|	Операция.Ссылка КАК СчетФактураДокумент,
	|	ИСТИНА КАК НаАванс,
	|	ЛОЖЬ КАК НаСуммовуюРазницу,
	|	Строки.СтавкаНДС КАК СтавкаНДСАванса,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
	|	NULL КАК Ссылка,
	|	Операция.ДокументОснование.Дата КАК ДатаДокументаОснования,
	|	Операция.Контрагент КАК Контрагент,
	|	ЛОЖЬ КАК ЭтоРозничнаяПродажа,
	|	1 КАК НомерСтроки,
	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
	|	ЛОЖЬ КАК СводныйКорректировочный,
	|	ЛОЖЬ КАК СводныйКомиссионный,
	|	"""" КАК КодВидаОперации
	|ИЗ
	|	Документ.СчетФактураПолученныйАванс КАК Операция
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Документ.СчетФактураПолученныйАванс.Авансы КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученныйАванс КАК ОперацияБудущая
	|		ПО Операция.ДокументОснование = ОперацияБудущая.ДокументОснование
	|			И Операция.Контрагент = ОперацияБудущая.Контрагент
	|			И Операция.Дата < ОперацияБудущая.Дата
	|			И ОперацияБудущая.Проведен
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.Организация В (&Организация)
	|	И ОперацияБудущая.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Организация КАК Организация,
	|	Операция.ДокументОснование КАК СчетФактура,
	|	Операция.Номер КАК НомерСчетаФактуры,
	|	Операция.Дата КАК ДатаСчетаФактуры,
	|	Операция.Ссылка КАК СчетФактураДокумент,
	|	ЛОЖЬ КАК НаАванс,
	|	ЛОЖЬ КАК НаСуммовуюРазницу,
	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
	|	ВЫБОР
	|		КОГДА Операция.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) ТОГДА
	|			НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ 
	|			Операция.Договор 
	|	КОНЕЦ КАК ДоговорАванса,
	|	NULL КАК Ссылка,
	|	Операция.ДокументОснование.Дата КАК ДатаДокументаОснования,
	|	NULL,
	|	ЛОЖЬ КАК ЭтоРозничнаяПродажа,
	|	1 КАК НомерСтроки,
	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
	|	ЛОЖЬ КАК СводныйКорректировочный,
	|	ЛОЖЬ КАК СводныйКомиссионный,
	|	"""" КАК КодВидаОперации
	|ИЗ
	|	Документ.СчетФактураНалоговыйАгент КАК Операция
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Документ.СчетФактураНалоговыйАгент.РасшифровкаСуммы КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.Организация В (&Организация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Организация КАК Организация,
	|	Операция.Ссылка КАК СчетФактура,
	|	Операция.Номер КАК НомерСчетаФактуры,
	|	Операция.Дата КАК ДатаСчетаФактуры,
	|	Операция.Ссылка КАК СчетФактураДокумент,
	|	ЛОЖЬ КАК НаАванс,
	|	ЛОЖЬ КАК НаСуммовуюРазницу,
	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
	|	NULL КАК Ссылка,
	|	Операция.ДокументОснование.Дата КАК ДатаДокументаОснования,
	|	NULL,
	|	ЛОЖЬ КАК ЭтоРозничнаяПродажа,
	|	1 КАК НомерСтроки,
	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
	|	ЛОЖЬ КАК СводныйКорректировочный,
	|	ЛОЖЬ КАК СводныйКомиссионный,
	|	"""" КАК КодВидаОперации
	|ИЗ
	|	Документ.СчетФактураНаНеподтвержденнуюРеализацию0 КАК Операция
	|
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.Организация В (&Организация)
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Организация КАК Организация,
	|	Операция.Ссылка КАК СчетФактура,
	|	Операция.Номер КАК НомерСчетаФактуры,
	|	Операция.Дата КАК ДатаСчетаФактуры,
	|	Операция.Ссылка КАК СчетФактураДокумент,
	|	ЛОЖЬ КАК НаАванс,
	|	ЛОЖЬ КАК НаСуммовуюРазницу,
	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
	|	NULL КАК Ссылка,
	|	Операция.Дата КАК ДатаДокументаОснования,
	|	NULL,
	|	ИСТИНА КАК ЭтоРозничнаяПродажа,
	|	1 КАК НомерСтроки,
	|	ИСТИНА КАК ОбрабатыватьНомерДокумента,
	|	ЛОЖЬ КАК СводныйКорректировочный,
	|	ЛОЖЬ КАК СводныйКомиссионный,
	|	"""" КАК КодВидаОперации
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах КАК Операция
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.НалогообложениеНДС <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|	И Операция.Организация В (&Организация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Организация  КАК Организация,
	|	Операция.Ссылка КАК СчетФактура,
	|	Операция.НомерДекларации КАК НомерСчетаФактуры,
	|	Операция.Дата КАК ДатаСчетаФактуры,
	|	Операция.Ссылка КАК СчетФактураДокумент,
	|	ЛОЖЬ КАК НаАванс,
	|	ЛОЖЬ КАК НаСуммовуюРазницу,
	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
	|	NULL КАК Ссылка,
	|	Операция.Дата КАК ДатаДокументаОснования,
	|	NULL,
	|	ЛОЖЬ КАК ЭтоРозничнаяПродажа,
	|	1 КАК НомерСтроки,
	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
	|	ЛОЖЬ КАК СводныйКорректировочный,
	|	ЛОЖЬ КАК СводныйКомиссионный,
	|	"""" КАК КодВидаОперации
	|
	|ИЗ
	|	Документ.ТаможеннаяДекларацияИмпорт КАК Операция
	|
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.Организация В (&Организация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Организация  КАК Организация,
	|	Операция.Ссылка КАК СчетФактура,
	|	Операция.Номер КАК НомерСчетаФактуры,
	|	Операция.Дата КАК ДатаСчетаФактуры,
	|	Операция.Ссылка КАК СчетФактураДокумент,
	|	ЛОЖЬ КАК НаАванс,
	|	ЛОЖЬ КАК НаСуммовуюРазницу,
	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
	|	NULL КАК Ссылка,
	|	Операция.Дата КАК ДатаДокументаОснования,
	|	NULL,
	|	ЛОЖЬ КАК ЭтоРозничнаяПродажа,
	|	1 КАК НомерСтроки,
	|	ИСТИНА КАК ОбрабатыватьНомерДокумента,
	|	ЛОЖЬ КАК СводныйКорректировочный,
	|	ЛОЖЬ КАК СводныйКомиссионный,
	|	"""" КАК КодВидаОперации
	|
	|ИЗ
	|	Документ.ЗаявлениеОВвозеТоваров КАК Операция
	|
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.Организация В (&Организация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Передача.ОрганизацияПолучатель,
	|	ВЫБОР
	|		КОГДА Операция.Исправление
	|			ТОГДА
	|				Операция.Ссылка
	|		ИНАЧЕ
	|			Строки.ДокументОснование
	|	КОНЕЦ,
	|	Операция.Номер КАК НомерСчетаФактуры,
	|	Операция.Дата КАК ДатаСчетаФактуры,
	|	Операция.Ссылка КАК СчетФактураДокумент,
	|	ЛОЖЬ КАК НаАванс,
	|	ЛОЖЬ КАК НаСуммовуюРазницу,
	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
	|	NULL КАК Ссылка,
	|	Строки.ДокументОснование.Дата КАК ДатаДокументаОснования,
	|	NULL,
	|	ЛОЖЬ КАК ЭтоРозничнаяПродажа,
	|	2 КАК НомерСтроки,
	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
	|	ЛОЖЬ КАК СводныйКорректировочный,
	|	ЛОЖЬ КАК СводныйКомиссионный,
	|	"""" КАК КодВидаОперации
	|ИЗ
	|	Документ.СчетФактураВыданный КАК Операция
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК Строки
	|		ПО Строки.Ссылка = Операция.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями КАК Передача
	|		ПО Строки.ДокументОснование = Передача.Ссылка
	|ГДЕ
	|	Операция.Проведен
	|	И НЕ Передача.РасчетыЧерезОтдельногоКонтрагента
	|	И Передача.ОрганизацияПолучатель В (&Организация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Организация КАК Организация,
	|	Основания.ДокументОснование КАК СчетФактура,
	|	Операция.Номер КАК НомерСчетаФактуры,
	|	Операция.ДатаСоставления КАК ДатаСчетаФактуры,
	|	Операция.Ссылка КАК СчетФактураДокумент,
	|	ЛОЖЬ КАК НаАванс,
	|	ЛОЖЬ КАК НаСуммовуюРазницу,
	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
	|	NULL КАК Ссылка,
	|	Основания.ДокументОснование.Дата КАК ДатаДокументаОснования,
	|	NULL,
	|	ЛОЖЬ КАК ЭтоРозничнаяПродажа,
	|	1 КАК НомерСтроки,
	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
	|	Операция.СводныйКорректировочный КАК СводныйКорректировочный,
	|	ЛОЖЬ КАК СводныйКомиссионный,
	|	Операция.КодВидаОперацииНаУменьшение КАК КодВидаОперации
	|ИЗ
	|	Документ.СчетФактураПолученный.ДокументыОснования КАК Основания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК Операция
	|		ПО Основания.Ссылка = Операция.Ссылка
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.Организация В (&Организация)
	|	И ТИПЗНАЧЕНИЯ(Основания.ДокументОснование) <> ТИП(Документ.КорректировкаРеализации)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Организация КАК Организация,
	|	Операция.Ссылка КАК СчетФактура,
	|	Операция.Номер КАК НомерСчетаФактуры,
	|	Операция.ДатаСоставления КАК ДатаСчетаФактуры,
	|	Операция.Ссылка КАК СчетФактураДокумент,
	|	ЛОЖЬ КАК НаАванс,
	|	ЛОЖЬ КАК НаСуммовуюРазницу,
	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
	|	NULL КАК Ссылка,
	|	Основания.ДокументОснование.Дата КАК ДатаДокументаОснования,
	|	NULL,
	|	ЛОЖЬ КАК ЭтоРозничнаяПродажа,
	|	1 КАК НомерСтроки,
	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
	|	Операция.СводныйКорректировочный КАК СводныйКорректировочный,
	|	ЛОЖЬ КАК СводныйКомиссионный,
	|	Операция.КодВидаОперацииНаУменьшение КАК КодВидаОперации
	|ИЗ
	|	Документ.СчетФактураПолученный.ДокументыОснования КАК Основания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК Операция
	|		ПО Основания.Ссылка = Операция.Ссылка
	|
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.Организация В (&Организация)
	|	И ТИПЗНАЧЕНИЯ(Основания.ДокументОснование) <> ТИП(Документ.КорректировкаРеализации)
	|	И Операция.Исправление
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Операция.Организация КАК Организация,
	|	Операция.Ссылка КАК СчетФактура,
	|	ВЫБОР 
	|		КОГДА Операция.ПредъявленСчетФактура 
	|				И Операция.ДатаПолучения <> ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА Операция.НомерСчетаФактуры
	|		ИНАЧЕ Операция.Номер
	|	КОНЕЦ КАК НомерСчетаФактуры,
	|	ВЫБОР 
	|		КОГДА Операция.ПредъявленСчетФактура 
	|				И Операция.ДатаПолучения <> ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА Операция.ДатаСчетаФактуры
	|		ИНАЧЕ Операция.Дата
	|	КОНЕЦ КАК ДатаСчетаФактуры,
	|	Операция.Ссылка КАК СчетФактураДокумент,
	|	ЛОЖЬ КАК НаАванс,
	|	ЛОЖЬ КАК НаСуммовуюРазницу,
	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
	|	NULL КАК Ссылка,
	|	Операция.Дата КАК ДатаДокументаОснования,
	|	NULL,
	|	ЛОЖЬ КАК ЭтоРозничнаяПродажа,
	|	1 КАК НомерСтроки,
	|	ЛОЖЬ КАК ОбрабатыватьНомерДокумента,
	|	ЛОЖЬ КАК СводныйКорректировочный,
	|	ЛОЖЬ КАК СводныйКомиссионный,
	|	"""" КАК КодВидаОперации
	|ИЗ
	|	Документ.ЗаписьКнигиПокупок КАК Операция
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.Организация В (&Организация)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура,
	|	СтавкаНДСАванса,
	|	ДоговорАванса,
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаписиКнигиПродаж.СчетФактура КАК СчетФактура,
	|	ЗаписиКнигиПродаж.ДокументОплаты КАК ДокументОплаты,
	|	ЗаписиКнигиПродаж.Организация КАК Организация,
	|	СчетаФактурыДокументы.ДатаСчетаФактуры КАК ДатаСчетаФактуры,
	|	СчетаФактурыДокументы.НомерСчетаФактуры КАК НомерСчетаФактуры,
	|	СчетаФактурыДокументы.СчетФактураДокумент КАК СчетФактураДокумент,
	|	ЗаписиКнигиПродаж.ДоговорАванса КАК ДоговорАванса,
	|	ЗаписиКнигиПродаж.СтавкаНДС_Аванс КАК СтавкаНДСАванса,
	|	СчетаФактурыДокументы.Ссылка КАК Ссылка,
	|	СчетаФактурыДокументы.НомерСтроки КАК НомерСтроки,
	|	СчетаФактурыДокументы.СводныйКорректировочный КАК СводныйКорректировочный,
	|	ЗаписиКнигиПродаж.КонтрагентПоСчетуФактуре КАК КонтрагентПоСчетуФактуре,
	|	СчетаФактурыДокументы.СводныйКомиссионный КАК СводныйКомиссионный,
	|	ВЫБОР
	|		КОГДА СчетаФактурыДокументы.СчетФактура ЕСТЬ NULL 
	|				ИЛИ СчетаФактурыДокументы.ЭтоРозничнаяПродажа
	|			ТОГДА ВЫБОР
	|					КОГДА &КонецПериода >= ДАТАВРЕМЯ(2015, 1, 1)
	|						ТОГДА ""26""
	|					ИНАЧЕ ""01""
	|				КОНЕЦ
	|		КОГДА &КонецПериода >= ДАТАВРЕМЯ(2015, 1, 1)
	|				И СчетаФактурыДокументы.КодВидаОперации <> """"
	|			ТОГДА СчетаФактурыДокументы.КодВидаОперации
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодВидаОперации,
	|	СчетаФактурыДокументы.ДатаДокументаОснования КАК ДатаДокументаОснования,
	|	СчетаФактурыДокументы.ЭтоРозничнаяПродажа КАК ЭтоРозничнаяПродажа,
	|	СчетаФактурыДокументы.ОбрабатыватьНомерДокумента
	|ПОМЕСТИТЬ ВТ_ЗаписиКнигиПродажПоДокументуОснования
	|ИЗ
	|	ЗаписиКнигиПродаж КАК ЗаписиКнигиПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаФактурыПромежуточная КАК СчетаФактурыДокументы
	|		ПО (ЗаписиКнигиПродаж.КонтрагентПоСчетуФактуре = ЕСТЬNULL(СчетаФактурыДокументы.Контрагент, ЗаписиКнигиПродаж.КонтрагентПоСчетуФактуре))
	|			И ЗаписиКнигиПродаж.СтавкаНДС_Аванс = СчетаФактурыДокументы.СтавкаНДСАванса
	|			И ЗаписиКнигиПродаж.ДоговорАванса = СчетаФактурыДокументы.ДоговорАванса
	|			И ЗаписиКнигиПродаж.СчетФактура = СчетаФактурыДокументы.СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаписиКнигиПродаж.СчетФактура КАК СчетФактура,
	|	ЗаписиКнигиПродаж.ДокументОплаты КАК ДокументОплаты,
	|	ЗаписиКнигиПродаж.Организация КАК Организация,
	|	ЗаписиКнигиПродаж.ДатаСчетаФактуры КАК ДатаСчетаФактуры,
	|	ЗаписиКнигиПродаж.НомерСчетаФактуры КАК НомерСчетаФактуры,
	|	ЗаписиКнигиПродаж.СчетФактураДокумент КАК СчетФактураДокумент,
	|	ЗаписиКнигиПродаж.ДоговорАванса КАК ДоговорАванса,
	|	ЗаписиКнигиПродаж.СтавкаНДСАванса КАК СтавкаНДСАванса,
	|	ЗаписиКнигиПродаж.Ссылка КАК Ссылка,
	|	ЗаписиКнигиПродаж.НомерСтроки КАК НомерСтроки,
	|	ЗаписиКнигиПродаж.СводныйКорректировочный КАК СводныйКорректировочный,
	|	ЗаписиКнигиПродаж.КонтрагентПоСчетуФактуре КАК КонтрагентПоСчетуФактуре,
	|	ЗаписиКнигиПродаж.СводныйКомиссионный КАК СводныйКомиссионный,
	|	ЗаписиКнигиПродаж.КодВидаОперации КАК КодВидаОперации,
	|	ЗаписиКнигиПродаж.ДатаДокументаОснования КАК ДатаДокументаОснования,
	|	ЗаписиКнигиПродаж.ЭтоРозничнаяПродажа КАК ЭтоРозничнаяПродажа,
	|	ЗаписиКнигиПродаж.ОбрабатыватьНомерДокумента КАК ОбрабатыватьНомерДокумента
	|ПОМЕСТИТЬ ВТ_ЗаписиКнигиПродажПоДокументуОснованияБезСчетаФактуры
	|ИЗ
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснования КАК ЗаписиКнигиПродаж
	|ГДЕ
	|	ЗаписиКнигиПродаж.СчетФактураДокумент ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОплаты,
	|	ДоговорАванса,
	|	СтавкаНДСАванса,
	|	КонтрагентПоСчетуФактуре
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаписиКнигиПродаж.СчетФактура КАК СчетФактура,
	|	ЗаписиКнигиПродаж.Организация КАК Организация,
	|	СчетаФактурыДокументы.ДатаСчетаФактуры КАК ДатаСчетаФактуры,
	|	СчетаФактурыДокументы.НомерСчетаФактуры КАК НомерСчетаФактуры,
	|	СчетаФактурыДокументы.СчетФактураДокумент КАК СчетФактураДокумент,
	|	ЗаписиКнигиПродаж.ДоговорАванса КАК ДоговорАванса,
	|	ЗаписиКнигиПродаж.СтавкаНДСАванса КАК СтавкаНДСАванса,
	|	СчетаФактурыДокументы.Ссылка КАК Ссылка,
	|	СчетаФактурыДокументы.НомерСтроки КАК НомерСтроки,
	|	СчетаФактурыДокументы.СводныйКорректировочный КАК СводныйКорректировочный,
	|	ЗаписиКнигиПродаж.КонтрагентПоСчетуФактуре КАК КонтрагентПоСчетуФактуре,
	|	СчетаФактурыДокументы.СводныйКомиссионный КАК СводныйКомиссионный,
	|	ВЫБОР
	|		КОГДА СчетаФактурыДокументы.СчетФактура ЕСТЬ NULL 
	|			ТОГДА ВЫБОР
	|					КОГДА &КонецПериода >= ДАТАВРЕМЯ(2015, 1, 1)
	|						ТОГДА ""26""
	|					ИНАЧЕ ""01""
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодВидаОперации,
	|	ЕСТЬNULL(ЗаписиКнигиПродаж.ДатаДокументаОснования, СчетаФактурыДокументы.ДатаДокументаОснования) КАК ДатаДокументаОснования,
	|	ЕСТЬNULL(ЗаписиКнигиПродаж.ЭтоРозничнаяПродажа, СчетаФактурыДокументы.ЭтоРозничнаяПродажа) КАК ЭтоРозничнаяПродажа,
	|	ЕСТЬNULL(ЗаписиКнигиПродаж.ОбрабатыватьНомерДокумента, СчетаФактурыДокументы.ОбрабатыватьНомерДокумента) КАК ОбрабатыватьНомерДокумента
	|ПОМЕСТИТЬ ВТ_ЗаписиКнигиПродажПоДокументуОплаты
	|ИЗ
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснованияБезСчетаФактуры КАК ЗаписиКнигиПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаФактурыПромежуточная КАК СчетаФактурыДокументы
	|		ПО ЗаписиКнигиПродаж.СтавкаНДСАванса = СчетаФактурыДокументы.СтавкаНДСАванса
	|			И (ЗаписиКнигиПродаж.КонтрагентПоСчетуФактуре = ЕСТЬNULL(СчетаФактурыДокументы.Контрагент, ЗаписиКнигиПродаж.КонтрагентПоСчетуФактуре))
	|			И ЗаписиКнигиПродаж.ДоговорАванса = СчетаФактурыДокументы.ДоговорАванса
	|			И ЗаписиКнигиПродаж.ДокументОплаты = СчетаФактурыДокументы.СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЗаписиКнигиПродажПоДокументуОснованияБезСчетаФактуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаписиКнигиПродаж.СчетФактура КАК СчетФактура,
	|	ЗаписиКнигиПродаж.Организация КАК Организация,
	|	ЗаписиКнигиПродаж.ДатаСчетаФактуры КАК ДатаСчетаФактуры,
	|	ЗаписиКнигиПродаж.НомерСчетаФактуры КАК НомерСчетаФактуры,
	|	ЗаписиКнигиПродаж.СчетФактураДокумент КАК СчетФактураДокумент,
	|	ЗаписиКнигиПродаж.ДоговорАванса КАК ДоговорАванса,
	|	ЗаписиКнигиПродаж.СтавкаНДСАванса КАК СтавкаНДСАванса,
	|	ЗаписиКнигиПродаж.Ссылка КАК Ссылка,
	|	ЗаписиКнигиПродаж.НомерСтроки КАК НомерСтроки,
	|	ЗаписиКнигиПродаж.НомерСтроки КАК СводныйКорректировочный,
	|	ЗаписиКнигиПродаж.КонтрагентПоСчетуФактуре КАК КонтрагентПоСчетуФактуре,
	|	ЗаписиКнигиПродаж.СводныйКомиссионный КАК СводныйКомиссионный,
	|	ЗаписиКнигиПродаж.КодВидаОперации КАК КодВидаОперации,
	|	ЗаписиКнигиПродаж.ДатаДокументаОснования КАК ДатаДокументаОснования,
	|	ЗаписиКнигиПродаж.ЭтоРозничнаяПродажа КАК ЭтоРозничнаяПродажа,
	|	ЗаписиКнигиПродаж.ОбрабатыватьНомерДокумента КАК ОбрабатыватьНомерДокумента
	|ПОМЕСТИТЬ ВТ_ЗаписиКнигиПродажПоДокументуОплатыБезСчетаФактуры
	|ИЗ
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплаты КАК ЗаписиКнигиПродаж
	|ГДЕ
	|	ЗаписиКнигиПродаж.СчетФактураДокумент ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаписиКнигиПродаж.СчетФактура КАК СчетФактура,
	|	ДанныеПервичныхДокументов.Дата КАК ДатаСчетаФактуры,
	|	ДанныеПервичныхДокументов.Номер КАК НомерСчетаФактуры,
	|	NULL КАК СчетФактураДокумент,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорАванса,
	|	НЕОПРЕДЕЛЕНО КАК СтавкаНДСАванса,
	|	NULL КАК Ссылка,
	|	NULL КАК НомерСтроки,
	|	ЛОЖЬ КАК СводныйКорректировочный,
	|	ЗаписиКнигиПродаж.КонтрагентПоСчетуФактуре КАК КонтрагентПоСчетуФактуре,
	|	ЛОЖЬ КАК СводныйКомиссионный,
	|	ВЫБОР
	|		КОГДА &КонецПериода >= ДАТАВРЕМЯ(2015, 1, 1)
	|			ТОГДА ""26""
	|		ИНАЧЕ ""01""
	|	КОНЕЦ КАК КодВидаОперации,
	|	ЗаписиКнигиПродаж.Организация,
	|	ЕСТЬNULL(ДанныеПервичныхДокументов.Дата, ЗаписиКнигиПродаж.ДатаДокументаОснования) КАК ДатаДокументаОснования,
	|	ЗаписиКнигиПродаж.ЭтоРозничнаяПродажа КАК ЭтоРозничнаяПродажа,
	|	ЗаписиКнигиПродаж.ОбрабатыватьНомерДокумента КАК ОбрабатыватьНомерДокумента
	|ПОМЕСТИТЬ ВТ_ЗаписиКнигиПродажПоДаннымПервичныхДокументов
	|ИЗ
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплатыБезСчетаФактуры КАК ЗаписиКнигиПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|		ПО ЗаписиКнигиПродаж.СчетФактура = ДанныеПервичныхДокументов.Документ
	|			И ЗаписиКнигиПродаж.Организация = ДанныеПервичныхДокументов.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЗаписиКнигиПродажПоДокументуОплатыБезСчетаФактуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснования.СчетФактура КАК СчетФактура,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснования.ДатаСчетаФактуры КАК ДатаСчетаФактуры,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснования.НомерСчетаФактуры КАК НомерСчетаФактуры,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснования.СчетФактураДокумент КАК СчетФактураДокумент,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснования.ДоговорАванса КАК ДоговорАванса,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснования.СтавкаНДСАванса КАК СтавкаНДСАванса,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснования.Ссылка КАК Ссылка,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснования.НомерСтроки КАК НомерСтроки,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснования.СводныйКорректировочный КАК СводныйКорректировочный,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснования.КонтрагентПоСчетуФактуре КАК КонтрагентПоСчетуФактуре,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснования.СводныйКомиссионный КАК СводныйКомиссионный,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснования.КодВидаОперации КАК КодВидаОперации,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснования.Организация КАК Организация,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснования.ДатаДокументаОснования КАК ДатаДокументаОснования,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснования.ЭтоРозничнаяПродажа КАК ЭтоРозничнаяПродажа,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснования.ОбрабатыватьНомерДокумента КАК ОбрабатыватьНомерДокумента
	|ПОМЕСТИТЬ ВТ_ТаблицаСчетаФактурыДокументы
	|ИЗ
	|	ВТ_ЗаписиКнигиПродажПоДокументуОснования КАК ВТ_ЗаписиКнигиПродажПоДокументуОснования
	|ГДЕ
	|	НЕ ВТ_ЗаписиКнигиПродажПоДокументуОснования.СчетФактураДокумент ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплаты.СчетФактура,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплаты.ДатаСчетаФактуры,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплаты.НомерСчетаФактуры,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплаты.СчетФактураДокумент,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплаты.ДоговорАванса,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплаты.СтавкаНДСАванса,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплаты.Ссылка,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплаты.НомерСтроки,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплаты.СводныйКорректировочный,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплаты.КонтрагентПоСчетуФактуре,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплаты.СводныйКомиссионный,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплаты.КодВидаОперации,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплаты.Организация,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплаты.ДатаДокументаОснования КАК ДатаДокументаОснования,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплаты.ЭтоРозничнаяПродажа КАК ЭтоРозничнаяПродажа,
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплаты.ОбрабатыватьНомерДокумента КАК ОбрабатыватьНомерДокумента
	|ИЗ
	|	ВТ_ЗаписиКнигиПродажПоДокументуОплаты КАК ВТ_ЗаписиКнигиПродажПоДокументуОплаты
	|ГДЕ
	|	НЕ ВТ_ЗаписиКнигиПродажПоДокументуОплаты.СчетФактураДокумент ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ЗаписиКнигиПродажПоДаннымПервичныхДокументов.СчетФактура,
	|	ВТ_ЗаписиКнигиПродажПоДаннымПервичныхДокументов.ДатаСчетаФактуры,
	|	ВТ_ЗаписиКнигиПродажПоДаннымПервичныхДокументов.НомерСчетаФактуры,
	|	ВТ_ЗаписиКнигиПродажПоДаннымПервичныхДокументов.СчетФактураДокумент,
	|	ВТ_ЗаписиКнигиПродажПоДаннымПервичныхДокументов.ДоговорАванса,
	|	ВТ_ЗаписиКнигиПродажПоДаннымПервичныхДокументов.СтавкаНДСАванса,
	|	ВТ_ЗаписиКнигиПродажПоДаннымПервичныхДокументов.Ссылка,
	|	ВТ_ЗаписиКнигиПродажПоДаннымПервичныхДокументов.НомерСтроки,
	|	ВТ_ЗаписиКнигиПродажПоДаннымПервичныхДокументов.СводныйКорректировочный,
	|	ВТ_ЗаписиКнигиПродажПоДаннымПервичныхДокументов.КонтрагентПоСчетуФактуре,
	|	ВТ_ЗаписиКнигиПродажПоДаннымПервичныхДокументов.СводныйКомиссионный,
	|	ВТ_ЗаписиКнигиПродажПоДаннымПервичныхДокументов.КодВидаОперации,
	|	ВТ_ЗаписиКнигиПродажПоДаннымПервичныхДокументов.Организация,
	|	ВТ_ЗаписиКнигиПродажПоДаннымПервичныхДокументов.ДатаДокументаОснования КАК ДатаДокументаОснования,
	|	ВТ_ЗаписиКнигиПродажПоДаннымПервичныхДокументов.ЭтоРозничнаяПродажа КАК ЭтоРозничнаяПродажа,
	|	ВТ_ЗаписиКнигиПродажПоДаннымПервичныхДокументов.ОбрабатыватьНомерДокумента КАК ОбрабатыватьНомерДокумента
	|ИЗ
	|	ВТ_ЗаписиКнигиПродажПоДаннымПервичныхДокументов КАК ВТ_ЗаписиКнигиПродажПоДаннымПервичныхДокументов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЖурналУчетаСчетовФактур.Регистратор,
	|	ЖурналУчетаСчетовФактур.СчетФактура КАК СчетФактура,
	|	ЖурналУчетаСчетовФактур.Организация,
	|	ЖурналУчетаСчетовФактур.Контрагент,
	|	ЖурналУчетаСчетовФактур.НомерСчетаФактуры,
	|	ЖурналУчетаСчетовФактур.ДатаСчетаФактуры,
	|	ЖурналУчетаСчетовФактур.НомерКорректировочногоСчетаФактуры,
	|	ЖурналУчетаСчетовФактур.ДатаКорректировочногоСчетаФактуры,
	|	ЖурналУчетаСчетовФактур.НомерИсправления КАК НомерИсправления,
	|	ЖурналУчетаСчетовФактур.ДатаИсправления КАК ДатаИсправления,
	|	ЖурналУчетаСчетовФактур.НомерИсправленияКорректировочногоСчетаФактуры КАК НомерИсправленияКорректировки,
	|	ЖурналУчетаСчетовФактур.ДатаИсправленияКорректировочногоСчетаФактуры КАК ДатаИсправленияКорректировки,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ЖурналУчетаСчетовФактур.Продавец
	|		КОГДА ЖурналУчетаСчетовФактур.Контрагент <> ЖурналУчетаСчетовФактур.Организация
	|			ТОГДА ЖурналУчетаСчетовФактур.Контрагент
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ПродавецДляПечати,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА """"
	|		КОГДА ЖурналУчетаСчетовФактур.Контрагент <> ЖурналУчетаСчетовФактур.Организация
	|			ТОГДА ЖурналУчетаСчетовФактур.КППКонтрагента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КППКонтрагента,
	|	ЖурналУчетаСчетовФактур.ИндексСтроки,
	|	ЖурналУчетаСчетовФактур.НомерСтроки,
	|	ЖурналУчетаСчетовФактур.КодВидаОперации,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.Валюта <> &ВалютаРегУчета
	|			ТОГДА ЖурналУчетаСчетовФактур.Валюта.НаименованиеПолное
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ВалютаНаименование,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.Валюта <> &ВалютаРегУчета
	|			ТОГДА ЖурналУчетаСчетовФактур.Валюта.Код
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ВалютаКод,
	|	ЖурналУчетаСчетовФактур.Валюта.Наименование КАК ВалютаНаименованиеКраткое,
	|	ВЫБОР
	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураПолученный
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураПолученный).Корректировочный
	|						ТОГДА ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуреРазницаУменьшение
	|					ИНАЧЕ ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуре
	|				КОНЕЦ
	|		КОГДА ЖурналУчетаСчетовФактур.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫРАЗИТЬ(ЖурналУчетаСчетовФактур.СчетФактура КАК Документ.СчетФактураВыданный).Корректировочный
	|						ТОГДА ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуреРазницаУвеличение
	|					ИНАЧЕ ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуре
	|				КОНЕЦ
	|		ИНАЧЕ ЖурналУчетаСчетовФактур.СуммаПоСчетуФактуре
	|	КОНЕЦ КАК ВсегоПродажВВалюте,
	|	ЖурналУчетаСчетовФактур.Посредник КАК ПосредникСсылка,
	|	ЖурналУчетаСчетовФактур.Валюта КАК Валюта
	|ПОМЕСТИТЬ ВТ_РегистрацияСчетовФактур
	|ИЗ
	|	РегистрСведений.ЖурналУчетаСчетовФактур КАК ЖурналУчетаСчетовФактур
	|ГДЕ
	|	ЖурналУчетаСчетовФактур.СчетФактура В
	|			(ВЫБРАТЬ
	|				ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент
	|			ИЗ
	|				ВТ_ТаблицаСчетаФактурыДокументы)
	|	И ЖурналУчетаСчетовФактур.Организация В(&Организация)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГТДИмпорт.Ссылка КАК СчетФактура,
	|	СУММА(ГТДИмпорт.ТаможеннаяСтоимость + ГТДИмпорт.СуммаПошлины + ГТДИмпорт.СуммаНДС) КАК Стоимость
	|ПОМЕСТИТЬ ВременнаяТаблицаГТДИмпорт
	|ИЗ
	|	Документ.ТаможеннаяДекларацияИмпорт.Разделы КАК ГТДИмпорт
	|ГДЕ
	|	ГТДИмпорт.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент
	|			ИЗ
	|				ВТ_ТаблицаСчетаФактурыДокументы)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГТДИмпорт.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаСчетаФактурыДокументы.СчетФактура КАК СчетФактура,
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.ДатаСчетаФактуры) КАК ДатаСчетаФактуры,
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.НомерСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры) КАК НомерСчетаФактуры,
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.СчетФактура, ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент) КАК СчетФактураДокумент,
	|	ВТ_ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры КАК НомерСчетаФактурыСортировка,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаИсправления, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаИсправления
	|		ИНАЧЕ ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.ДатаСчетаФактуры)
	|	КОНЕЦ КАК ДатаСчетаФактурыСортировка,
	|	ВТ_ТаблицаСчетаФактурыДокументы.ДоговорАванса КАК ДоговорАванса,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СтавкаНДСАванса КАК СтавкаНДСАванса,
	|	ВТ_РегистрацияСчетовФактур.НомерКорректировочногоСчетаФактуры КАК НомерКорректировки,
	|	ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры КАК ДатаКорректировки,
	|	ВТ_РегистрацияСчетовФактур.НомерИсправления КАК НомерИсправления,
	|	ВТ_РегистрацияСчетовФактур.ДатаИсправления КАК ДатаИсправления,
	|	ВТ_РегистрацияСчетовФактур.НомерИсправленияКорректировки КАК НомерИсправленияКорректировки,
	|	ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки КАК ДатаИсправленияКорректировки,
	|	ВТ_РегистрацияСчетовФактур.ПродавецДляПечати,
	|	ВТ_РегистрацияСчетовФактур.КППКонтрагента КАК КППКонтрагента,
	|	ВЫБОР
	|		КОГДА ВТ_РегистрацияСчетовФактур.СчетФактура ЕСТЬ NULL 
	|			ТОГДА ВТ_ТаблицаСчетаФактурыДокументы.ОбрабатыватьНомерДокумента
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОбрабатыватьНомерДокумента,
	|	ВТ_ТаблицаСчетаФактурыДокументы.ДатаДокументаОснования,
	|	ВТ_ТаблицаСчетаФактурыДокументы.ЭтоРозничнаяПродажа,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный,
	|	ВТ_ТаблицаСчетаФактурыДокументы.КонтрагентПоСчетуФактуре КАК КонтрагентПоСчетуФактуре,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.КодВидаОперации = """"
	|			ТОГДА ВТ_РегистрацияСчетовФактур.КодВидаОперации
	|		ИНАЧЕ ВТ_ТаблицаСчетаФактурыДокументы.КодВидаОперации
	|	КОНЕЦ КАК КодВидаОперации,
	|	ВТ_РегистрацияСчетовФактур.ВалютаКод,
	|	СУММА(ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ВсегоПродажВВалюте, ВременнаяТаблицаГТДИмпорт.Стоимость)) КАК ВсегоПродажВВалюте,
	|	ВТ_РегистрацияСчетовФактур.ПосредникСсылка,
	|	ВТ_РегистрацияСчетовФактур.Валюта,
	|	ВТ_РегистрацияСчетовФактур.ВалютаНаименование,
	|	ВТ_РегистрацияСчетовФактур.ВалютаНаименованиеКраткое,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СводныйКомиссионный
	|ПОМЕСТИТЬ ТаблицаСчетаФактурыДокументы
	|ИЗ
	|	ВТ_ТаблицаСчетаФактурыДокументы КАК ВТ_ТаблицаСчетаФактурыДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РегистрацияСчетовФактур КАК ВТ_РегистрацияСчетовФактур
	|		ПО ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент = ВТ_РегистрацияСчетовФактур.СчетФактура
	|			И (ВЫБОР
	|				КОГДА ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный
	|						ИЛИ ВТ_ТаблицаСчетаФактурыДокументы.СводныйКомиссионный
	|					ТОГДА ВТ_ТаблицаСчетаФактурыДокументы.НомерСтроки = ВТ_РегистрацияСчетовФактур.НомерСтроки
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаГТДИмпорт КАК ВременнаяТаблицаГТДИмпорт
	|		ПО ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент = ВременнаяТаблицаГТДИмпорт.СчетФактура
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РегистрацияСчетовФактур.КППКонтрагента,
	|	ВТ_ТаблицаСчетаФактурыДокументы.ДоговорАванса,
	|	ВТ_РегистрацияСчетовФактур.НомерКорректировочногоСчетаФактуры,
	|	ВТ_ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры,
	|	ВТ_ТаблицаСчетаФактурыДокументы.КонтрагентПоСчетуФактуре,
	|	ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки,
	|	ВТ_РегистрацияСчетовФактур.Валюта,
	|	ВТ_РегистрацияСчетовФактур.ВалютаКод,
	|	ВТ_РегистрацияСчетовФактур.ВалютаНаименованиеКраткое,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СводныйКомиссионный,
	|	ВТ_РегистрацияСчетовФактур.НомерИсправления,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СчетФактура,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СтавкаНДСАванса,
	|	ВТ_РегистрацияСчетовФактур.ПосредникСсылка,
	|	ВТ_РегистрацияСчетовФактур.ВалютаНаименование,
	|	ВТ_РегистрацияСчетовФактур.ДатаИсправления,
	|	ВТ_ТаблицаСчетаФактурыДокументы.СводныйКорректировочный,
	|	ВТ_РегистрацияСчетовФактур.ПродавецДляПечати,
	|	ВТ_РегистрацияСчетовФактур.НомерИсправленияКорректировки,
	|	ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры,
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.ДатаСчетаФактуры),
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.НомерСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.НомерСчетаФактуры),
	|	ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.СчетФактура, ВТ_ТаблицаСчетаФактурыДокументы.СчетФактураДокумент),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаИсправленияКорректировки
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаКорректировочногоСчетаФактуры
	|		КОГДА ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаИсправления, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВТ_РегистрацияСчетовФактур.ДатаИсправления
	|		ИНАЧЕ ЕСТЬNULL(ВТ_РегистрацияСчетовФактур.ДатаСчетаФактуры, ВТ_ТаблицаСчетаФактурыДокументы.ДатаСчетаФактуры)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТ_РегистрацияСчетовФактур.СчетФактура ЕСТЬ NULL 
	|			ТОГДА ВТ_ТаблицаСчетаФактурыДокументы.ОбрабатыватьНомерДокумента
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТ_ТаблицаСчетаФактурыДокументы.КодВидаОперации = """"
	|			ТОГДА ВТ_РегистрацияСчетовФактур.КодВидаОперации
	|		ИНАЧЕ ВТ_ТаблицаСчетаФактурыДокументы.КодВидаОперации
	|	КОНЕЦ,
	|	ВТ_ТаблицаСчетаФактурыДокументы.ДатаДокументаОснования,
	|	ВТ_ТаблицаСчетаФактурыДокументы.ЭтоРозничнаяПродажа
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура,
	|	ДоговорАванса,
	|	СтавкаНДСАванса,
	|	КонтрагентПоСчетуФактуре";
	
	Запрос.Выполнить();
	
КонецПроцедуры // ПолучитьСчетаФактурыДокументыКнигаПродаж()

#КонецОбласти

#Область ФормированиеОтчетовПоНдс

// Функция возвращает ИСТИНА, если из отчетов НДС необходимо открывать помощник.
//
// Параметры:
//	Организация - СправочникСсылка.Организации - Организация по которой строится отчет.
//	Период - Дата - Дата налогового периода, за который строится отчет.
//
// Возвращаемое значение:
//	Булево - Признак необходимости открытия помощника.
//
Функция ОткрыватьПомощникИзМакета(Организация, Период) Экспорт

    Возврат Ложь;
	
КонецФункции

// Функция возвращает макет для помощника по НДС.
//
// Параметры:
//	Организация - СправочникСсылка.Организации - Организация по которой строится отчет.
//	Период - Дата - Дата налогового периода, за который строится отчет.
//
// Возвращаемое значение:
//	ТабличныйДокумент - Табличный документ с макетом.
//
Функция ПолучитьМакетОткрытияПомощника(Организация, Период) Экспорт

	// В БРУ нет помощника по учету НДС
	ТабДокумент = Новый ТабличныйДокумент;

	Возврат ТабДокумент;

КонецФункции

#КонецОбласти

#Область РаботаСКнигамиПокупокИПродаж

// Формирует книгу покупок внутри фонового задания.
//
// Параметры:
//	ПараметрыОтчета - Структура - Структура параметров фонового задания,
//						см. ПодготовитьПараметрыОтчета() в отчете книга покупок.
//	АдресХранилища - Строка - Адрес временного хранилища, в которое поместить результат отчета.
//
Процедура ПодготовитьПараметрыКнигиПокупок(ПараметрыОтчета, АдресХранилища) Экспорт
	
	Отчеты.КнигаПокупок.СформироватьОтчет(ПараметрыОтчета, АдресХранилища);	
	
КонецПроцедуры

// Формирует книгу продаж внутри фонового задания.
//
// Параметры:
//	ПараметрыОтчета - Структура - Структура параметров фонового задания, 
//						см. ПодготовитьПараметрыОтчета() в отчете книга продаж.
//	АдресХранилища - Строка - Адрес временного хранилища, в которое поместить результат отчета.
//
Процедура ПодготовитьПараметрыКнигиПродаж(ПараметрыОтчета, АдресХранилища) Экспорт
	
	Отчеты.КнигаПродаж.СформироватьОтчет(ПараметрыОтчета, АдресХранилища);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСЖурналомУчетаСчетовФактур

// Формирует журнал учета счетов-фактур внутри фонового задания.
//
// Параметры:
//	ПараметрыОтчета - Структура - Структура параметров фонового задания, 
//						см. ПодготовитьПараметрыОтчета() в журнале учета счетов-фактур.
//	АдресХранилища - Строка - Адрес временного хранилища, в которое поместить результат отчета.
//
Процедура ПодготовитьПараметрыЖурналаУчетаСчетовФактур (ПараметрыОтчета, АдресХранилища) Экспорт
	
	Отчеты.ЖурналУчетаСчетовФактур.СформироватьОтчет(ПараметрыОтчета, АдресХранилища);
	
КонецПроцедуры

#КонецОбласти

#Область СведенияОЮридическихИФизическихЛицах

// Процедура подготавливает в менеджере временных таблиц таблицу
// сведениями о переданных контрагента и организациях на указанные даты.
//
// Параметры:
//	МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер, в который помещается таблицы.
//		На входе содержит таблицу СсылкиНаДаты с колонками:
//			* Ссылка - СправочникСсылка.Контрагенты, СправочникСсылка.Организации - контрагент или организация,
//						для которых требуется получить сведения.
//			* ДатаСведений - Дата - Дата, на которую необходимо получить данные.
//
//		На выходе содержит таблицу СведенияОСсылкахНаДаты с колонками:
//			* Ссылка - СправочникСсылка.Контрагенты, СправочникСсылка.Организации - контрагент или организация.
//			* ДатаСведений - Дата - Дата, на которую получены данные.
//			* Наименование - Строка - Наименование контрагента или организации для вывода в отчете.
//			* ИНН - Строка - ИНН контрагента или организации.
//			* КПП - Строка - КПП контрагента или организации.
//
Процедура РегистрационныеСведенияНаДаты(МенеджерВременныхТаблиц) Экспорт
	
	// Запрос требует обязательного наличия в МенеджерВременныхТаблиц таблицы с именем
	// СсылкиНаДаты с колонками Ссылка, ДатаСведений.
	// Результатом является временная таблица СведенияОСсылкахНаДаты.
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДатыСведенийОКонтрагентах.Ссылка КАК Ссылка,
	|	ДатыСведенийОКонтрагентах.ДатаСведений КАК ДатаСведений,
	|	ВЫБОР
	|		КОГДА Контрагенты.ОбособленноеПодразделение
	|				И Контрагенты.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА ВЫБОР
	|					КОГДА ПОДСТРОКА(ГоловныеКонтрагенты.НаименованиеПолное, 1, 250) = """"
	|						ТОГДА ГоловныеКонтрагенты.Наименование
	|					ИНАЧЕ ГоловныеКонтрагенты.НаименованиеПолное
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПОДСТРОКА(Контрагенты.НаименованиеПолное, 1, 250) = """"
	|					ТОГДА Контрагенты.Наименование
	|				ИНАЧЕ Контрагенты.НаименованиеПолное
	|			КОНЕЦ
	|	КОНЕЦ КАК Наименование,
	|	ВЫБОР КОГДА Контрагенты.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия) 
	|		ТОГДА Контрагенты.ИНН
	|		ИНАЧЕ """" 
	|	КОНЕЦ КАК ИНН,
	|	ВЫБОР КОГДА Контрагенты.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия) 
	|		ТОГДА Контрагенты.КПП
	|		ИНАЧЕ """" 
	|	КОНЕЦ КАК КПП
	|ПОМЕСТИТЬ СведенияОКонтрагентахНаДаты
	|ИЗ
	|	СсылкиНаДаты КАК ДатыСведенийОКонтрагентах
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДатыСведенийОКонтрагентах.Ссылка = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК ГоловныеКонтрагенты
	|		ПО (Контрагенты.ГоловнойКонтрагент = ГоловныеКонтрагенты.Ссылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыСведенийОбОрганизациях.Ссылка КАК Ссылка,
	|	ДатыСведенийОбОрганизациях.ДатаСведений КАК ДатаСведений,
	|	ВЫБОР
	|		КОГДА Организации.ОбособленноеПодразделение
	|			ТОГДА Организации.ГоловнаяОрганизация.НаименованиеПолное
	|		ИНАЧЕ Организации.НаименованиеПолное
	|	КОНЕЦ КАК Наименование,
	|	Организации.ИНН КАК ИНН,
	|	Организации.КПП КАК КПП
	|ПОМЕСТИТЬ СведенияОбОрганизацияхНаДаты
	|ИЗ
	|	СсылкиНаДаты КАК ДатыСведенийОбОрганизациях
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ДатыСведенийОбОрганизациях.Ссылка = Организации.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СсылкиНаДаты.Ссылка КАК Ссылка,
	|	СсылкиНаДаты.ДатаСведений КАК ДатаСведений,
	|	ЕСТЬNULL(СведенияОКонтрагентахНаДаты.Наименование, СведенияОбОрганизацияхНаДаты.Наименование) КАК Наименование,
	|	ЕСТЬNULL(СведенияОКонтрагентахНаДаты.ИНН, СведенияОбОрганизацияхНаДаты.ИНН) КАК ИНН,
	|	ЕСТЬNULL(СведенияОКонтрагентахНаДаты.КПП, СведенияОбОрганизацияхНаДаты.КПП) КАК КПП
	|ПОМЕСТИТЬ СведенияОСсылкахНаДаты
	|ИЗ
	|	СсылкиНаДаты КАК СсылкиНаДаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ СведенияОКонтрагентахНаДаты КАК СведенияОКонтрагентахНаДаты
	|		ПО СсылкиНаДаты.Ссылка = СведенияОКонтрагентахНаДаты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СведенияОбОрганизацияхНаДаты КАК СведенияОбОрганизацияхНаДаты
	|		ПО СсылкиНаДаты.Ссылка = СведенияОбОрганизацияхНаДаты.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	ДатаСведений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СведенияОКонтрагентахНаДаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СведенияОбОрганизацияхНаДаты";
	
	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти 

#Область Прочее

// Получает пакет электронных представлений документов.
//
// Параметры:
//  ВыгружаемыеДокументы - Массив - перечень документов, для которых
//                 необходимо получить электронные представления в виде двоичных данных.
//  УникальныйИдентификатор - УникальныйИдентификатор - уникальный идентификатор, по которому
//                 осуществляется привязка двоичных данных во временном хранилище.
//
// Возвращаемое значение:
//   Соответствие - сответствие переданных ссылок на документы и массива структур с полями:
//                 ТипФайла - Строка - описание типа файла;
//                 ИмяФайла - Строка - имя файла с расширением;
//                 АдресВременногоХранилища - Строка - адрес временного хранилища, в котором размещены двоичные данные файла.
//
Функция СформироватьЭлектронныеДокументы(ВыгружаемыеДокументы, УникальныйИдентификатор = Неопределено) Экспорт
	
	Если УникальныйИдентификатор = Неопределено Тогда
		УникальныйИдентификатор = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	Результат = Новый Соответствие;
	
	Для Каждого ВыгружаемыйДокумент Из ВыгружаемыеДокументы Цикл
		
		ЭтоДокументРегистраУчетаНДС = (ВыгружаемыйДокумент.Метаданные().Имя = "КнигаПокупокДляПередачиВЭлектронномВиде"
		                           ИЛИ ВыгружаемыйДокумент.Метаданные().Имя = "КнигаПродажДляПередачиВЭлектронномВиде"
		                           ИЛИ ВыгружаемыйДокумент.Метаданные().Имя = "ДопЛистКнигиПокупокДляПередачиВЭлектронномВиде"
		                           ИЛИ ВыгружаемыйДокумент.Метаданные().Имя = "ДопЛистКнигиПродажДляПередачиВЭлектронномВиде"
		                           ИЛИ ВыгружаемыйДокумент.Метаданные().Имя = "ЖурналУчетаСчетовФактурДляПередачиВЭлектронномВиде");
		Если ЭтоДокументРегистраУчетаНДС Тогда
			ОбъектВыгрузки = ВыгружаемыйДокумент.ПолучитьОбъект();
			ФайлыВыгрузки = ОбъектВыгрузки.ВыгрузитьДокумент(УникальныйИдентификатор);
			
			МассивВыгрузки = Новый Массив;
			Для Каждого ФайлВыгрузки Из ФайлыВыгрузки Цикл
				
				ЭлементВыгрузки = Новый Структура;
				ЭлементВыгрузки.Вставить("ТипФайла", "ФайлВыгрузки");
				ЭлементВыгрузки.Вставить("ИмяФайла", ФайлВыгрузки.ИмяФайлаВыгрузки);
				ЭлементВыгрузки.Вставить("АдресВременногоХранилища", ФайлВыгрузки.АдресФайлаВыгрузки);
				
				МассивВыгрузки.Добавить(ЭлементВыгрузки);
			КонецЦикла;
			
			Результат.Вставить(ВыгружаемыйДокумент, МассивВыгрузки);
			
		Иначе
			Результат.Вставить(ВыгружаемыйДокумент, Неопределено);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Заполняет список доступных ставок НДС.
//
// Параметры:
//	СписокВыбора - СписокЗначений - Список, который необходимо заполнить.
//	НДСпоСтавкам4и2 - Булево - Истина, если контрагент предъявляет НДС по ставкам 4 и 2%.
//	БезДробных - Булево - Исина, если не требуется включать расчетные ставки.
//
Процедура ЗаполнитьСписокВыбораСтавокНДС(СписокВыбора, НДСпоСтавкам4и2, БезДробных = Ложь) Экспорт
	
	СписокВыбора.Очистить();
	СписокВыбора.Добавить(Перечисления.СтавкиНДС.НДС18,	 ?(НДСпоСтавкам4и2, НСтр("ru = '4%'"), НСтр("ru = '18%'")));
	СписокВыбора.Добавить(Перечисления.СтавкиНДС.НДС10,	 ?(НДСпоСтавкам4и2, НСтр("ru = '2%'"), НСтр("ru = '10%'")));
	СписокВыбора.Добавить(Перечисления.СтавкиНДС.НДС0,	 НСтр("ru = '0%'"));
	СписокВыбора.Добавить(Перечисления.СтавкиНДС.БезНДС, НСтр("ru = 'Без НДС'"));
	Если Не БезДробных Тогда
		СписокВыбора.Вставить(1, Перечисления.СтавкиНДС.НДС18_118, ?(НДСпоСтавкам4и2, НСтр("ru = '4/104'"), НСтр("ru = '18/118'")));
		СписокВыбора.Вставить(3, Перечисления.СтавкиНДС.НДС10_110, ?(НДСпоСтавкам4и2, НСтр("ru = '2/102'"), НСтр("ru = '10/110'")));
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает условное оформление для элемента формы со ставкой НДС.
//
// Параметры:
//	УсловноеОформление - УсловноеОформлениеКомпоновкиДанных - Условное оформление формы.
//	СтавкаНДС - ПолеФормы - Поле формы, для которого установить условное оформление.
//
Процедура УстановитьУсловноеОформлениеДляНДСпоСтавкам4и2(УсловноеОформление, СтавкаНДС) Экспорт
	
	СтавкиНДС = Новый Соответствие;
	СтавкиНДС.Вставить(Перечисления.СтавкиНДС.НДС18,		НСтр("ru = '4%'"));
	СтавкиНДС.Вставить(Перечисления.СтавкиНДС.НДС18_118,	НСтр("ru = '4/104'"));
	СтавкиНДС.Вставить(Перечисления.СтавкиНДС.НДС10,		НСтр("ru = '2%'"));
	СтавкиНДС.Вставить(Перечисления.СтавкиНДС.НДС10_110,	НСтр("ru = '2/102'"));
	
	Для Каждого ЗнСтавки Из СтавкиНДС Цикл
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(СтавкаНДС.Имя);
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтавкаНДС.ПутьКДанным);
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = ЗнСтавки.Ключ;
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НДСпоСтавкам4и2");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;
		
		Элемент.Оформление.УстановитьЗначениеПараметра("Текст", ЗнСтавки.Значение);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

