
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Для выбора доступны только те значения перечисления, которые поддерживаются в механизме закрытия месяца.
	// см. использование функции ЗакрытиеМесяцаСервер.ПроверитьНаличиеЗаданийКЗакрытиюМесяца()
	ДанныеВыбора = Новый СписокЗначений;
	
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.ПереоценкаДенежныхСредствКредитовДепозитовЗаймов);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.РаспределениеНДС);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.СторноДоходовКУДиРПоЕНВД);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.ПризнаниеРасходовПриУСН);
	ДанныеВыбора.Добавить(Перечисления.ОперацииЗакрытияМесяца.РасчетНалогаУСН);
	
КонецПроцедуры

#КонецОбласти
