
#Область ПрограммныйИнтерфейс

// Возвращает адрес таблицы акцизных марки во временном хранилище
//
// Параметры:
//  Форма				 - УправляемаяФорма - Форма
//  ИдентификаторСтроки	 - Строка - Идентификатор строки
// 
// Возвращаемое значение:
//  Строка - Адрес во временном хранилище
//
Функция АдресТаблицыАкцизныхМаркиВоВременномХранилище(Форма, ИдентификаторСтроки) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект") Тогда
		Источник = Форма.Объект;
	Иначе
		Источник = Форма;
	КонецЕсли;
	
	Отбор = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
	
	АкцизныеМарки = Источник.АкцизныеМарки.Выгрузить(Отбор, "КодАкцизнойМарки");
	
	Возврат ПоместитьВоВременноеХранилище(АкцизныеМарки, Форма.УникальныйИдентификатор);
	
КонецФункции

// Возвращает информацию по акцизным маркам для строки ТЧ Товары
//
// Параметры:
//  Форма				 - УправляемаяФорма - Форма
//  ИдентификаторСтроки	 - Строка - Идентификатор строки ТЧ
//  КодАкцизнойМарки	 - Строка - Код акцизной марки
// 
// Возвращаемое значение:
//  Структура - Количество, АкцизнаяМаркаНайдена, КодАкцизнойМарки
//
Функция ДанныеПоАкцизнымМаркам(Форма, ИдентификаторСтроки, КодАкцизнойМарки = "") Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект") Тогда
		Источник = Форма.Объект;
	Иначе
		Источник = Форма;
	КонецЕсли;
	
	Отбор = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
	НайденныеСтроки = Источник.АкцизныеМарки.НайтиСтроки(Отбор);
	
	ОтборАкцизнаяМарка = Новый Структура;
	ОтборАкцизнаяМарка.Вставить("ИдентификаторСтроки",        ИдентификаторСтроки);
	ОтборАкцизнаяМарка.Вставить("КодАкцизнойМарки", КодАкцизнойМарки);
	НайденныеСтрокиАкцизнаяМарка = Источник.АкцизныеМарки.НайтиСтроки(ОтборАкцизнаяМарка);
	
	Результат = Новый Структура;
	Результат.Вставить("Количество",           НайденныеСтроки.Количество());
	Результат.Вставить("АкцизнаяМаркаНайдена", НайденныеСтрокиАкцизнаяМарка.Количество() > 0);
	Результат.Вставить("КодАкцизнойМарки",     КодАкцизнойМарки);
	
	Возврат Результат;
	
КонецФункции

// Удаляет акцизные марки для данных табличной части Товары
//
// Параметры:
//  Форма	 - УправляемаяФорма - Форма
//  Данные	 - Массив (СтрокаТЧ) - Строка (строки) для которых требуется удалить акцизные марки
//
Процедура УдалитьАкцизныеМарки(Форма, Данные) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект") Тогда
		Источник = Форма.Объект;
	Иначе
		Источник = Форма;
	КонецЕсли;
	
	Если ТипЗнч(Данные) = Тип("Массив") Тогда
		ИдентификаторыСтрок = Данные;
	Иначе
		ИдентификаторыСтрок = Новый Массив;
		ИдентификаторыСтрок.Добавить(Данные);
	КонецЕсли;
	
	Для Каждого ИдентификаторСтроки Из ИдентификаторыСтрок Цикл
		
		Отбор = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
		НайденныеСтроки = Источник.АкцизныеМарки.НайтиСтроки(Отбор);
		
		Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл
			Источник.АкцизныеМарки.Удалить(Источник.АкцизныеМарки.Индекс(СтрокаТЧ));
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Загружает акцизные марки из временного хранилища
//
// Параметры:
//  Форма						 - УправляемаяФорма - Форма
//  ИдентификаторСтроки			 - Строка - Индентификатор строки ТЧ
//  АдресВоВременномХранилище	 - Строка - Адрес во временном хранилище
// 
// Возвращаемое значение:
//   - 
//
Функция ЗагрузитьАкцизныеМаркиИзВременногоХранилища(Форма, ИдентификаторСтроки, АдресВоВременномХранилище) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект") Тогда
		Источник = Форма.Объект;
	Иначе
		Источник = Форма;
	КонецЕсли;
	
	УдалитьАкцизныеМарки(Форма, ИдентификаторСтроки);
	
	АкцизныеМарки = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	Для Каждого СтрокаТЧ Из АкцизныеМарки Цикл
		НоваяСтрока = Источник.АкцизныеМарки.Добавить();
		НоваяСтрока.КодАкцизнойМарки = СтрокаТЧ.КодАкцизнойМарки;
		НоваяСтрока.ИдентификаторСтроки = ИдентификаторСтроки;
	КонецЦикла;
	
	Возврат ДанныеПоАкцизнымМаркам(Форма, ИдентификаторСтроки, "");
	
КонецФункции

// Заполняет служебные реквизиты в табличной части "Товары" в процедурах ПриСозданииНаСервере
//
// Параметры:
//  Форма				 - УправляемаяФорма - Форма
//  ИмяКолонкиКоличество - Строка - Имя колонки "Количество"
//
Процедура ЗаполнитьСлужебныеРеквизиты(Форма, ИмяКолонкиКоличество = "Количество") Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект") Тогда
		Источник = Форма.Объект;
	Иначе
		Источник = Форма;
	КонецЕсли;
	
	РеквизитВидАлкогольнойПродукции = ИнтеграцияЕГАИСПереопределяемый.РеквизитНоменклатурыВидАлкогольнойПродукции();
	Если НЕ ЗначениеЗаполнено(РеквизитВидАлкогольнойПродукции) Тогда
		РеквизитВидАлкогольнойПродукции = "ВидАлкогольнойПродукции";
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Т.НомерСтроки,
	|	Т.ИдентификаторСтроки,
	|	Т.Номенклатура,
	|	Т.Характеристика,
	|	Т.Упаковка
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	&Товары КАК Т
	|ИНДЕКСИРОВАТЬ ПО
	|	Т.ИдентификаторСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.ИдентификаторСтроки,
	|	Т.КодАкцизнойМарки
	|ПОМЕСТИТЬ АкцизныеМаркиПодготовка
	|ИЗ
	|	&АкцизныеМарки КАК Т
	|ИНДЕКСИРОВАТЬ ПО
	|	Т.ИдентификаторСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Т.КодАкцизнойМарки) КАК КоличествоАкцизныхМарок
	|ПОМЕСТИТЬ АкцизныеМарки
	|ИЗ
	|	АкцизныеМаркиПодготовка КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.ИдентификаторСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(Товары.Номенклатура." + РеквизитВидАлкогольнойПродукции + ".Маркируемый, ЛОЖЬ) КАК МаркируемаяАлкогольнаяПродукция,
	|	АкцизныеМарки.КоличествоАкцизныхМарок КАК КоличествоАкцизныхМарок
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ АкцизныеМарки КАК АкцизныеМарки
	|		ПО (АкцизныеМарки.ИдентификаторСтроки = Товары.ИдентификаторСтроки)");
	
	Товары = Источник.Товары.Выгрузить();
	ДополнениеКИндексу = 0;
	Если Товары.Колонки.Найти("НомерСтроки") = Неопределено Тогда
		ДополнениеКИндексу = 1;
		Товары.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0)));
		
		КоличествоСтрок = Товары.Количество() - 1;
		Для НомерСтроки = 0 По КоличествоСтрок Цикл
			Товары[НомерСтроки].НомерСтроки = НомерСтроки;
		КонецЦикла;
	КонецЕсли;
	
	Запрос.Параметры.Вставить("Товары", Товары);
	Запрос.Параметры.Вставить("АкцизныеМарки", Источник.АкцизныеМарки.Выгрузить());
	
	Отбор = Новый Структура;
	Отбор.Вставить("НомерСтроки");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтрокаТЧ = Источник.Товары[Выборка.НомерСтроки - 1 + ДополнениеКИндексу];
		СтрокаТЧ.МаркируемаяАлкогольнаяПродукция = Выборка.МаркируемаяАлкогольнаяПродукция;
		СтрокаТЧ.КоличествоАкцизныхМарок         = Выборка.КоличествоАкцизныхМарок;
		
		АкцизныеМаркиКлиентСервер.ЗаполнитьИндексАкцизнойМарки(СтрокаТЧ, ИмяКолонкиКоличество);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти