#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ПараметрыПодключенияКЕГАИС.Видимость             = ПравоДоступа("Чтение", Метаданные.РегистрыСведений.НастройкиОбменаЕГАИС);
	Элементы.КлассификаторАлкогольнойПродукцииЕГАИС.Видимость = ПравоДоступа("Чтение", Метаданные.Справочники.КлассификаторАлкогольнойПродукцииЕГАИС);
	Элементы.КлассификаторОрганизацийЕГАИС.Видимость          = ПравоДоступа("Чтение", Метаданные.Справочники.КлассификаторОрганизацийЕГАИС);
	Элементы.Справки1ЕГАИС.Видимость                          = ПравоДоступа("Чтение", Метаданные.Справочники.Справки1ЕГАИС);
	Элементы.Справки2ЕГАИС.Видимость                          = ПравоДоступа("Чтение", Метаданные.Справочники.Справки2ЕГАИС);
	Элементы.ТТНВходящиеЕГАИС.Видимость                       = ПравоДоступа("Чтение", Метаданные.Документы.ТТНВходящаяЕГАИС);
	Элементы.ТТНИсходящиеЕГАИС.Видимость                      = ПравоДоступа("Чтение", Метаданные.Документы.ТТНИсходящаяЕГАИС);
	Элементы.ОстаткиЕГАИС.Видимость                           = ПравоДоступа("Чтение", Метаданные.Документы.ОстаткиЕГАИС);
	Элементы.АктыПостановкиНаБалансЕГАИС.Видимость            = ПравоДоступа("Чтение", Метаданные.Документы.АктПостановкиНаБалансЕГАИС);
	Элементы.АктыСписанияЕГАИС.Видимость                      = ПравоДоступа("Чтение", Метаданные.Документы.АктСписанияЕГАИС);
	Элементы.ЧекиЕГАИС.Видимость                              = ПравоДоступа("Чтение", Метаданные.Документы.ЧекЕГАИС);
	Элементы.ЧекиЕГАИСвозврат.Видимость                       = ПравоДоступа("Чтение", Метаданные.Документы.ЧекЕГАИСВозврат);
	
	Элементы.КорректировкаОстатковЕГАИС.Видимость = 
		ПравоДоступа("Добавление", Метаданные.Документы.АктПостановкиНаБалансЕГАИС)
		И ПравоДоступа("Добавление", Метаданные.Документы.АктСписанияЕГАИС)
		И ПравоДоступа("Добавление", Метаданные.Документы.ВозвратИзРегистра2ЕГАИС)
		И ПравоДоступа("Добавление", Метаданные.Документы.ПередачаВРегистр2ЕГАИС)
		И ПравоДоступа("Просмотр", Метаданные.Обработки.ПомощникКорректировкиОстатковЕГАИС);
	
	СобытияФормЕГАИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПараметрыПодключенияКЕГАИС(Команда)
	
	ОткрытьФорму("РегистрСведений.НастройкиОбменаЕГАИС.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КлассификаторАлкогольнойПродукцииЕГАИС(Команда)
	
	ОткрытьФорму("Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КлассификаторОрганизацийЕГАИС(Команда)
	
	ОткрытьФорму("Справочник.КлассификаторОрганизацийЕГАИС.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Справки1ЕГАИС(Команда)
	
	ОткрытьФорму("Справочник.Справки1ЕГАИС.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Справки2ЕГАИС(Команда)
	
	ОткрытьФорму("Справочник.Справки2ЕГАИС.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТТНВходящиеЕГАИС(Команда)
	
	ОткрытьФорму("Документ.ТТНВходящаяЕГАИС.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТТНИсходящиеЕГАИС(Команда)
	
	ОткрытьФорму("Документ.ТТНИсходящаяЕГАИС.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиЕГАИС(Команда)
	
	ОткрытьФорму("Документ.ОстаткиЕГАИС.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура АктыПостановкиНаБалансЕГАИС(Команда)
	
	ОткрытьФорму("Документ.АктПостановкиНаБалансЕГАИС.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура АктыСписанияЕГАИС(Команда)
	
	ОткрытьФорму("Документ.АктСписанияЕГАИС.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЧекиЕГАИС(Команда)
	
	ОткрытьФорму("Документ.ЧекЕГАИС.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЧекиЕГАИСвозврат(Команда)
	
	ОткрытьФорму("Документ.ЧекЕГАИСВозврат.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	
	ИнтеграцияЕГАИСКлиент.ВыполнитьОбмен();
	
КонецПроцедуры

&НаКлиенте
Процедура ПомощникКорректировкиОстатковЕГАИС(Команда)
	
	ОткрытьФорму("Обработка.ПомощникКорректировкиОстатковЕГАИС.Форма",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВозвратыИзРегистра2ЕГАИС(Команда)
	
	ОткрытьФорму("Документ.ВозвратИзРегистра2ЕГАИС.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередачиВРегистр2ЕГАИС(Команда)
	
	ОткрытьФорму("Документ.ПередачаВРегистр2ЕГАИС.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти